{
  "posts": [
    {
      "id": "perihelion",
      "title": "Perihelion: Finding Flow State in an Age of AI Interruption",
      "featured": true,
      "date": "2025-10-28",
      "readTime": "Deep Dive",
      "description": "How to find flow state and deep work in an age of AI interruption. A reflection on creative mastery, design systems, and the craft of subtraction.",
      "content": "<iframe width=\"100%\" height=\"400\" src=\"https://www.youtube.com/embed/7tTCZOHUWFA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\nIn astronomy, perihelion is the point at which a celestial body comes closest to the Sun. It's the moment of maximum velocity. Maximum intensity. Afterward, it drifts away. But that instant - that single instant - contains all the accumulated energy of the journey.\n\nJiro Ono, the legendary sushi master, spends 70 years searching for his perihelion.\n\nHe doesn't call it that. He calls it perfection. Purity. But it's the same thing: that point where everything converges. Where detail, repetition, and the silence of decades of craftsmanship condense into a single gesture.\n\nA grain of rice. A knife movement. Nothing more.\n\nEverything.\n\n#\n\n#\n\n# I. Orbit: Understanding the Creative Process\n*[0:00 - 1:30: The introduction. Soft strings, almost inaudible.]*\n\nWhen you design, code, create - you're in orbit.\n\nSome days far from the center. Scattered. Jumping between tasks, tools, notifications. Distance protects you. It doesn't burn. But you don't move forward either.\n\nOther days, closer. Hours disappear. You forget to eat. Code flows. Design breathes. You don't think about what you're doing; you simply do it.\n\nIt's flow state. That state where the brain releases conscious control and lets specialized neural networks - trained over years - work alone. Without supervision. Without friction.\n\nBut there's an even deeper point.\n\nPerihelion.\n\n#\n\n#\n\n# II. Approach: The Path to Mastery\n*[1:30 - 3:00: Piano enters. Strings begin to tense.]*\n\nCharles Eames said: \"The details are not just details. They make the design.\"\n\nHe wasn't talking about ornament. He was talking about essence.\n\nThat place where if you remove something, everything collapses. If you add something, everything becomes contaminated.\n\nIt's the closest point to truth.\n\nAnd to get there, you can't rush. You have to orbit. Again and again. Observe. Iterate. Repeat the same movement 10,000 times until the pattern emerges.\n\nJiro didn't invent sushi. He eliminated everything that wasn't sushi.\n\nThat's the difference.\n\nWe add: variants, use cases, exceptions, flexibility.\n\nWe call it \"coverage.\"\n\nBut mastery is the opposite. It's subtraction. It's saying: this, and only this, is necessary.\n\nAnd when you finally arrive - when you touch that point - everything else reveals itself as obvious.\n\n#\n\n#\n\n# III. The Problem: AI and the Fragmentation of Deep Work\n*[3:00 - 4:30: Tension grows. Violin, viola. Layers accumulating.]*\n\nBut now something has changed.\n\nAI is here. Cursor, Figma, generative models whispering at every pause.\n\nAnd for the first time in years, it's difficult to reach perihelion.\n\nBecause perihelion requires sustained velocity in one direction. Continuous hours. Total immersion. That deceleration of the external world that allows internal acceleration.\n\nBut AI interrupts.\n\nNot violently. With suggestions. With shortcuts. With the seductive promise that you can get there faster.\n\nAnd technically, it's true. You can generate more. More components. More code. More variations.\n\nBut more isn't perihelion.\n\nPerihelion is the point of maximum closeness, not maximum production.\n\nIt's being so close to the essence that there's no distance between you and what you create.\n\nAnd that can't be accelerated.\n\n#\n\n#\n\n# IV. Broken Orbits: Losing Flow in the Age of AI\n*[4:30 - 5:45: The climax begins to build. Everything converges.]*\n\nI've noticed something.\n\nMy best work - the work that truly IS something - was born in long sessions. Uninterrupted. No AI. No Slack. No browser.\n\nJust me, the problem, and hours evaporating.\n\nThat state where the prefrontal cortex shuts down and creative networks work alone. Where you don't supervise your own thinking; it simply flows.\n\nTransient hypofrontality, neuroscientists call it. The brain releasing control to allow what it already knows but can't verbalize to emerge.\n\nAI doesn't enter there.\n\nNot because it's incapable. Because it's a dialogue. And dialogue keeps you in the prefrontal cortex—supervising, evaluating, adjusting.\n\nNever letting go.\n\nNever reaching perihelion.\n\n#\n\n#\n\n# V. The Decision: Protecting Deep Work and Flow State\n*[5:45 - 7:00: The crescendo. Strings at their peak.]*\n\nAI isn't the enemy.\n\nIt's a tool for the outer orbit. For the superficial. For what scales.\n\nBut perihelion - that point of maximum closeness to what's true - remains human.\n\nIt remains slow.\n\nIt remains boring, sometimes.\n\nAnd it requires something radical in a world of speed: protecting the long hours. The sessions where you disappear. Where a detail consumes your entire day and at the end - only at the end - you see that detail was everything.\n\nTurn off notifications.\n\nClose Cursor.\n\nLet the code, the design, the problem look back at you for hours.\n\nUntil you reach the point where there's no distance.\n\nWhere you are the work.\n\nWhere you touch perihelion.\n\n#\n\n#\n\n# VI. The Journey: Embracing the Orbit\n*[7:00 - 7:48: The resolution. Everything settles. Silence that breathes.]*\n\nJiro, after 70 years, says: \"No one knows where the top is.\"\n\nHe hasn't arrived.\n\nPerhaps he never will.\n\nBut each day he gets closer. Each movement. Each repetition. Each minimal refinement that no one else notices.\n\nThat's the orbit.\n\nAnd perihelion isn't a destination. It's an instant. Fleeting. Intense. True.\n\nAnd then you drift away again.\n\nBut you know it existed. That you touched it.\n\nAnd that changes everything.\n\nThe essence is there. Underneath. Always.\n\nYou just have to get close enough to feel it.\n\nBut first, you have to let go of control.\n\nDisconnect.\n\nAnd let the orbit carry you.\n\nWhen was the last time you reached your perihelion? Share your experience in the comments below.\n\nIf this resonated, subscribe for more reflections on design systems, creative flow, and staying human in an AI-driven world.\n\n#FlowState #DeepWork #CreativeProcess #Mastery #AIandCreativity",
      "tags": [
        "Flow",
        "Deep Work",
        "Philosophy"
      ],
      "series": "AI & Future of Work",
      "image": "assets/images/posts/perihelion.jpg"
    },
    {
      "id": "roi-design-system",
      "title": "Why your Design System Manager can’t see ROI",
      "featured": true,
      "date": "2025-10-15",
      "readTime": "Management",
      "description": "If you lead product or engineering, this post breaks down metrics, common mistakes, and concrete tactics to surface real ROI.",
      "content": "**If 40 teams customize the same button, your Design System has a problem (and how to detect it)**\n\nDesign Systems teams in complex contexts carry a silent burden:\n\nNo one knows for sure how much of what they build actually impacts production.\n\nYou have documentation. You have components. You have governance.\n\nBut you don't have visibility.\n\nOne day you review 3 different products and find that the same component was implemented in 4 different ways in each one.\n\nAnd it happens silently. Without anyone seeing it as a problem.\n\nThat is the reality of scaling a system in contexts with multiple autonomous teams.\n\n**It's not chaos. It's invisibility.**\n\n#\n\n#\n\n# **🧩 The metrics dilemma**\nIn complex financial contexts, the situation is more complicated than in other sectors.\n\nIt's not just that you have multiple products: you have regulations, audits, compliance, and constant pressure for efficiency.\n\nA change in your design system isn't \"fast and furious\"; it's coordinated, measured, tracked.\n\nSo, how do you measure if your system works?\n\nHere's the important part:\n\n#\n\n#\n\n# **🎯 The trap of counting components**\nI've seen leaders say: \"*We used 450 instances of our button last month.*\"\n\nSounds impressive.\n\nMeans nothing.\n\nWhy?\n\nA button inside a header that appears on 30 pages: does it count as 1 or 30?\n\nA component copied and pasted in 15 places, does it count towards your system or count as 15 failures?\n\nMore importantly: if you build 200 components but only 15 are seriously used...\n\n**Do you really have a system or do you have a giant library that no one maintains?**\n\n> The brutal truth is that most teams spend months measuring numbers that say nothing.\n\nYou need to change the approach.\n\n**From \"absolute frequency\" to \"breadth of use\".**\n\nNot \"how many instances of a component\".\n\nBut **\"how many different teams use this component.\"**\n\n#\n\n#\n\n# **📊 The minimum viable to start (and not overcomplicate)**\nFirst sprint (Week 1-2):\n\nForget 50 charts. You need 4 metrics. Period.\n\n1️⃣ **Visual coverage**: What % of your interface uses DS components?\n\n2️⃣ **Adoption by team**: How many teams use the system?\n\n3️⃣ **Consistency score**: How many deviations are there per product?\n\n4️⃣ **Time to component**: How long do teams take to implement a new component?\n\n**That. Is. It.**\n\n#\n\n#\n\n#\n\n# **How to create your baseline in less than two hours:**\n\n* **Select 3 real products from your company.**\n\n* **Count manually (yes, old school):**\n\n* Example: \"*In the onboarding flow, 7 out of 10 screens use proper DS components.*\"\n\n* That is your baseline: **70% coverage in onboarding.**\n\n* Define a realistic 90-day goal, for example: **raise it to 85%.**\n\n* **Calculate your \"consistency score\":**\n\n* Choose 20 representative screens (pick 3-4 key flows: onboarding, transfers, payments...).\n\n* Visually review and note inconsistencies:\n\n* \"This button has 12px padding here, 16px there.\"\n\n* \"This input has a border, in the next one it doesn't.\"\n\n* If your DS covers only 65% in user signup, the remaining 35% is visual and functional debt that will grow with release.\n\n* **Record every deviation (that is your initial score).**\n\n**Trick to scale without going crazy:**\n\n* You can accelerate this process by automating part of the analysis:\n\n* Upload screenshots of those 20 screens to a folder.\n\n* Run a simple script (for example, in Cursor) or use a tool that detects visual or code-level inconsistencies.\n\n* In the end you will get something like:\n\n* \"In these 20 screens I found X deviations. The most critical are: Button padding (8 times), Input border (6), Spacing in cards (4).\"\n\n#\n\n#\n\n# **🔥 The metric that nobody measures but should**\nHere comes what makes you shine:\n\nEvery time a team detaches or customizes an existing component (instead of using it directly), they record it.\n\nSimple: a comment in Figma or a ticket.\n\n\"We used Button but with custom border-radius because our use case is different.\"\n\nNow multiply.\n\n**If 40 teams detach the Button in 5 different ways = same problem solved 40 times.**\n\nTranslation: **massive waste.**\n\nWasted hours. Inconsistency in production. Accumulated technical debt.\n\nBut here is the fascinating part.\n\nEvery detach you record is pure insight.\n\n**It's not an adoption failure.**\n\n**It's a design failure.**\n\nBecause now you know exactly where to iterate.\n\n#\n\n#\n\n# **💡 The script that changes everything**\nHere is the final copy to explain code scanning (without Figma) and with your clear and technical tone:\n\n**How to know how many teams really use your standard component and how many go rogue?**\n\nA simple script gives it to you in minutes.<br>It doesn't touch Figma or docs—only real code.\n\n**Automatically scans the entire codebase:**<br>Looks for imports of the type:\n\n```\n<code>import { Button } from 'design-system';</code>\n```\nCounts each import and groups it by folder, team, or context (you can map this to your monorepo or project naming).\n\n**Detects \"copies\" and customizations:**<br>Locates components that are named the same but redefined locally, or that extend the original with styles, props, or duplicated code.<br>Example:\n\n```\nimport { Button } from 'design-system';\n\n// I create a variant for special cases\nconst DangerButton = (props) => (\n  <Button {...props} color=\"red\" />\n);\n```\nEach case adds up as a \"customized instance\".\n\n**It gives you a real report:**\n\n```\nOnboarding Team: 11 standard imports, 2 custom \nAccounts Team: 17 standard imports, 7 custom \nPayments Team: 13 standard imports, 1 custom\n```\nSo you see, without interpretation, which teams adopt the pattern 100% and which ones \"break\" it.\n\n**You can extract extra info:**<br>The script also lists the props used, most frequent variants, or props suspicious of being a hack:\n\n```\n<Button size=\"large\" color=\"error\" style={{borderRadius: 20}} />\n```\n**What do you gain?**\n\n* Actionable data to know which components work and which invite custom.\n\n* Solid arguments to prioritize refactors (\"this team always breaks it, let's talk to them\").\n\n* A true view of the health and adoption of your Design System—the metric that really matters.\n\n**Zero human effort after setup (2 hours max).**\n\n#\n\n#\n\n# **🧠 Adoption prediction before it fails**\nHere is where simple machine learning shines (and I don't say this as AI hype).\n\nThe pattern is clear:\n\nIf you see that similar components were detached 3+ times in the last 90 days...\n\nThe new component you are going to launch **will probably ALSO be detached.**\n\nWhy?\n\nBecause there is an unresolved pattern in that component domain.\n\nSo, before launching that new component, you can:\n\n* Automatically detect the historical detach pattern\n\n* Correlate it with the new component\n\n* **Generate alerts**: \"This Button has 8 deviations in history. Your new component has similarities. Review these 3 use cases before launching.\"\n\n> Basically, **you predict if something is going to fail before it fails.**\n\nThe designer doesn't get frustrated. The component comes out better.\n\nAdoption goes up automatically because you solved the real problem.\n\n#\n\n#\n\n# **📈 How this grows without breaking**\n**Month 1:** 50% coverage in 2 pilot products. Baseline feo but honest.\n\n**Month 2:** Leaders see the problem. Assign resources to improve rejected components.\n\n**Month 3:** Coverage goes up to 68%. Teams start asking for new components (good sign).\n\n**Month 4-6:** Scales to other products. Every new product that enters already starts at 65% coverage because they understand the pattern.\n\n**Month 12:** **80% global coverage. System maintained by 2 people. Estimated annual savings: €200k-400k in design/dev hours.**\n\n#\n\n#\n\n#\n\n# **❌ What NOT to do**\nDon't compare with other companies.\n\n**Every bank is different. Every context is different. Every design system is different.**\n\nHere is where most fail:\n\n* Figma says the best practice is to have 80% reusable components.\n\n* Another bank has 6 designers and 50 components.\n\n* Design Systems Collective says you should have X metric.\n\n* Forgetting to ask teams why they detach components.\n\n* Measuring only frequency instead of understanding the pattern.\n\n* Comparing your system with banks that have different regulatory and business realities.\n\nForget everything.\n\n**Your Design System is subservient to the project, not the other way around.**\n\nFigma's rules are not yours.\n\nThe best practices of another bank are not yours.\n\n**Why?**\n\n* Because your context has specific regulations.\n\n* It has teams with dynamics that are not those of another bank.\n\n* It has code histories and decisions that another company never faced.\n\n> **Invest in knowing your context.<br>*****A simple log of when and why a button is detached can save thousands of euros/month in support and QA.***\n\nThen, design your metrics from there. Not from what others do.\n\n**<br>Common myths in banking DS metrics:**\n\n* \"More components = more maturity\". False. (I've seen banks with +200 components that don't achieve even 60% visual coherence.)\n\n* \"Standard only matters in UX\". False: in banking, the legal auditor uses your screens as evidence.\n\n* \"Comparing with benchmarks from other companies\". False, your context rules.\n\n#\n\n#\n\n# **🚀 Your first move (next 7 days)**\n\n* Take 1 product. Look at 3 complete flows.\n\n* Count: how many components are DS, how many are custom.\n\n* That % is your baseline.\n\n* Set a 90-day goal: +15%.\n\n* Meet with 2 teams. Ask: \"What component would you need that doesn't exist? Which of our components is a problem?\"\n\n**That is enough to move the needle.**\n\n**Key Takeaways / Actions for managers:**\n\n* *Measure teams, not just instances.*\n\n* *Record every custom, it is a strategic signal.*\n\n* *Ask teams why they adapt.*\n\n* *Adjust the score regularly: banking products evolve every quarter.*\n\n> ***If you want your team or your manager to see the impact, print this checklist and use it next quarter.***\n\n**To dig deeper:**\n\n* **Automated audits in Design Systems:**<br>**[Design System Metrics: From Adoption to Impact (by Zeroheight & DS expert Nathan Curtis)](https://blog.zeroheight.com/design-system-metrics-adoption-impact/)**\n\n* **How to analyze real breadth of use with code:**<br>**[Measure Adoption of a Design System with Automated Scripts (Medium, Ryan Clark)](https://uxdesign.cc/measuring-adoption-of-a-design-system-32293ffb351c)**\n\n* **Real metrics and tooling for Product Managers:**<br>**[Product Metrics: Find the North Star (by Intercom)](https://www.intercom.com/blog/product-metrics-north-star/)**\n\n* **How to detect \"custom forks\" in component libraries:**<br>**[Detecting UI Consistency and Component Forks in Large Codebases (by Engineering @Airbnb)](https://medium.com/airbnb-engineering/design-system-science-cc0dc49dec10)**\n\n* **Advanced governance guide for complex environments:**<br>**[Governance of Design Systems in Large Organizations (by Sparkbox)](https://seesparkbox.com/foundry/design_systems_governance_perspectives)**\n\n**What would be the savings in hours (or reduction of technical debt) if you could visualize all the customizations that are hidden today?**\n\n#DesignSystems #Banking #ProductLeadership #Metrics #Efficiency",
      "tags": [
        "Management",
        "ROI",
        "Strategy"
      ],
      "series": "Design Systems Mastery",
      "image": "assets/images/posts/roi-design-system.png"
    },
    {
      "id": "interface-dependency",
      "title": "Your product depends on the interface. Agents ignore it.",
      "featured": true,
      "date": "2025-10-01",
      "readTime": "Future Tech",
      "description": "From Alexa to today: building systems that work without screens. What happens when the UI disappears?",
      "content": "Let me tell you a story in two parts.\n\nThe first is complex, but it marks the before and after (and explains why **I'm still hooked on this dilemma**).\n\nThe second is practical: **how you can take advantage of it today**.\n\n<h2>**PART 1: Alexa Shopping and the dilemma of layers**</h2>When I worked at Amazon Alexa Shopping, months before the ChatGPT hype, I became obsessed with one question:\n\n**How do you design a shopping system that works equally well on voice, screens, wearables and multiple languages without having to rebuild everything every time?**\n\n> I spent 6 months thinking about this. There were no references, gurus or literature on \"**Multimodal Design Systems applied to shopping**\".\n\nInstead of linear flows (search -> view product -> add to cart -> pay), I proposed something different: grouping moments in time.\n\nNo single paths. Multi-path.\n\nBut here's the technical part that had me obsessed:\n\n**Each \"moment\" was not a fixed component of the Design System. It was a group of information that auto-generated into a multimodal component on the fly.**\n\nLet me explain this because it's the core of everything:\n\n#\n\n#\n\n# **The auto-generated multimodal component**\nIn a traditional Design System you have:\n\n* A button\n\n* A product card\n\n* A payment form\n\nThey are **pre-designed and static** components.\n\nIn a multimodal system, you have **information groups** that turn into components according to context:\n\n**Information group: \"Confirmation of purchase of AA batteries\"**\n\nContains:\n\n* Product name\n\n* Price\n\n* Saved payment method\n\n* Shipping address\n\n* Estimated delivery date\n\n**And this group self-renders as:**\n\n🔲 **On Echo Show (visual + voice):**\n\n-> Card with product image\n\n-> \"1-Click Buy\" button\n\n-> Voice: \"Should I confirm your order for Duracell batteries for €8.99?\"\n\n🗣️ **On Echo Dot (voice only + light):**\n\n-> No visual\n\n-> Voice: \"Duracell AA batteries, €8.99, arriving tomorrow. Say 'confirm' or 'cancel'\"\n\n-> Pulsing blue LED ring (waiting for response) -> green (confirmed) -> red (cancelled)\n\n👆 **In mobile app (visual + touch):**\n\n-> Expandable card with full details\n\n-> Large \"Confirm purchase\" button\n\n-> Swipe up for more options\n\n📱 **On smartwatch (minimal notification):**\n\n-> \"Your usual battery order - €8.99\"\n\n-> Two buttons: ✓ and ✗\n\n-> Vibration on confirmation\n\n🤖 **In AI agent (API only):**\n\n-> No visual or voice\n\n-> Consume endpoint: <code>POST /orders/confirm</code>\n\n-> Receive: <code>{orderId, status, estimatedDelivery}</code>\n\n#\n\n#\n\n# **And here's the magic:**\n**The same group of information generates 5 different components automatically.**\n\nYou don't build 5 separate components.\n\nYou build **a system that knows what to render based on the device**.\n\nThe best part is that:\n\n**When the user changes device mid-flow, the component regenerates in the new context without losing state.**\n\n#\n\n#\n\n# Real example (beyond typical cross-device):\nSuppose that not only the flow is resumed between devices, but the component reconfigures itself in real time according to the \"information group\" and the channel in which it appears.\n\n* User is cooking and asks Alexa by voice: \"Is there any oil left?\"\n\n* Alexa responds by voice: \"There's little left. You can order your favorite.\"\n\n* Alexa activates the \"recurring order\" component in voice-only mode, asking: \"Should I order it for today?\"\n\n* User responds with a gesture (moving their hand close to Alexa):\n\n* The system translates that gesture as \"yes, order oil\" because the light pattern and distance are configured for that action.\n\n* Without human intervention, the system groups all relevant info (product, address, payment method, history) into a base object that can be interpreted in any context.\n\n* The user, already out of the house, opens the Amazon mobile app:\n\n* The system detects the channel change and **instantly generates a touch component**, with a \"Cancel order\" button, brand change options, and a summary notification.\n\n* All state, options, and flow context are maintained, but **the component is not the same as in Alexa: it automatically adapts to the touch and visual capabilities of the device**.\n\nThe system understands that there is no \"button to order oil\", but **the essence of the order**, which can take shape as a voice phrase, onscreen option, wearable vibration, or an AI agent API request.\n\nThus each \"moment\" of the experience is **multimodal and adaptable**, not just cross-device.\n\n> **Same flow. Multiple devices. One single system.**\n\nAnd this was possible because each multimodal component had these layers:\n\n🔲 **Visual layer:** 2D components of traditional DS (cards, buttons, forms)\n\n🗣️ **Conversational layer:** voice text fragments\n\n👆 **Input layer:** interaction rules (touch, voice, gestures, distance sensors)\n\n🔌 **Data layer:** API with the information group\n\n🧭 **Navigation layer:** transition rules (where you come from, where you're going)\n\nDepending on the device, the system activated the necessary layers **and generated the component on the fly**.\n\nIn 2022, this sounded abstract.\n\nBecause that doesn't scale when you have 15 different Alexa device types, plus mobile app, plus web, plus wearables.\n\nIn 2025, with AI agents buying alone...\n\n<h2>**PART 2: Why this matters and how to take advantage of it now**</h2>What changed this week:\n\nAI agents are now buying by themselves.<br><br>**You ask an assistant: *****\"Hire 10 creators for my campaign\"*****.**\n\n**The agent searches, compares, pays the $50 with your prior permission, and delivers results.**\n\nNo app. No checkout. No forms.\n\n**The AI agent is just another \"device\", even if it acts without visual or voice. Just business logic.**\n\n#\n\n#\n\n#\n\n# **The data that backs it up**\nThis is not science fiction. The numbers are clear:\n\n📊 **$1.7 trillion** in AI-driven commerce projected for 2030 (Edgar Dunn & Co.)\n\n📊 **25% of online sales** will be performed by AI agents by then (PayPal CEO)\n\n📊 **1M+ merchants** on Shopify already enabled to sell through conversational agents\n\n📊 **58% of financial institutions** attribute revenue growth to IA (McKinsey)\n\n**In Alexa Shopping in 2022, this was an experiment.**\n\n> **In 2025, with agents buying alone, it's the next wave.**\n\n#\n\n#\n\n# **The case that makes it tangible: when Stripe understood the game**\nStripe exemplifies it perfectly:\n\nA single API and context, infinite uses.<br>Not manual integrations but rules, tokens and components that adapt to each channel.<br>If you need a new component for each context, you fall behind.<br>If you define the information groups well, the system self-generates and scales alone.\n\n**How to start building for this future (without rewriting everything)**\n\nThe good news: you don't need to throw away your current system.\n\n<h2>**How to start?**</h2>You can start applying these principles step by step:\n\n#\n\n#\n\n# **1. Stop thinking about fixed components. Start thinking about information groups.**\nInstead of designing \"a product card\", ask yourself:\n\nWhat critical information do I need to show at this moment?\n\n(Name, price, availability, payment method...)\n\nThen define how that information renders according to context:\n\n* **Visual:** card + button\n\n* **Voice:** phrase + confirmation\n\n* **API:** JSON with the same data\n\n* **Wearable:** minimal notification\n\n#\n\n#\n\n# **2. Separate data from presentation.**\nYour \"information group\" should live in an independent data layer.\n\nThe presentation layer decides how to show it according to the device.\n\n#\n\n#\n\n# **3. Make your components capable of continuing across multiple devices.**\nThe flow state should not live in the visual component.\n\nIt should live in a navigation layer that persists between devices.\n\nExample: user starts on voice, continues in app, ends in web.\n\n**Same flow. Multiple contexts.**\n\n#\n\n#\n\n# **4. Turn manual processes into automatic rendering rules.**\nInstead of manually creating variants for each context, define rules:\n\n\"If device = Alexa Dot -> voice only\"\n\n\"If device = Echo Show -> voice + visual\"\n\n\"If device = AI agent -> API only\"\n\n#\n\n#\n\n# **5. Make traceability automatic, not optional.**\nEach auto-generated component must record:\n\n* What information did it contain?\n\n* In what device was it rendered?\n\n* What layers were activated?\n\n* How did the user respond?\n\nAll auditable. Always.\n\n**Why I'm so excited about this**\n\n3 years ago, at Alexa Shopping, I started exploring multimodal components for purchases. I didn't even know if anyone would understand why, but I was determined to take the Design System to its next level.\n\nToday I see AI agents buying in milliseconds, jumping between contexts, managing permissions...\n\nAnd I think: **this is exactly what we were trying to resolve.**\n\nThe difference is that then there was no massive demand.\n\nNow, with $1.7 trillion projected in agentic commerce for 2030...\n\nIt's no longer an experiment.\n\nBut for now, the question is simple:\n\n**To what extent do your components adapt or just copy themselves to each channel?**\n\nBecause that's the difference between scaling and having to create a new variant every time something changes.\n\n💬 **I'd love to read your cases, challenges or doubts. Have you ever managed to have the same flow live in a thousand contexts without redoing components?**\"\n\nLeave it in comments. I want to know what other teams are exploring.\n\n</a>#DesignSystems #ProductLeadership #APIs #IA #AgenticCommerce #Multimodal #AlexaShopping",
      "tags": [
        "AI Agents",
        "Headless",
        "Voice UI"
      ],
      "series": "AI & Future of Work",
      "image": "assets/images/posts/interface-dependency.png"
    },
    {
      "id": "invisible-system",
      "title": "The best design system is the one you don’t notice",
      "date": "2025-09-20",
      "readTime": "Philosophy",
      "description": "Plumbing only becomes visible when it breaks. A good design system should be invisible to developers.",
      "content": "I have worked with systems that had more than 100 components.\n\nThe funny thing is that, at a certain point, no one on the team really knew which was the right one for each context.\n\nEndless discussions, misplaced tickets, legal blocks due to lack of traceability, and developers losing concentration every two minutes...\n\nThe result was clear: the system was not invisible.\n\n**It was noisy. And expensive.**\n\nWell-designed infrastructure disappears.\n\n**Like a city's plumbing: you only notice it when it fails.**\n\n<h2>**❌ The problem no one admits:**</h2>Most Design Systems in banking are UI catalogs with a brand manual.\n\n**Pretty ✨<br>Documented 📚<br>Useless 🗑️**\n\nBecause they don't solve the real problem:\n\n* Teams losing days debating which button to use\n\n* Developers losing context every two tickets\n\n* Legal blocking changes due to lack of traceability\n\n* No one measuring invisible debt\n\nThat time lost regaining focus after each interruption.\n\nYou don't see it on dashboards.<br>But it's what destroys sprints.\n\n<h2>**✅ How to build an invisible system:**</h2>\n\n#\n\n#\n\n#\n\n# **1️⃣ Small and non-negotiable core**\n10-15 core components.<br>Not 146.\n\nThe rest are variants or compositions.\n\n**Why does it matter?**\n\n* If you have 146 components, you surely have 12 buttons, 8 inputs, 6 date pickers...\n\n* Each team will use a different one, no one will know which to update, and technical debt grows in secret.\n\n* When you want to change a global behavior, you end up touching 10 files and crossing your fingers so nothing breaks in production.\n\n#\n\n#\n\n#\n\n# **2️⃣ Controlled regional variations**\n**The typical problem in banking:**\n\nYou have a payment form.\n\nSpain needs to show a specific legal disclaimer.<br>Germany needs a different field order due to regulation.<br>France needs translation + a different number format.\n\n> **The trap:**<br>Each team creates its own version of the component.\n\n**Result:** 15 variants of the same form.<br>All slightly different.<br>All require separate maintenance.<br>**Fork hell.**\n\n#\n\n#\n\n#\n\n# **How Stripe solves it (and how you should solve it):**\nStripe has **a single payment component** that works in 40+ countries.\n\nHow?\n\n**Differences live in configuration, not in code:**\n\n```\n<code>{\n  \"ES\": {\n    \"legalDisclaimer\": \"Texto específico español\",\n    \"fieldOrder\": [\"email\", \"card\", \"name\"],\n    \"dateFormat\": \"DD/MM/YYYY\"\n  },\n  \"DE\": {\n    \"legalDisclaimer\": \"Gesetzlicher Hinweis\",\n    \"fieldOrder\": [\"name\", \"card\", \"email\"],\n    \"dateFormat\": \"DD.MM.YYYY\"\n  }\n}\n</code>\n```\n**The component is the same.**<br>The logic is the same.<br>Only the configuration changes.\n\nYou update the JSON -> it propagates to all markets.<br>**Zero forks.**\n\n🔗 **[Stripe Localization](https://stripe.com/docs/payments/payment-methods#localization)**\n\n**Other examples of what Stripe does well:**\n\n✓ **Real-time IBAN validation:** You don't wait days to know a format is incorrect. You know it while typing.\n\n✓ **Regulated error handling:** Clear messages with specific codes. Legal approves templates once, not every screen.\n\n✓ **Strong Authentication (SCA):** The system automatically detects when it is necessary by regulation and shows it only then.\n\n**The lesson:**<br>They turn regulatory complexity into a competitive advantage.\n\nIt's not magic. **It's infrastructure design.**\n\n📝 **[As I explained in this post: when your prototype starts lying to you, it's because you didn't design infrastructure, you designed theatre](https://buildsystems.substack.com/p/the-day-our-perfect-prototype-started-lying-to-us-61971324637e)**\n\nSystems that are invisible but essential.<br>That prioritize operability over aesthetics.\n\n#\n\n#\n\n#\n\n# **3️⃣ Integrated automatic validation**\nAccessibility, traceability, consistency.\n\n**The system verifies it. Not goodwill.**\n\nWhy does it matter?\n\nBecause if validation depends on someone remembering to review, sooner or later it fails.\n\n**Accessibility:**<br>Automatic contrast tests, header hierarchy, keyboard navigation.<br>If a component doesn't meet WCAG AA, it doesn't go to production. Automatically.\n\n**And this is not optional:**<br>The European Accessibility Act comes into force in June 2025.<br>Banking apps are required to comply with WCAG 2.1 level AA.<br>It's not a recommendation. It's law. With fines.\n\nIf your accessibility validation is manual, you're already late.\n\n#\n\n#\n\n#\n\n# **4️⃣ Internal Source of Truth**\nNot in Figma.<br>Not in third-party tools that control your costs.\n\n**Let's talk real numbers:**\n\n**Typical banking team: 100 developers + 20 UX**\n\n**Figma cost in 2019:**\n\n* Professional: €12/editor/month\n\n* 20 UX editors = €240/month = **€2,880/year**\n\n* Free viewers for developers\n\n**Figma cost in 2024:**\n\n* Professional: €15/editor/month (25% increase)\n\n* Organization: many companies need this plan now\n\n* Organization: €45/editor/month\n\n* 20 editors = €900/month = **€10,800/year**\n\n**But here's the problem:**\n\nNow Figma charges for \"viewer seats\" in Enterprise plans for full access to shared libraries.\n\n**Enterprise plan (the one you really need for governance):**\n\n* Estimated price: €75-100/seat/month\n\n* 120 users (20 UX + 100 devs needing access) = €9,000-12,000/month\n\n* **= €108,000-144,000/year**\n\n**4,000% increase.**\n\nAnd you don't control:\n\n* When prices go up\n\n* What new features you're forced to pay more for\n\n* If tomorrow they decide to change the licensing model\n\nThe real risk is not just the money, but that your governance depends on external decisions. **That's why the source of truth must be internal and controlled by your organization.**\n\n**Why does it matter so much?**\n\nBecause you need something that:\n\n* **For Product Managers:**<br>When a CFO asks \"why does this copy work better?\", you can't respond \"it's in a Figma file someone moved from a folder\".\n\nYou need real data, clear versioning, traceable history.<br>Show what was approved, when, by whom, and what results it gave.\n\n* **For Development:**<br>If the source of truth changes every week because someone updated Figma without warning, developers stop trusting.\n\nInternal documentation, versioned and synchronized with the code, eliminates ambiguity.<br>No debates. No blocks.\n\n* **For Legal:**<br>When regulators ask \"what exactly did you show 6 months ago?\", you can't depend on Figma's history.\n\nYou need an immutable system.<br>That survives changes in tools, prices, or external policies.<br>That responds to audits without collapsing the team.\n\n<h2>**📊 The metric that matters:**</h2>It's not closed stories.<br>It's not \"DS adoption\".\n\nEvery minute lost regaining context is silent debt.\n\nThe kind that kills projects without anyone seeing it coming.\n\n<h2>**🔄 The rituals that keep the system alive:**</h2>**-> Learning demos, not just feature demos**<br>What worked, what failed, what changed. It's not show & tell, it's honest retrospective.\n\n**-> Documented decisions that are actually used<br>**An ADR (Architecture Decision Record) is not a PDF no one opens again.\n\nIt's answering \"why did we do it this way?\" without needing meetings.\n\nWhen someone new asks, there's a clear document that explains:\n\n* What we decided\n\n* Why we decided it\n\n* What alternatives we considered\n\nAnd it's linked to the code, not buried in Confluence.\n\n**-> Prioritized technical debt maps based on real cost**<br>Not on political urgency. On how much it hurts to maintain it.\n\n**Leading a DS is not \"delivering faster\".**\n\nIt is:\n\n* Aligning incentives between teams\n\n* Negotiating exceptions with an expiration date\n\n* Reducing debt silently, without noise\n\n**The best system leader is the one least noticed.**\n\nBecause the system works alone.\n\n<h2>**🎯 If the system is seen, it interrupts.**</h2>**If it helps, it disappears.**\n\n💬 **Questions for systems leaders:**\n\nWhat metric do you use to detect fragmentation?\n\nWhere does your source of truth live?\n\nHow much do you lose every time your team deviates from the flow due to ambiguities?\n\n👇 Share in comments 👇\n\n#DesignSystems #EnterpriseDesign #ProductLeadership #Banking #Governance",
      "tags": [
        "DX",
        "Invisible Design"
      ],
      "image": "assets/images/posts/invisible-system.png"
    },
    {
      "id": "breaking-rules",
      "title": "Your design system doesn’t fail because of bad components",
      "date": "2025-09-10",
      "readTime": "System Ops",
      "description": "It fails because nobody designed who decides when to break the rules. Governance beats any Figma library.",
      "content": "I have spent the last few years building, breaking, and rebuilding design systems at Amazon, Western Union, and startups. And if there is one lesson that repeats like an error loop in the console, it is this:\n\n> **We obsess over the surface and ignore the structure that supports it.**\n\nI'm not talking about components, or tokens, or documentation. I'm talking about the *real* architecture: the one that defines how decisions are made, who has a voice, and what happens when the system collides with the reality of the product.\n\n<h2>**The myth of the \"perfect system\"**</h2>In my article *\"[The Day Our Perfect Prototype Started Lying to Us](https://medium.com/@joanarbo/the-day-our-perfect-prototype-started-lying-to-us-61971324637e)\"*, I told how an impeccable prototype — with fluid interactions, defined states, and apparently solid logic — fell apart in production because no one had questioned **the underlying API**.\n\nThe problem wasn't in Figma. It was in the gap between the *illusion of control* of design and the *real complexity* of the system.\n\nThe same thing happens with Design Systems.\n\nWe create beautiful libraries, with variants for every use case... but we don't design the **evolution protocol**. We don't define how a conflict is resolved when a team needs something that the system doesn't contemplate. We don't establish who can break the rules... and when.\n\n<h2>**True scalability isn't technical. It's political.**</h2>A Design System doesn't scale by having more components. It scales by having **clear mechanisms for decision making**.\n\n* Who decides that a token changes value?\n\n* What happens when a team needs a pattern that contradicts the system?\n\n* How is a *trade-off* between consistency and innovation resolved?\n\nThese are not design questions. They are **governance** questions. And most systems ignore them until it's too late.\n\nIn *\"[Haikus and Tokens](https://medium.com/@joanarbo/haikus-y-tokens-18c753ad2b13)\"*, I wrote that \"Design Tokens are design decisions that propagate through a system\". But I never said the most uncomfortable part: **poorly governed decisions propagate like bugs**.\n\nI also believed that good components were enough... until my system was ignored by 3 teams.\n\n<h2>**The acid test: the first fork**</h2>Every healthy system survives its first *fork*.\n\nThe moment a team, frustrated by bureaucracy or rigidity, decides to create its own version of the system.\n\nMany see it as a betrayal. I see it as a signal.\n\nBecause if your system doesn't allow for *decentralized evolution*, it's not a system. It's a prison.\n\nThe true test is not whether everyone uses your library. It's whether, when someone breaks it, **the system learns instead of punishing**.\n\n<h2>**So, what to do?**</h2>Stop thinking of your Design System as a *product*.\n\nThink of it as a **coordination infrastructure**.\n\n* Define clear, but not rigid rules.\n\n* Document not only *what* to do, but *how to decide*.\n\n* Make the change process visible, not just the result.\n\n* Celebrate *forks* that add value, not just blind obedience.\n\n<h2>**The final irony**</h2>The best Design Systems are not the most used.\n\nThey are the ones that **disappear**.\n\nNot because they are invisible, but because their architecture is so solid that no one has to think about them. The team focuses on solving real problems, not fighting the system.\n\nThat is not achieved with more documentation.\n\n> It is achieved with **less ego and more structure**.\n\n*Joan Arbó*\n\nUX Engineer @ Western Union | Ex-Amazon Alexa\n\n***Has your team already made a fork of your Design System? Don't punish them. Ask yourself: what feedback is it giving me?***\n\nP.S.: If your Design System has an \"owner\" but not a \"disagreement protocol,\" it's already broken. Someone just needs to say it out loud.",
      "tags": [
        "Governance",
        "Ops"
      ],
      "image": "assets/images/posts/breaking-rules.png"
    },
    {
      "id": "two-scales",
      "title": "The two scales of design: atoms and ecosystems",
      "date": "2025-08-28",
      "readTime": "Deep Dive",
      "description": "A question on the last day of a design systems course changed everything—from emotional atoms to Amazon-scale ecosystems.",
      "content": "It was the last day of the Design Systems course at MrMarcel School when Laura asked me the question I couldn't get out of my head.\n\n> \"Joan, we've spent months studying design systems. But I still don't understand how to connect theory with real practice. Why does everything feel so… flat?\"\n\nI fell silent.\n\nI had been working for two years on a project for Alexa, a Conversational Design System. Multimodal interfaces that deployed across different screens, voice, gestures. Systems that orchestrated conversations, music, smart home, all synchronized. It was thinking big. Universe scale.\n\nBut that night I realized: **Laura was asking me about the opposite side.**\n\n> What if the next evolution was not upward, but downward?\n\n**In the next 10 minutes I'm going to show you how to apply the 'Powers of Ten' methodology to systems design. You will discover why working on only one scale (macro or micro) limits your impact, and how thinking in both simultaneously can radically change your results.**\n\n#\n\n#\n\n# Powers of Ten: the lesson we forgot\nThat dawn I remembered a 1977 film that changed how we see the world: \"**Powers of Ten**\" by Charles and Ray Eames.\n\nThe camera is 1 meter away.\n\nEvery 10 seconds, it zooms out 10 times further (10 meters, 100 meters, 1 kilometer…).\n\nThe park. The city. Illinois. United States. The Earth. The solar system. The galaxy. The observable universe.\n\n*We reached 10²⁴ meters. The edge of everything known.*\n\nThen it returns. To the picnic. And continues inward.\n\nTo the man's hand. To the skin. To the cells. To the molecules. To the atoms. To the quarks.\n\n*Down to 10^-16 meters. The minimum expression of matter.*\n\n> 💡 Same point. 40 different orders of magnitude of seeing it. Each scale reveals a completely new reality.\n\n#\n\n#\n\n# Alexa: when designing at the universe scale\nFor two years I designed at the macro extreme.\n\nA user in Boston says: *\"Alexa, good morning\"*\n\nThe system orchestrates:\n\n* Reads personalized news\n\n* Adjusts home lights\n\n* Shows calendar on screen\n\n* Synchronizes reminders on mobile\n\n* Starts Spotify playlist\n\n***One phrase. Five experiences. Three devices. All coherent.***\n\nIt was design at ecosystem scale. Thinking about how complex systems work together. The view from 10^24 meters.\n\nBut that night, after Laura's question, I realized something unsettling:\n\nWhat happens when you go down 40 orders of magnitude? What is the minimum unit of a design system? The minimum expression that can encode meaning?\n\n#\n\n#\n\n# The experiment: wedding invitations from the emotional atom\nI decided to apply \"**Powers of Ten**\" to the most empathetic case I could think of: digital wedding invitations.\n\nThe traditional scale (view from 10 meters):\n\nI had 73 templates in Figma:\n\n* \"Romantic\" Template #1\n\n* \"Modern\" Template #2\n\n* \"Classic\" Template #3\n\nThe process was the usual: couple chooses template, I change colors, adjust names and date, send. *Rinse and repeat.*\n\nIt's the \"human\" scale of design. Where we all normally operate.\n\n#\n\n#\n\n#\n\n# But what if I go down to atomic scale?\nInstead of showing templates, I asked Laura (yes, my student) and her partner:\n\n*\"How do you want your guests to feel when they receive the invitation?\"*\n\nLaura and her partner: *\"Intimate, warm, familiar\"*\n\nI didn't look for *\"Romantic Template #3\"*.\n\n**I went down to the minimum expression. To the emotional tokens of the invitation:**\n\n```\n$invitation-intimacy: (\n. spacing: generous, // breathes, doesn't overwhelm\n. palette: warm-earth, // terracotta, cream, sage\n. typography: gentle, // soft serif, not imposing\n. decoration: minimal. // discreet flowers, not pompous\n);\n```\n**It's like in the Eames film:** when you go down to molecular scale, you discover that what seemed solid (a wedding template) is actually made of atoms (minimal emotional decisions).\n\n#\n\n#\n\n# The two scales in action: Alexa vs wedding invitations\n#\n\n#\n\n#\n\n# **Macro Scale (my project at Alexa — 2 years):**\n**User: Alexa, I want a romantic atmosphere\"**\n\nSystem orchestrates multiple devices:\n\n* Lights → warm amber, 30% intensity\n\n* Music → smooth jazz, low volume\n\n* Screen → fireplace animation\n\n* Temperature → goes up 2 degrees\n\nOne instruction. Four systems. All synchronized.\n\nView from the universe: how complex experiences work together.\n\n#\n\n#\n\n#\n\n# **Micro Scale (wedding invitations — the new approach):**\nBut what makes \"warm amber\" feel romantic and not \"bright white\"?\n\nThere's the atom. The same principle applied to a wedding invitation:\n\n```\n// Alexa's \"romantic atom\"\n$romantic-light: (\n. hue: 30, // warm orange\n. saturation: 85, // rich but not saturated\n. brightness: 30. // intimate, not bright\n);\n\n// The same \"romantic atom\" in an invitation\n$invitation-warmth: (\n. color-primary: hsl(30, 85%, 30%), // same hue\n. color-accent: hsl(30, 75%, 85%), // soft version\n. color-background: hsl(30, 25%, 95%) // almost warm white\n);\n```\n**⚠️ The insight:** For Alexa to work at universe scale, someone had to design first at atom scale. Same with wedding invitations.\n\n#\n\n#\n\n# When the atom defines the universe: real case\nAna and Marcos respond differently: \"Vibrant, international, celebration\"\n\n**Micro Scale (the tokens of their invitation):**\n\n```\n$invitation-celebration: (\n. spacing: dynamic, // overlapping elements\n. palette: festive-bold, // electric blue + gold\n. typography: geometric, // architectural sans-serif\n. decoration: maximal. // festive ornamentation\n);\n```\n**Macro Scale (their entire digital wedding experience):**\n\nFrom those atoms, the system automatically generates:\n\n* Save the date (first contact)<br>Uses tokens: dynamic spacing, festive palette<br>Mood: \"something big is coming\"\n\n* Main invitation (core experience)<br>Same tokens, more complex hierarchy<br>Mood: \"international celebration\"\n\n* RSVP card (interaction)<br>Tokens applied to form<br>Mood: \"respond with energy\"\n\n* Thank you notes (farewell)<br>Softer but recognizable tokens<br>Mood: \"thanks for celebrating with us\"\n\n> All coherent. Because emotional atoms are consistent.\n\nIt's exactly like \"**Powers of Ten**\":\n\nFrom 10^-16 (the `$festive-bold: hsl(210, 100%, 50%)` token) to 10^24 (the entire digital wedding experience) there are 40 scales in between.\n\n> 💡 If the atom doesn't encode emotion correctly, the entire wedding experience feels generic.\n\n#\n\n#\n\n# The numbers that validated the two scales\nSix months testing this approach with digital wedding invitations:\n\n📊 Client satisfaction: 78% → 94%\n\n⏱️ Iterations to approval: 5–7 → 2–3.\n\n💰 Conversion rate: 23% → 41%\n\n📈 Referrals: 12% → 38%\n\n#\n\n#\n\n# The revealing part:\n**Couples stopped asking \"change this color for that\" (macro thinking, template level) and started saying \"it feels exactly like us\" (coherence from micro, atom level).**\n\nBecause when you design invitations from the minimal emotional expression upward, **each piece inherits the couple's personality.**\n\n#\n\n#\n\n# What Laura really asked me\nLaura wasn't questioning design systems theory.\n\nShe was pointing to something deeper: **we all think of design systems on only one scale.**\n\nI had spent two years at the macro extreme with Alexa:\n\n* Multimodal experiences orchestrating devices\n\n* Synchronized cross-platform systems\n\n* Complex ecosystems of experiences\n\nBut I had ignored the opposite extreme in wedding invitations:\n\n* What is the emotional atom of an invitation?\n\n* What is the minimum expression that defines \"romantic\"?\n\n* How is \"family intimacy\" encoded in a single token?\n\n**As in the Eames film:** if you only see invitations from \"full template\", you never discover the emotional atoms that build them.\n\n> 🎯 The future of design is not choosing macro or micro. It is thinking in both scales simultaneously.\n\n#\n\n#\n\n# The connection between Alexa and a wedding invitation\nThis is how it works in both cases:\n\n**Micro Scale (10^-16): A color token**\n\n```\n// In Alexa\n$ambient-romantic: hsl(30, 85%, 30%);\n\n// In wedding invitation\n$invitation-warmth: hsl(30, 85%, 30%);\n```\n**Molecular Scale (10^-8): A component**\n\n```\n// In Alexa\n<LightControl mood=\"romantic\" />\n\n// In invitation\n<Card emotional-tone=\"intimate\" />\n```\n**Cellular Scale (10^0): A complete scene**\n\n```\n// In Alexa\n<RomanticAmbience room=\"living\" />\n\n// In invitation\n<WeddingInvitation couple=\"Laura-Pablo\" />\n```\n**Ecosystem Scale (10^8): A complete experience**\n\n```\n// In Alexa (multi-device)\n<SmartHomeExperience mood=\"romantic\" />\n\n// In wedding (multi-format)\n<WeddingExperience theme=\"intimate-celebration\" />\n```\n**Each scale builds on the previous one. But without the right atoms at 10^-16, the entire universe at 10^24 feels generic.**\n\nWhether it's Alexa orchestrating your home or a wedding invitation arriving on your WhatsApp.\n\n#\n\n#\n\n# What's coming: the bidirectional designer\nI'm developing a methodology that operates in both directions:\n\n**When you go up (macro):**\n\n* From wedding tokens → save the date → invitation → complete experience\n\n* Like building a celebration from its emotional atoms\n\n**When you go down (micro):**\n\n* From \"I want an intimate wedding\" → what palette? → what tokens define intimacy?\n\n* Like understanding why an invitation feels a certain way\n\n> The power: Emotional coherence from the quark to the universe.\n\nWhether in Alexa multimodal or in digital wedding invitations.\n\n#\n\n#\n\n# **Your turn:**\nOn what scale do you normally design?\n\nHave you thought about macro experiences (like Alexa, ecosystems)?\n\nHave you gone down to micro scale (tokens that feel) in your projects?\n\nWhat would you discover if you changed your scale 10x up or 10x down?\n\n**Exercise for today:**\n\n**Take your last project. Identify what scale you worked on (full templates or basic tokens?). Now imagine: what would you discover if you went down/up 10 scales? Share your answer in comments.**\n\n#DesignSystems #PowersOfTen #SystemsThinking #EmotionalDesign #WeddingDesign #DesignScale",
      "tags": [
        "Scales",
        "Education",
        "Philosophy"
      ],
      "image": "assets/images/posts/two-scales.png"
    },
    {
      "id": "lying-prototype",
      "title": "The Day Our Perfect Prototype Started Lying to Us",
      "featured": true,
      "date": "2025-08-15",
      "readTime": "Case Study",
      "description": "Designers waste weeks chasing 'pixel-perfect' — when bold product questions need real answers, fast.",
      "content": "Sophie, our Product Manager, had that look. You know the one — when someone's trying to solve a puzzle that shouldn't exist.\n\nWe were in a routine demo of our e-commerce checkout flow, the kind of meeting that usually ends with everyone nodding and moving on. Our prototype was gorgeous. Every pixel in place, every interaction smooth. The demo ran like clockwork.\n\nBut Sophie was staring at her laptop, scrolling through customer support tickets.\n\n\"I don't get it,\" she said, breaking the satisfied silence. \"Henrik keeps failing at checkout, but it works perfectly here. If our API throws payment errors, why can't I see them in our documentation?\"\n\nThat's when it hit me. **We'd built a beautiful lie.**\n\n#\n\n#\n\n# The Comfortable Fiction of Happy-Path Testing\n**Our API documentation was like a restaurant menu that only shows pictures of perfect dishes — never the soggy chips or burnt edges that real customers sometimes get.**\n\nMeet our cast of characters:\n\n**Emma** lives in central Amsterdam. She has iDEAL banking, multiple saved cards, and her postcode gets next-day delivery for everything. When Emma shops, the internet loves her back.\n\n**Henrik** is a university student in rural Finland. His Nordea card gets declined for mysterious cross-border reasons, shipping to his address takes two weeks, and half the products he wants are \"not available for delivery to Finland.\" Henrik's shopping experience is an obstacle course.\n\n**Marcel** runs procurement for a mid-size company in Lyon. He needs bulk discounts, SEPA transfers, and someone from accounting to approve anything over €500. The e-commerce world wasn't built for Marcel's French procurement regulations.\n\nOur documentation only knew how to be Emma. It had never met Henrik or Marcel.\n\n#\n\n#\n\n# The €75,000 Documentation Problem\nHere's what we discovered: Henrik wasn't just failing at checkout. He was costing us serious money.\n\nEvery time Henrik's card got declined for a GDPR-related restriction we hadn't documented, someone called customer service. Every time his Finnish address triggered an error we'd never tested, we lost a sale and gained a support ticket.\n\nThe math was brutal. We were spending 48 hours in meetings trying to understand problems that should have taken 30 seconds to reproduce.\n\nOur beautiful documentation had become an expensive fiction.\n\n#\n\n#\n\n# The Fix: When Documentation Meets Reality\n**So we did something simple that felt radical. We put Henrik, Emma, and Marcel directly into our API documentation.**\n\nNow, when Sophie opens our docs, she sees a sidebar with three buttons. Click \"Henrik,\" and suddenly the same checkout API that worked perfectly for Emma starts throwing real errors: \"*Payment method not available in Finland.*\" \"*Shipping delayed due to customs requirements.*\" \"*Product restricted under EU regulations.*\"\n\nIt's not just different data — it's different reality. Henrik's button makes the API slower (rural Finnish internet), pickier (Nordic banking restrictions), and more honest about what doesn't work across the Single Market.\n\nThe testing environment stopped being a demo reel and became a truth machine.\n\n#\n\n#\n\n# What We Learned About Building for Real People\nThe change was immediate. Sophie could finally see what Henrik saw. Our engineers could debug GDPR edge cases without playing 20 questions with customer service. **Our support tickets for checkout issues dropped by 41%.**\n\nBut the bigger lesson was about who we'd been building for. Emma is real, but she's also easy. She has fiber internet, SEPA compatibility, and lives where everything ships quickly. Building for Emma feels like progress because everything works.\n\nHenrik is real too, but he's inconvenient. His limitations expose every assumption we've made about how European shopping should work. Building for Henrik feels like problem-solving because nothing is guaranteed across 27 member states.\n\nThe beautiful, Emma-optimized checkout that looked so good in demos was actually a wall that kept Henrik out. Our documentation had helped us build that wall by making it invisible.\n\n#\n\n#\n\n# The Bigger Picture: When Perfect Becomes the Enemy of Good\n**This isn't just about e-commerce or APIs. It's about a common management trap: optimizing for the ideal customer while ignoring the real ones.**\n\nEvery business has an Emma — the customer who makes your metrics look great and your demos sing. Every business also has a Henrik — the customer who reveals where your product actually breaks down across the complexity of the European market.\n\nMost teams build documentation like they're writing the owner's manual for a car that only drives on perfect German autobahns. They document the happy path because it's clean, predictable, and makes everyone feel competent.\n\nBut your customers don't live on perfect roads. They live in Henrik's Lapland, where the internet is slow and the banks have different rules. They work in Marcel's Lyon, where nothing is simple and everything needs approval under French commercial law.\n\n#\n\n#\n\n# Three Questions That Changed How We Build\nBefore we ship anything now, we ask:\n\n**Does this work for Henrik?** Not in theory — in practice, with his slow connection and strict Nordic banking requirements.\n\n**Can Sophie test the Henrik scenario herself?** Without scheduling an engineering deep-dive or hoping GDPR compliance works.\n\n**What does failure actually look like?** Not the sanitized error message, but the frustrated user experience across different EU regulations.\n\nThese questions changed how we think about everything from feature specs to marketing copy. Emma shows us what's possible. Henrik shows us what's necessary across the European Single Market.\n\nThe day our documentation started telling the truth about Henrik was the day we stopped building for the customer we wished we had and started building for the customers we actually serve across 27 different regulatory environments.\n\nThat's when our perfect prototype stopped lying and started working.\n\n> Your documentation isn't just instruction manual — it's a mirror. Make sure it's reflecting the right reality across all your markets.\n\n*More to come...*\n\n*I'll dig into the evolution of our API and its ripple effects on how we think about design systems.*\n\n*Want the rest of the story? Join me for the next one.*\n\n**#ProductStrategy #CustomerExperience #TechnicalDocumentation #EuropeanMarkets #ProductLeadership #APIDesign #UserCenteredDesign #GDPR #SingleMarket**",
      "tags": [
        "Prototyping",
        "Process",
        "Reality"
      ],
      "image": "assets/images/posts/lying-prototype.png"
    },
    {
      "id": "ai-thinking",
      "title": "AI won’t take my job, it forces me to think differently",
      "date": "2025-08-01",
      "readTime": "Essay",
      "description": "From asking AI to execute to asking it to challenge me: the prompt and process that actually change how I build.",
      "content": "How I move from \"AI that executes\" to \"AI that challenges me.\" The prompt and process that actually change how I build.\n\nI've seen AI generate files I'd print and frame. I've also seen it break contexts by being too compliant. The difference isn't magic: it's how you talk to it. I'll tell you the change I made: from asking it to execute to asking it to challenge me.\n\n#\n\n#\n\n# A real change: when the AI left me speechless\nAt Western Union, after defining an initial collection of tokens, the AI refined the set and generated an SCSS so clean that I went straight to the CTO: \"This needs to be printed and framed.\" Specifically: it eliminated 27 duplicates, grouped semantic tokens by intent, and proposed a spacing scale that I later adopted in all projects. Learning: the value wasn't the code, it was the conversation that forced us to decide what was immutable.\n\nI've spent years reviewing and teaching token files — in companies like Amazon or Western Union, with large teams, analyzing them in courses and talks — and I had never seen one so polished, just like that, in one go.\n\n#\n\n#\n\n# Vulnerability: what really worries me\nYes, it's scary that now someone with less experience can set up a system in a fraction of the time. My response is not to compete against AI in execution, but to lead context, criteria, and agreements. That doesn't self-generate: it's designed by talking.\n\n#\n\n#\n\n# When AI fails\nThe Achilles heel of AI? If it lacks context, it can fail miserably. Early versions of GPT were terribly compliant: they always answered something, even if it didn't make sense. That's where our value still lies: knowing how to say \"not this way,\" demanding it asks us more and adds depth — not accepting the first draft or the easy answer.\n\n#\n\n#\n\n#\n\n# **Signs that the AI is being compliant (and how to stop it):**\n\n* It gives you long answers without asking for more context -> Answer: ask for 3 questions before proposing solutions.\n\n* It returns perfect code but disconnected from the problem -> Ask for \"rationale, trade-offs, and risks.\"\n\n* It says \"yes\" to everything -> Ask for counterexamples and a quick stress test.\n\n#\n\n#\n\n# The simplest but most powerful prompt I use\nI'll give you the prompt that has given me the best results:\n\n```\nYou are an expert in your field. From now on you will be my advisor on {specific topic}. Don't be compliant with me: question my assumptions, ask me questions before proposing solutions, and raise risks and trade-offs.\n\nLet's work in maximum 10-minute iterations and finish each round with:\n\n1) suggested decision\n\n2) risks\n\n3) next question\n```\n#\n\n#\n\n#\n\n# My 5-step flow\n\n* I define the context in 5 lines (who, for what, constraints).\n\n* I ask for 3 questions and stop (if it doesn't ask, I retry).\n\n* I demand 2 alternatives with trade-offs (not a generic \"best practice\").\n\n* I validate with a small example (not full specs).\n\n* I summarize what I've learned and use it as a prompt for the next iteration.\n\nThe key: it's not magic or flattery — it's opening a demanding conversation dynamic, back and forth, demanding value and refining together.\n\n#\n\n#\n\n# My practical advice\nDare yourself: start a basic project of your own from scratch with the help of AI, tinker, break it, iterate, and when you finish, ask the AI to summarize what you've learned and start again with that summary as the initial prompt.<br>The second, third, and fourth versions will be better and more yours.\n\n#\n\n#\n\n# And you?\nDo you dare to let AI challenge you — not just execute tasks for you? What was the last thing the AI taught you or that you would never have done without it?\n\n#AIUX #DesignSystems #Solopreneur #ProductThinking\n\n> Creativity isn't replaced by AI. But AI, if you understand it, forces you to be more creative than ever.",
      "tags": [
        "AI",
        "Mindset",
        "Career"
      ],
      "image": "assets/images/posts/ai-thinking.png"
    },
    {
      "id": "writing-workflow",
      "title": "How I publish a valuable post every week in 30 minutes",
      "date": "2025-07-20",
      "readTime": "Workflow",
      "description": "No burnout, no waiting for inspiration. My AI-assisted writing system built on Notion.",
      "content": "Can you imagine writing (and publishing), without burning out, without depending on inspiration... and without posturing?<br>The first day I didn't know if I would just write by inertia. Now I enjoy the process (almost) more than the post itself.\n\n> \"Famous people have books written about them after being interviewed. I have an AI that interviews me daily, challenges me and makes my ideas make sense — and that's enough for me.\"\n\n#\n\n#\n\n#\n\n# Why I systematized my process of publishing weekly\nBefore, I thought a valuable post required two or three days of going around in circles, sketching, rewriting and adjusting. <br>As a designer and engineer, I've always looked for clarity... but almost always my first draft is only understood by me (or my closest students), while it rarely resonates with a professional and demanding audience.\n\nUntil I accepted it:\n\n* Publishing has to be sustainable and fast, not perfect.\n\n* the best ideas usually arise after publishing, not before.\n\nSo I set up a weekly routine mixing a template in Notion, a very simple protocol and my new \"*creative partner*\": an AI that interviews me and perfects the result.\n\n* Before: Doubts, blocks, texts that didn't connect.\n\n* After: Freedom, focus and creative control thanks to the routine+AI.\n\n> For example, before each draft stayed unpublished for fear of criticism. Now, I publish without fear of it not being perfect, because real learning comes right after.\n\n#\n\n#\n\n#\n\n# My 30-minute workflow: creating content without burning out\nThe real process, without posturing?\n\n**1. I open my Notion template.<br>** Every week I duplicate a simple \"Daily Card\". It asks me:\n\n```\n#\n\n#\n\n# My daily template in Notion (extract)\n\n- **What is today's specific challenge/topic?**\n- **Why is this specific topic important to me / to others?**\n- **What have I done, experienced or learned about this (with a real anecdote)?**\n- **What barrier slowed me down and how did I get around it (if any)?**\n- **What \"micro-failure\" can I share that helps others?**\n- **What is the main idea I should remember if I could only write 1 line today?**\n- **How can I challenge my audience so they surprise me?**\n- **Clear call to action: What am I looking for today? Feedback, conversation, co-creation...**\n\n*(I add a quick reflection section like a \"mini-diary\" to understand if what I write today connects with the direction I want.)*\n```\n**2. I let the AI interview me based on what I've filled in on the card.<br>** Instead of fighting the blank page, I ask the AI to challenge me — *\"Where is the real problem? Where have I failed? Who does this really serve?\" *<br> Sometimes it refines my generic ideas, other times it turns around and asks exactly what my audience would need to hear.\n\n> *Real example:* \"Today the AI asked me if that example could be useful to someone without a technical background. That made me simplify the whole post.\"\n\n**3. I keep the post compact.<br>** No long essays: the learning or micro-story, at most before/after (**Before: 3 days per post. Now: 30 minutes and an established routine**).\n\n**4. I always publish a visual asset. <br>** Diagram, code snippet or simply an \"before/after comparison\" (sometimes I just export from Figma!). <br>Publishing something tangible separates your message from the fluff and gives real credibility.\n\n**5. I close with an honest CTA.<br>** No \"DM now,\" but a real proposal for interaction: have people comment on their routine, their worst fail, or if they want the template. The best answers become material for the next week's post.\n\n**6. Reflection/confession block.<br>** Always a real line of self-criticism (\"*I don't know if I nailed it for the pro audience today*\" / \"*I was too soft or went for the easy technicality*\"). It's my logbook: I write to organize myself and, in passing, to build community.\n\n#\n\n#\n\n#\n\n# Examples of real prompts and questions I use\n- \"*What did you learn the hard way prototyping with code?*\"<br>- \"*When did a routine or template really help you go faster, for real?*\"<br>- \"*Where do you lose more time or energy: drafting, editing, looking for feedback?*\"\n\n*(If you want, steal these questions for your Notion, Google Doc or paste them into your regular AI.)*\n\n#\n\n#\n\n# Why this routine WORKS\n\n* **Saves time**: I went from days to 30 minutes (sometimes less!) for each post.\n\n* **Frees you from the perfection trap:** Publishing periodically makes me worry less about each sentence — and focus more on learning alongside those who read me.\n\n* **Builds real authority:** Repetition, mini-stories and realistic lessons work much better than any \"*grand theory*\".\n\n#\n\n#\n\n#\n\n# Real vulnerability\nHonestly: I still doubt if my voice connects with the pro audience. Many times I get confused, I'm too empathetic ('sappy') or I'm somewhere between my usual teacher self and my more strategic version. <br>But this \"micro-routine-diary\" gives me focus and, best of all, creates a feedback loop where readers (and even those who criticize...) help improve both my content and my methodology.\n\nAnd you? Do you feel that your voice is sometimes diluted by 'acting like a teacher' or by fear of not sounding professional enough? I do — and that's why I suggest you try my routine and tell me if it also sets you free.\"\n\n#\n\n#\n\n# Do you want the template? Or see how the AI interviews me (really)?\nJust leave a comment \"INTERVIEW\" or send me a message. I'll share the template, script if it helps you start yours.<br>I still haven't found an AI capable of giving me feedback as 'real' as a sincere comment, a productive debate or even an unexpected criticism.\n\n> Routine doesn't kill creativity. On the contrary: it gives it the space to be honest, brief and shared every day.",
      "tags": [
        "Productivity",
        "Writing",
        "Notion"
      ],
      "image": "assets/images/posts/writing-workflow.png"
    }
  ],
  "ideas": [
    {
      "id": "hybrid-engineer",
      "title": "The Collapse of Specialization",
      "date": "2026-01-14",
      "readTime": "12 min read",
      "description": "Prototype: an audit framework to map handoff friction and redesign team structure toward hybrid product builders.",
      "content": "A decade ago, the division of labor in digital products was clear and, apparently, necessary. We had \"Creatives\" who dreamed in Photoshop and \"Technicals\" who built in PHP or Java. This structure, inherited from the industrial assembly line (Fordism), optimized linear production. But software is no longer linear.\n\n> **Visual Concept**\n> An evolutionary diagram. Left: 'Silo Era' (Design -> Spec -> Code). Right: 'System Era' (Tokens <-> Agents <-> UI). Style: Editorial Data Viz.\n\n#\n\n#\n\n# The Era of Specialization (2010-2023)\n\nDuring the SaaS boom, we specialized roles to the point of absurdity. UX Researchers, UI Designers, Interaction Designers, UX Writers, Frontend Developers, CSS Specialists... The theory was that hyper-specialization increased quality. The reality was that it increased **bureaucracy**.\n\nThe cost of coordination (the communication \"overhead\") surpassed the value of individual work. We spent more time syncing Figma with Jira than solving user problems. We created the \"Handoff\" problem: the traumatic moment where intention is lost in translation.\n\n#\n\n#\n\n# The Catalyst: Artificial Intelligence\n\nGenerative AI has commoditized the technical execution of both sides.\n*   **Midjourney/v0** commoditize visual exploration.\n*   **Cursor/Copilot** commoditize code syntax.\n\nIf AI can generate the mock-up and can also write the component in React, what is the human role? **Systemic Orchestration**.\n\n> \"Value no longer resides in moving pixels or writing loops. It resides in defining the *System Logic* that governs both.\"\n\n#\n\n#\n\n# The Renaissance of the Generalist (Full-Stack Designer)\n\nWe are seeing the return of the 90s \"Webmaster\" profile, but with superpowers. A single individual can now conceive, design, and deploy a complete application. Not because they are a genius, but because abstraction tools allow it.\n\nThe \"Full-Stack Designer\" is not a mediocre developer and a mediocre designer. It is a **Product Architect**. Someone who understands that:\n1.  A **Design Token** in Figma is not a color, it's a pre-processor variable.\n2.  An **animation** is not an 'easing', it's a mathematical interpolation function.\n3.  **Accessibility** is not a checklist, it's a correct HTML semantic structure.\n\n#\n\n#\n\n# Engineering Case Study: Validating a Hypothesis\n\nAt Amazon, I observed how hybrid teams (Design Technologists) delivered value 4x faster than segregated teams. Why?\n*   **Zero translation**: No specs. The prototype *is* the specification.\n*   **Immediate technical validation**: If the design broke performance, it was known on day 1, not day 40.\n*   **Fluid iteration**: Changing the design meant changing a variable in the code, not updating 50 artboards.\n\n#\n\n#\n\n# Educational Conclusion\n\nIf you are a designer, stop obsessing over drawing tools and learn how the browser renders your work (Box Model, DOM, CSS Grid). If you are a developer, study Typography, Gestalt, and Visual Hierarchy.\n\nThe future doesn't belong to the one who best uses the tool, but to the one who best understands the **medium**.\n\n---\n\n#\n\n#\n\n#\n\n# Design Maturity Audit\nDo you feel your organization suffers from \"paralysis by specialization\"? **I audit your product team structure** to identify bottlenecks in the Design-Engineering flow and propose a transition toward high-efficiency hybrid models.\n\n[<i class=\"ph ph-arrow-right\"></i> Request Organizational Audit](mailto:me@joanarbo.com?subject=Organizational%20Product%20Audit)",
      "tags": [
        "Philosophy",
        "Career",
        "Strategy"
      ],
      "status": "active"
    },
    {
      "id": "ai-components-ex",
      "title": "Intention-Based Interfaces",
      "date": "2026-01-12",
      "status": "active",
      "readTime": "15 min read",
      "description": "Prototype: an intent engine that renders UI from constraints, validating accessibility and performance in real time.",
      "content": "For the last 40 years, the Graphical User Interface (GUI) paradigm has been **Imperative**. We, as creators, define *exactly* what elements appear on screen, their coordinates, their colors, and their states. 'Paint a 40x20px button at (x,y)'.\n\nThis model assumes we know the user's context better than the system. But with today's diversity of devices and contexts, that assumption is arrogant and inefficient.\n\n> **Visual Concept**\n> Comparison. Side A 'Imperative': A rigid architectural blueprint. Side B 'Declarative': An organic fluid adapting to a container. Style: Abstract, 3D wireframe.\n\n#\n\n#\n\n# The Problem: The Rigidity of Static Components\n\nLet's imagine a simple flow: **\"The user wants to cancel their subscription\"**.\n\nIn traditional design, we create a \"Cancellation Modal\". We design the ideal state, the error state, the loading state. But what happens if the user is on a smartwatch? What happens if the user is using a screen reader at 200wpm? What happens if the user is in a hurry detected by the accelerometer?\n\nThe static component fails because it is deaf to context.\n\n#\n\n#\n\n# The Proposed Solution: Generative UI (Intention-based UI)\n\nGenerative AI allows us to move towards a **Declarative** paradigm. Instead of designing screens, we design **Intentions** and **Constraints**.\n\n#\n\n#\n\n#\n\n# Experiment Architecture\n\nI built a prototype using Vercel AI SDK and a 'headless' component library (without predefined style). The flow is as follows:\n\n1.  **Intention Capture**: The system receives an abstract input. `UserIntent: { action: \"cancel_subscription\", urgency: \"high\", device: \"mobile\" }`.\n2.  **Decision Engine (LLM)**: A small language model (SLM) analyzes the intention against a database of design rules.\n    *   *Rule 1*: Destructive actions require explicit confirmation.\n    *   *Rule 2*: On mobile, avoid centered modals; use 'Bottom Sheets'.\n    *   *Rule 3*: User in a hurry -> Remove marketing text.\n3.  **Just-in-Time Rendering**: The system instances the necessary components in real time.\n\n```jsx\n// The system decides what to render\nif (context.isMobile) {\n  return <BottomSheet variant=\"danger\">\n           <ConfirmButton action={cancel} />\n         </BottomSheet>;\n} else {\n  return <Modal type=\"alert\">\n           <Illustration name=\"sad-face\" />\n           <ConfirmButton action={cancel} />\n         </Modal>;\n}\n```\n\n#\n\n#\n\n# Results and Learnings\n\nThis approach radically changes the role of the Design System. We no longer document \"What a modal looks like\", we document \"When and Why a modal should be used\".\n\nThe resulting interface is intrinsically more accessible and usable, because it has been generated *for* that specific moment, not *for* a generic average user who doesn't exist.\n\n#\n\n#\n\n# Conclusion for System Builders\n\nWe must start treating our components not as static Lego blocks, but as cells capable of adapting. The next great UI library won't have components, it will have **behaviors**.\n\n---\n\n#\n\n#\n\n#\n\n# Design Maturity Audit\nInterested in implementing these patterns in your product? I offer an intensive workshop for engineering and design teams where we build a basic \"UI Engine\" from scratch, connecting Design Tokens with OpenAI APIs.\n\n[<i class=\"ph ph-arrow-right\"></i> Book In-House Workshop](mailto:me@joanarbo.com?subject=Generative%20UI%20Workshop)",
      "tags": [
        "Generative AI",
        "LLM",
        "UX"
      ]
    },
    {
      "id": "semantic-tokens",
      "title": "Computational Semantics",
      "date": "2026-01-10",
      "status": "active",
      "readTime": "13 min read",
      "description": "Prototype: semantic token mapping using vector search to migrate legacy palettes without manual mapping.",
      "content": "In traditional software engineering, semantics are rigid. `const primaryColor = '#0000FF'` is an absolute declaration. In systems design, we've tried to mimic this with semantic \"Design Tokens\" (`color-action-primary`), but we still depend on a human maintaining that mental map.\n\nWhat happens when the machine understands the concept of \"Action\" better than the human?\n\n> **Visual Concept**\n> Visualization of a vector space (embedding space). Floating connected points. 'Button' is close to 'Touch Target' and 'Call to Action', but far from 'Background'. Style: Technical Cyberpunk.\n\n#\n\n#\n\n# The Vector Design Model\n\nLLMs (Large Language Models) don't see text, they see vectors. Numbers in a multidimensional space. This means we can encode our Design Tokens as vectors.\n\nInstead of searching by name (`$color-blue-500`), we can search by meaning. If I ask the system: *\"Give me a color that denotes danger but is legible on a dark background\"*, the system can calculate the vector distance and return the optimal token, even if we never labeled it as \"danger\".\n\n#\n\n#\n\n# Use Case: Legacy Systems Migration\n\nRecently I helped a Fintech migrate a 15-year-old monolith to a new Design System. They had 50 shades of gray hardcoded (hex codes).\n\nInstead of manually mapping, we created a **Semantic Search** script:\n1.  We ingested all legacy hex codes.\n2.  We ingested the new Design System tokens.\n3.  We calculated visual similarity (Delta-E) and semantic similarity (DOM usage).\n\nThe script proposed an automatic migration with 98% accuracy. What would have taken a team of 4 designers 3 months, took 2 afternoons of script execution.\n\n#\n\n#\n\n# Towards Fluid Syntax\n\nThis opens the door to fluid design systems. Imagine writing CSS like this:\n\n```css\n.card {\n  background: @semantic(\"surface suitable for elevated content in dark mode\");\n  border-radius: @semantic(\"smooth corner consistent with brand playfulness\");\n}\n```\n\nThe compiler (AI) resolves those values to the most appropriate token at build time. If the branding changes, the semantics remain, but the token resolution updates automatically.\n\n#\n\n#\n\n# Conclusion\n\nComputational semantics allow us to scale consistency without scaling bureaucracy. We stop being librarians of variables to become curators of meaning.\n\n---\n\n#\n\n#\n\n#\n\n# Design Tokens Audit\nIs your token system unmanageable chaos? I conduct a **Semantic and Vector Audit** of your current taxonomy to identify redundancies, inconsistencies, and automation opportunities.\n\n[<i class=\"ph ph-arrow-right\"></i> Request Token Audit](mailto:me@joanarbo.com?subject=Design%20Tokens%20Audit)",
      "tags": [
        "Systems",
        "Logic",
        "NLP"
      ]
    },
    {
      "id": "design-agents",
      "title": "Autonomous Design Agents",
      "date": "2026-01-08",
      "status": "active",
      "readTime": "14 min read",
      "description": "Prototype: a Figma janitor agent that renames layers, enforces tokens, and auto-docs component props.",
      "content": "The work of a modern Product Designer is 20% creativity and 80% file management. Renaming layers in Figma, checking WCAG contrasts, updating Jira statuses, documenting component props... It's digital \"janitor work\".\n\nIf we apply Autonomous Agent theory, we can outsource almost all this cognitive load.\n\n> **Visual Concept**\n> A friendly 'Bot' (abstract Pixar style) cleaning a messy interface. Organizing layers, aligning pixels. Metaphor of 'Roomba for Figma'.\n\n#\n\n#\n\n# Anatomy of a Design Agent\n\nA design agent requires three things:\n1.  **Perception**: Ability to read the file (Figma API).\n2.  **Brain**: Ability to reason about what is read (GPT-4 / Claude 3).\n3.  **Action**: Ability to modify the file (Write Access).\n\n#\n\n#\n\n# Experiment: The \"Linter\" that fixes itself\n\nI built a private Figma plugin called \"Janitor\".\n*   **Trigger**: Every time a designer closes a page.\n*   **Action**: Janitor scans the layer hierarchy.\n*   **Reasoning**: If it finds a \"Frame 1232\" containing a button and an input, it deduces it's a form.\n*   **Execution**: Renames the frame to \"LoginForm_Component\", applies Auto-Layout, and verifies colors use local variables.\n\nThe result isn't perfect, but it's better than chaos. It removes the friction of \"cleaning the house\" before inviting developers.\n\n#\n\n#\n\n# Design Ops 2.0: From Police to Gardener\n\nTraditionally, Design Ops acted as police: \"You didn't use the right component!\". With agents, Design Ops becomes automatic gardening. The system prunes and waters itself.\n\nThis changes the economics of the design team. You no longer need a \"Junior\" to organize files. You need Seniors who know how to configure agent rules.\n\n#\n\n#\n\n# Risks and Ethics\n\nExcessive automation can lead to atrophy of basic skills. If you never organize your layers, do you forget how to mentally structure a design? It's possible. But I prefer to reserve my mental energy for solving user problems, not software problems.\n\n---\n\n#\n\n#\n\n#\n\n# Design Ops Automation\nDoes your team lose hours on repetitive tasks in Figma/Jira? I help implement **automation pipelines and custom agents** for your design workflow.\n\n[<i class=\"ph ph-arrow-right\"></i> Automate my Design Ops](mailto:me@joanarbo.com?subject=DesignOps%20Automation)",
      "tags": [
        "Agents",
        "Ops",
        "Automation"
      ]
    }
  ],
  "talks": [
    {
      "id": "masterclass-stories",
      "title": "The design world is made of stories",
      "event": "Mr Marcel School",
      "date": "Masterclass",
      "image": "https://placehold.co/600x400/1e1e1e/FFF?text=Masterclass+Stories",
      "videoUrl": "https://youtu.be/eGj9ZZ3Lj2k",
      "description": "A reinterpretation of Atomic Design: the world is made of stories that users move through.",
      "tags": [
        "Atomic Design",
        "Storytelling"
      ]
    },
    {
      "id": "haikus-tokens",
      "title": "Haikus and tokens",
      "event": "Mr Marcel School",
      "date": "Masterclass",
      "image": "https://placehold.co/600x400/1e1e1e/FFF?text=Haikus+Tokens",
      "videoUrl": "https://youtu.be/6NuKWcpw4Ws",
      "description": "Combining the brevity of Haiku with the precision of design tokens to build semantic visual languages.",
      "tags": [
        "Design Tokens",
        "Semántica"
      ]
    }
  ],
  "projects": [
    {
      "id": "alexa-shopping-ds",
      "title": "Conversational Design System",
      "role": "Design Technologist Manager",
      "company": "Alexa Shopping (Amazon)",
      "impact": "Q3 2022 launch",
      "description": "Led the creation of the first conversational design system for Echo and FireTV. Cut component creation time by 80% through automation and strategic design tokens.",
      "tags": [
        "Voice UI",
        "APL",
        "AI Strategy"
      ],
      "image": "assets/images/projects/alexa-shopping-ds.png",
      "architecture": "graph TD\n    A[Voice Intent] --> B[Conversational Model]\n    B --> C[Design System Tokens]\n    C --> D[Multi-modal Response]\n    D --> E[Echo Devices]"
    },
    {
      "id": "amazon-telescope",
      "title": "Amazon Telescope",
      "role": "Sr Design Technologist",
      "company": "Amazon Business",
      "impact": "-50% Prototyping time",
      "description": "Built a lean, code-first prototyping tool that removed the dependency on Figma for high‑fidelity validation. Final prototypes were indistinguishable from production.",
      "tags": [
        "Prototyping",
        "React",
        "Research Tooling"
      ],
      "image": "assets/images/projects/amazon-telescope.png",
      "architecture": "flowchart LR\n    F[Figma Design] --> T[Telescope UI]\n    T --> C[Live Code Environment]\n    C --> P[Stakeholder Test]"
    },
    {
      "id": "ink-design-system",
      "title": "Ink Design System Strategy",
      "role": "Senior UX Engineer",
      "company": "Amazon Business",
      "impact": "Global scalability",
      "description": "Redesigned the design–engineering integration model for Ink, removing adoption blockers across 50+ engineers and improving frontend quality with Storybook and visual regression testing.",
      "tags": [
        "Design Ops",
        "Adoption",
        "Scale"
      ],
      "image": "assets/images/projects/ink-design-system.png",
      "architecture": "sequenceDiagram\n    UX->>Storybook: Valida Componentes\n    Storybook->>Dev: Implementación Backend\n    Dev->>Production: Lanzamiento Unificado"
    }
  ],
  "experience": [
    {
      "period": "Jun 2017 — Present",
      "company": "Amazon",
      "role": "Senior Design Technologist",
      "description": "Lead UX Engineer across Madrid and Hyderabad. Delivered Amazon Business Prime ahead of schedule and built rapid prototyping frameworks that reduced iteration cycles."
    },
    {
      "period": "Jan 2021 — Present",
      "company": "Mr Marcel School / UOC",
      "role": "Design Systems Educator",
      "description": "Director and mentor for the Design Systems nanodegree. Trained 200+ product engineers in tokens, governance, and scalable UI systems."
    },
    {
      "period": "Jun 2010 — Jun 2017",
      "company": "Movistar+ TV",
      "role": "R&D Engineer",
      "description": "Designed complex systems for STB, web, and apps. Led interaction design for 300+ global campaigns and built experimental 2D/3D prototypes."
    },
    {
      "period": "2000 — 2010",
      "company": "Early Career",
      "role": "Multimedia Engineer",
      "description": "Built interactive media systems and video platforms across multiple studios and startups."
    }
  ],
  "principles": [
    {
      "title": "01 — Design systems die without measurable ROI",
      "content": "Adoption metrics and savings are part of the product, not an afterthought."
    },
    {
      "title": "02 — Documentation is the product",
      "content": "If teams can’t self-serve, the system does not scale."
    },
    {
      "title": "03 — AI amplifies, it doesn’t replace",
      "content": "Use AI to accelerate decisions, then validate with human review."
    }
  ],
  "now": {
    "lastUpdated": "2026-01-15",
    "location": "Madrid, Spain",
    "status": "Building & Teaching",
    "items": [
      {
        "title": "Crafting this Digital Garden",
        "description": "Moving away from static portfolios. Treating this site as a living system where design engineering and AI meet. It's built with vanilla JS and raw data, no frameworks, just craft."
      },
      {
        "title": "Stealth Mode: Redefining Events",
        "description": "Building an independent platform to transform how we experience live gatherings. Crafting bridge between craft, community, and the stage."
      },
      {
        "title": "Exploring Agentic Design Ops",
        "description": "Building private tools to automate the borrowing parts of design management (renaming, linting, handoff) using LLMs."
      }
    ],
    "reading": {
      "title": "The Timeless Way of Building",
      "author": "Christopher Alexander"
    }
  },
  "links": {
    "substack": "https://joanarbo.notion.site/?pvs=74",
    "linkedin": "https://www.linkedin.com/in/joanarbo/",
    "email": "me@joanarbo.com"
  },
  "testimonials": [],
  "playground": [
    {
      "id": "ds-audit-bot",
      "title": "Design System Audit Bot",
      "description": "Automated repo scan that flags component forks, token drift, and adoption gaps.",
      "type": "AI Workflow",
      "url": "",
      "image": "assets/images/playground/grid.png"
    },
    {
      "id": "adoption-dashboard",
      "title": "Adoption & ROI Dashboard",
      "description": "Live metrics for coverage, team adoption, and time-to-component.",
      "type": "Analytics",
      "url": "",
      "image": "assets/images/playground/typo.png"
    },
    {
      "id": "ai-briefing",
      "title": "AI Discovery Briefing",
      "description": "Discovery assistant that maps edge cases and risk zones before build.",
      "type": "Research",
      "url": "",
      "image": "assets/images/playground/ui.png"
    }
  ],
  "services": [
    {
      "id": "ds-mentorship",
      "icon": "ph-student",
      "title": "Design Systems Mentorship",
      "description": "Sesiones 1:1 para líderes de Diseño e Ingeniería. Desbloquea problemas de gobernanza, arquitectura o carrera.",
      "price": "€250 / sesión",
      "features": [
        "Revisión de arquitectura",
        "Estrategia de adopción",
        "Resolución de bloqueos políticos",
        "Career path para Design Technologists"
      ],
      "cta": "Reservar sesión"
    },
    {
      "id": "build-with-me",
      "icon": "ph-code",
      "title": "Build With Me (Day)",
      "description": "Un día entero construyendo juntos. Tú y yo, en vivo. Prototipamos, codeamos y resolvemos un problema real de tu sistema.",
      "price": "€1,200 / día",
      "features": [
        "8 horas de foco intenso",
        "Pair programming real",
        "Auditoría en tiempo real",
        "Entrega de código funcional"
      ],
      "cta": "Agendar día"
    },
    {
      "id": "ds-audit",
      "icon": "ph-check-circle",
      "title": "Design System Audit",
      "description": "Auditoría técnica y de procesos. En 2 semanas te digo exactamente por qué tu sistema no escala y cómo arreglarlo.",
      "price": "Desde €3,500",
      "features": [
        "Análisis de deuda técnica",
        "Revisión de consistencia visual",
        "Entrevistas con equipos",
        "Roadmap de refactorización"
      ],
      "cta": "Solicitar audit"
    }
  ],
  "stack": {
    "software": [
      {
        "name": "Cursor + Antigravity",
        "desc": "AI-first code editor. My daily driver."
      },
      {
        "name": "Warp",
        "desc": "Gemini y perplexity para exploracion y notebook llm"
      },
      {
        "name": "Figma",
        "desc": "Where design systems begin."
      },
      {
        "name": "Notion",
        "desc": "Second brain and OS."
      }
    ],
    "analog": [
      {
        "name": "Leuchtturm1917",
        "desc": "Dotted A5. Daily bullet journaling."
      },
      {
        "name": "Rotring 600",
        "desc": "Drafting pencil. German engineering."
      },
      {
        "name": "Field Notes",
        "desc": "For quick capture on the go."
      }
    ]
  },
  "caseStudies": [
    {
      "id": "bodados",
      "title": "BODADOS Wedding Coordination Platform",
      "status": "ACTIVE - Building now",
      "company": "BODADOS",
      "year": "2024-Present",
      "role": "Technical Co-Founder",
      "timeline": "Ongoing",
      "myRole": "0→1 product, architecture, and delivery",
      "team": "Founding team",
      "challenge": "A fragmented wedding industry with no shared digital workflow for vendors or couples.",
      "solution": "Built a freemium coordination platform for multi-vendor planning, timelines, and payments.",
      "businessImpact": "Private beta live with early market validation.",
      "architecture": "React Native client, Supabase backend, Vercel web surface.",
      "impact": {
        "adoption": "Beta",
        "adoptionLabel": "Private Beta",
        "efficiency": "0→1",
        "efficiencyLabel": "Product Launch",
        "consistency": "MVP",
        "consistencyLabel": "Market Validation"
      },
      "technologies": [
        "React Native",
        "Supabase",
        "Vercel"
      ],
      "image": "assets/images/case-studies/alexa-ds.png",
      "link": "#bodados"
    },
    {
      "id": "alexa-shopping-ds",
      "title": "Alexa Shopping Design System",
      "status": "COMPLETED - 2020-2022",
      "company": "Amazon",
      "year": "2020-2022",
      "role": "Lead Product Engineer",
      "timeline": "6 months",
      "myRole": "Lead engineer (IC + system lead)",
      "team": "Team of 4 engineers",
      "challenge": "15 teams across 3 continents shipped inconsistent shopping UIs, driving 60% rework and brand approvals blocking releases.",
      "solution": "Built a multimodal design system with 50+ components spanning voice, visual, and touch; established contribution workflow and adoption analytics.",
      "businessImpact": "Unlocked €2M in delayed features and reached 100% adoption in 9 months.",
      "architecture": "Monorepo with shared tokens, multimodal component runtime, and cross-device state orchestration.",
      "impact": {
        "adoption": "100%",
        "adoptionLabel": "Adoption",
        "efficiency": "60%",
        "efficiencyLabel": "Dev Time Reduction",
        "consistency": "95%",
        "consistencyLabel": "UI Consistency"
      },
      "technologies": [
        "React",
        "TypeScript",
        "Design Tokens",
        "Storybook",
        "Voice UI",
        "Monorepo"
      ],
      "image": "assets/images/case-studies/alexa-ds.png",
      "link": "#alexa-shopping-ds"
    },
    {
      "id": "amazon-telescope",
      "title": "Amazon Telescope Analytics Platform",
      "status": "INTERNAL TOOLS",
      "company": "Amazon",
      "year": "2021-2022",
      "role": "Senior Product Engineer",
      "timeline": "4 months",
      "myRole": "IC lead for tooling and data pipelines",
      "team": "2 engineers + 1 data analyst",
      "challenge": "Leaders had no visibility into design system adoption or where teams were forking components, making ROI impossible to quantify.",
      "solution": "Built an automated analytics platform to scan repos, detect usage patterns, and surface adoption/consistency metrics in real time.",
      "businessImpact": "Saved €200K/year in engineering hours and cut detection time for UI regressions by 80%.",
      "architecture": "Repo scanning jobs + metrics warehouse + dashboards for product and design ops.",
      "impact": {
        "adoption": "40+",
        "adoptionLabel": "Teams Tracked",
        "efficiency": "80%",
        "efficiencyLabel": "Faster Issue Detection",
        "consistency": "€200K",
        "consistencyLabel": "Annual Savings"
      },
      "technologies": [
        "Python",
        "AWS",
        "Data Visualization",
        "Analytics"
      ],
      "image": "assets/images/case-studies/telescope.png",
      "link": "#amazon-telescope"
    },
    {
      "id": "ink-design-system",
      "title": "Ink Design System",
      "status": "CONSULTING",
      "company": "Confidential media platform",
      "year": "2023-2024",
      "role": "Staff Product Engineer",
      "timeline": "9 months",
      "myRole": "Staff engineer leading system architecture and adoption",
      "team": "3 engineers + 2 designers",
      "challenge": "Fast growth demanded a scalable system that preserved editorial quality across millions of readers and creators.",
      "solution": "Architected a premium design system focused on typography, reading experience, and creator tooling with clear adoption playbooks.",
      "businessImpact": "Improved feature delivery speed by 45% while maintaining 98% brand consistency.",
      "architecture": "Shared UI foundation with editorial primitives, tokenized typography scale, and publishing workflows.",
      "impact": {
        "adoption": "2M+",
        "adoptionLabel": "Creators Impacted",
        "efficiency": "45%",
        "efficiencyLabel": "Faster Feature Delivery",
        "consistency": "98%",
        "consistencyLabel": "Brand Consistency"
      },
      "technologies": [
        "React",
        "TypeScript",
        "CSS-in-JS",
        "Editorial Design"
      ],
      "image": "assets/images/case-studies/ink-ds.png",
      "link": "#ink-design-system"
    }
  ]
}