{
  "posts": [
    {
      "id": "perihelion",
      "title": "Perihelion: Finding Flow State in an Age of AI Interruption",
      "date": "2025-10-28",
      "readTime": "Deep Dive",
      "description": "How to find flow state and deep work in an age of AI interruption. A reflection on creative mastery, design systems, and the craft of subtraction.",
      "content": "<iframe width=\"100%\" height=\"400\" src=\"https://www.youtube.com/embed/7tTCZOHUWFA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\nIn astronomy, perihelion is the point at which a celestial body comes closest to the Sun. It's the moment of maximum velocity. Maximum intensity. Afterward, it drifts away. But that instant - that single instant - contains all the accumulated energy of the journey.\n\nJiro Ono, the legendary sushi master, spends 70 years searching for his perihelion.\n\nHe doesn't call it that. He calls it perfection. Purity. But it's the same thing: that point where everything converges. Where detail, repetition, and the silence of decades of craftsmanship condense into a single gesture.\n\nA grain of rice. A knife movement. Nothing more.\n\nEverything.\n\n#\n\n#\n\n# I. Orbit: Understanding the Creative Process\n*[0:00 - 1:30: The introduction. Soft strings, almost inaudible.]*\n\nWhen you design, code, create - you're in orbit.\n\nSome days far from the center. Scattered. Jumping between tasks, tools, notifications. Distance protects you. It doesn't burn. But you don't move forward either.\n\nOther days, closer. Hours disappear. You forget to eat. Code flows. Design breathes. You don't think about what you're doing; you simply do it.\n\nIt's flow state. That state where the brain releases conscious control and lets specialized neural networks - trained over years - work alone. Without supervision. Without friction.\n\nBut there's an even deeper point.\n\nPerihelion.\n\n#\n\n#\n\n# II. Approach: The Path to Mastery\n*[1:30 - 3:00: Piano enters. Strings begin to tense.]*\n\nCharles Eames said: \"The details are not just details. They make the design.\"\n\nHe wasn't talking about ornament. He was talking about essence.\n\nThat place where if you remove something, everything collapses. If you add something, everything becomes contaminated.\n\nIt's the closest point to truth.\n\nAnd to get there, you can't rush. You have to orbit. Again and again. Observe. Iterate. Repeat the same movement 10,000 times until the pattern emerges.\n\nJiro didn't invent sushi. He eliminated everything that wasn't sushi.\n\nThat's the difference.\n\nWe add: variants, use cases, exceptions, flexibility.\n\nWe call it \"coverage.\"\n\nBut mastery is the opposite. It's subtraction. It's saying: this, and only this, is necessary.\n\nAnd when you finally arrive - when you touch that point - everything else reveals itself as obvious.\n\n#\n\n#\n\n# III. The Problem: AI and the Fragmentation of Deep Work\n*[3:00 - 4:30: Tension grows. Violin, viola. Layers accumulating.]*\n\nBut now something has changed.\n\nAI is here. Cursor, Figma, generative models whispering at every pause.\n\nAnd for the first time in years, it's difficult to reach perihelion.\n\nBecause perihelion requires sustained velocity in one direction. Continuous hours. Total immersion. That deceleration of the external world that allows internal acceleration.\n\nBut AI interrupts.\n\nNot violently. With suggestions. With shortcuts. With the seductive promise that you can get there faster.\n\nAnd technically, it's true. You can generate more. More components. More code. More variations.\n\nBut more isn't perihelion.\n\nPerihelion is the point of maximum closeness, not maximum production.\n\nIt's being so close to the essence that there's no distance between you and what you create.\n\nAnd that can't be accelerated.\n\n#\n\n#\n\n# IV. Broken Orbits: Losing Flow in the Age of AI\n*[4:30 - 5:45: The climax begins to build. Everything converges.]*\n\nI've noticed something.\n\nMy best work - the work that truly IS something - was born in long sessions. Uninterrupted. No AI. No Slack. No browser.\n\nJust me, the problem, and hours evaporating.\n\nThat state where the prefrontal cortex shuts down and creative networks work alone. Where you don't supervise your own thinking; it simply flows.\n\nTransient hypofrontality, neuroscientists call it. The brain releasing control to allow what it already knows but can't verbalize to emerge.\n\nAI doesn't enter there.\n\nNot because it's incapable. Because it's a dialogue. And dialogue keeps you in the prefrontal cortex—supervising, evaluating, adjusting.\n\nNever letting go.\n\nNever reaching perihelion.\n\n#\n\n#\n\n# V. The Decision: Protecting Deep Work and Flow State\n*[5:45 - 7:00: The crescendo. Strings at their peak.]*\n\nAI isn't the enemy.\n\nIt's a tool for the outer orbit. For the superficial. For what scales.\n\nBut perihelion - that point of maximum closeness to what's true - remains human.\n\nIt remains slow.\n\nIt remains boring, sometimes.\n\nAnd it requires something radical in a world of speed: protecting the long hours. The sessions where you disappear. Where a detail consumes your entire day and at the end - only at the end - you see that detail was everything.\n\nTurn off notifications.\n\nClose Cursor.\n\nLet the code, the design, the problem look back at you for hours.\n\nUntil you reach the point where there's no distance.\n\nWhere you are the work.\n\nWhere you touch perihelion.\n\n#\n\n#\n\n# VI. The Journey: Embracing the Orbit\n*[7:00 - 7:48: The resolution. Everything settles. Silence that breathes.]*\n\nJiro, after 70 years, says: \"No one knows where the top is.\"\n\nHe hasn't arrived.\n\nPerhaps he never will.\n\nBut each day he gets closer. Each movement. Each repetition. Each minimal refinement that no one else notices.\n\nThat's the orbit.\n\nAnd perihelion isn't a destination. It's an instant. Fleeting. Intense. True.\n\nAnd then you drift away again.\n\nBut you know it existed. That you touched it.\n\nAnd that changes everything.\n\nThe essence is there. Underneath. Always.\n\nYou just have to get close enough to feel it.\n\nBut first, you have to let go of control.\n\nDisconnect.\n\nAnd let the orbit carry you.\n\nWhen was the last time you reached your perihelion? Share your experience in the comments below.\n\nIf this resonated, subscribe for more reflections on design systems, creative flow, and staying human in an AI-driven world.\n\n#FlowState #DeepWork #CreativeProcess #Mastery #AIandCreativity",
      "tags": [
        "Flow",
        "Deep Work",
        "Philosophy"
      ],
      "series": "AI & Future of Work",
      "image": "assets/images/posts/perihelion.jpg"
    },
    {
      "id": "roi-design-system",
      "title": "Por qué tu Design System Manager no ve el ROI",
      "date": "2025-10-15",
      "readTime": "Management",
      "description": "Si tu rol es de responsable de producto o tech lead, este post tiene métricas, errores concretos y técnicas para elevar el valor real en tu organización.",
      "content": "**Si 40 equipos personalizan el mismo botón, tu Design System tiene un problema (y cómo detectarlo)**\n\nLos equipos de Design Systems en contextos complejos cargan con un problema silencioso:\n\nNadie sabe con certeza cuánto de lo que construyen realmente impacta en producción.\n\nTienes documentación. Tienes componentes. Tienes governance.\n\nPero no tienes visibilidad.\n\nUn día revisas 3 productos diferentes y encuentras que el mismo componente se implementó de 4 formas distintas en cada uno.\n\nY pasa en silencio. Sin que nadie lo vea como un problema.\n\nEso es la realidad de escalar un sistema en contextos con múltiples equipos autónomos.\n\n**No es caos. Es invisibilidad.**\n\n#\n\n#\n\n# **🧩 El dilema de las métricas**\nEn contextos financieros complejos la situación es más complicada que en otros sectores.\n\nNo es solo que tengas múltiples productos: tienes regulaciones, auditorías, cumplimiento normativo, y presión constante por eficiencia.\n\nUn cambio en tu sistema de diseño no es \"fast and furious\"; es coordinado, medido, rastreado.\n\nEntonces, ¿cómo mides si tu sistema funciona?\n\nAquí viene lo importante:\n\n#\n\n#\n\n# **🎯 La trampa de contar componentes**\nHe visto a líderes decir: \"*Usamos 450 instancias de nuestro botón el mes pasado.*\"\n\nSuena impresionante.\n\nSignifica nada.\n\n¿Por qué?\n\nUn botón dentro de un header que aparece en 30 páginas: ¿cuenta como 1 o 30?\n\nUn componente copiado y pegado en 15 lugares ¿cuenta hacia tu sistema o cuenta como 15 fracasos?\n\nMás importante: si construyes 200 componentes pero solo 15 se usan en serio...\n\n**¿Realmente tienes un sistema o tienes una biblioteca gigante que nadie mantiene?**\n\n> Lo brutal es que la mayoría de equipos pasa meses midiendo números que no dicen nada.\n\nNecesitas cambiar el enfoque.\n\n**De \"frecuencia absoluta\" a \"amplitud de uso\".**\n\nNo \"cuántas instancias de un componente\".\n\nSino **\"cuántos equipos diferentes usan este componente.\"**\n\n#\n\n#\n\n# **📊 El mínimo viable para empezar (y no complicarse)**\nPrimer sprint (Semana 1-2):\n\nOlvida 50 gráficos. Necesitas 4 métricas. Punto.\n\n1️⃣ **Cobertura visual**: ¿Qué % de tu interfaz usa componentes DS?\n\n2️⃣ **Adopción por equipo**: ¿Cuántos equipos usan el sistema?\n\n3️⃣ **Consistency score**: ¿Cuántas desviaciones hay por producto?\n\n4️⃣ **Time to component**: ¿Cuánto tardan los equipos en implementar un componente nuevo?\n\n**Eso. Es. Todo.**\n\n#\n\n#\n\n#\n\n# **Cómo crear tu baseline en menos de dos horas:**\n\n* **Selecciona 3 productos reales de tu compañía.**\n\n* **Cuenta manualmente (sí, old school):**\n\n* Ejemplo: \"*En el flow de onboarding, 7 de 10 pantallas usan componentes propios del DS.*\"\n\n* Ese es tu baseline: **70% de cobertura en onboarding.**\n\n* Define un objetivo realista a 90 días, por ejemplo: **subirlo al 85%.**\n\n* **Calcula tu \"consistency score\":**\n\n* Escoge 20 pantallas representativas (elige 3-4 flujos clave: onboarding, transferencias, pagos...).\n\n* Revisa visualmente y toma nota de incoherencias:\n\n* \"Este botón tiene padding de 12px aquí, 16px allá.\"\n\n* \"Este input lleva borde, en el siguiente no.\"\n\n* Si tu DS cubre solo un 65% en alta de usuario, el 35% restante es deuda visual y funcional que crecerá con cada release.\n\n* **Registra cada desviación (ese es tu score inicial).**\n\n**Truco para escalar sin volverte loco:**\n\n* Puedes acelerar este proceso automatizando parte del análisis:\n\n* Sube las capturas de esas 20 pantallas a una carpeta.\n\n* Lanza un script sencillo (por ejemplo, en Cursor) o usa una herramienta que detecte inconsistencias visuales o a nivel de código.\n\n* Al final obtendrás algo así:\n\n* \"En estas 20 pantallas encontré X desviaciones. Las más críticas son: Button padding (8 veces), Input border (6), Spacing en cards (4).\"\n\n#\n\n#\n\n# **🔥 La métrica que nadie mide pero debería**\nAquí viene lo que te hace brillar:\n\nCada vez que un equipo detacha o customiza un componente existente (en lugar de usarlo directo), lo registran.\n\nSimple: un comment en el Figma o un ticket.\n\n\"Usamos Button pero con border-radius customizado porque nuestro caso de uso es diferente.\"\n\nAhora multiplica.\n\n**Si 40 equipos detachan el Button de 5 maneras diferentes = mismo problema resuelto 40 veces.**\n\nTraducción: **desperdicio masivo.**\n\nHoras perdidas. Inconsistencia en producción. Deuda técnica acumulada.\n\nPero aquí está lo fascinante.\n\nCada detach que registres es un insight puro.\n\n**No es fallo de adoption.**\n\n**Es fallo de diseño.**\n\nPorque ahora sabes exactamente dónde iterar.\n\n#\n\n#\n\n# **💡 El script que lo cambia todo**\nAquí tienes el copy final para explicar el escaneo por código (sin Figma) y con tu tono claro y técnico:\n\n**¿Cómo saber cuántos equipos realmente usan tu componente estándar y cuántos hacen la suya por libre?**\n\nUn script sencillo te lo da en minutos.<br>No toca Figma ni docs—solo código real.\n\n**Escanea automáticamente toda la base de código:**<br>Busca importaciones del tipo:\n\n```\n<code>import { Button } from 'design-system';</code>\n```\nCuenta cada import y lo agrupa por carpeta, equipo, o contexto (puedes mapear esto a tu monorepo o naming de proyectos).\n\n**Detecta \"copias\" y personalizaciones:**<br>Localiza componentes que se llaman igual pero se redefinen localmente, o que extienden el original con estilos, props o code duplicado.<br>Ejemplo:\n\n```\nimport { Button } from 'design-system';\n\n// Creo una variante para casos especiales\nconst DangerButton = (props) => (\n  <Button {...props} color=\"red\" />\n);\n```\nCada caso suma como \"instancia customizada\".\n\n**Te saca un informe real:**\n\n```\nEquipo Onboarding: 11 imports estándar, 2 custom \nEquipo Cuentas: 17 imports estándar, 7 custom \nEquipo Pagos: 13 imports estándar, 1 custom\n```\nAsí ves, sin interpretación, qué equipos adoptan 100% el patrón y cuáles lo \"rompen\".\n\n**Puedes extraer extra info:**<br>El script te lista también las props usadas, variantes más frecuentes, o props sospechosas de ser hack:\n\n```\n<Button size=\"large\" color=\"error\" style={{borderRadius: 20}} />\n```\n**¿Qué ganas?**\n\n* Datos accionables para saber qué componentes funcionan y cuáles invitan a custom.\n\n* Argumentos sólidos para priorizar refactors (\"este equipo lo rompe siempre, hablemos con ellos\").\n\n* Una visión de verdad sobre la salud y adopción de tu Design System—la métrica que de verdad importa.\n\n**Zero human effort después del setup (2 horas máximo).**\n\n#\n\n#\n\n# **🧠 Predicción de adoption antes de que falle**\nAquí es donde brilla el machine learning simple (y no lo digo como AI hype).\n\nEl patrón es claro:\n\nSi ves que componentes similares fueron detachados 3+ veces en los últimos 90 días...\n\nEl componente nuevo que vas a lanzar **probablemente TAMBIÉN será detachado.**\n\n¿Por qué?\n\nPorque hay un patrón no resuelto en ese dominio de componentes.\n\nEntonces, antes de lanzar ese componente nuevo, puedes:\n\n* Detectar automáticamente el patrón de detach histórico\n\n* Correlacionarlo con el nuevo componente\n\n* **Generar alertas**: \"Este Button tiene 8 deviaciones en el histórico. Tu nuevo componente tiene similitudes. Revisa estos 3 casos de uso antes de lanzar.\"\n\n> Básicamente, **predices si algo va a fallar antes de que falle.**\n\nEl diseñador no se frustra. El componente sale mejor.\n\nAdoption sube automáticamente porque resolviste el problema real.\n\n#\n\n#\n\n# **📈 Cómo crece esto sin romperse**\n**Mes 1:** 50% de cobertura en 2 productos piloto. Baseline feo pero honesto.\n\n**Mes 2:** Líderes ven el problema. Asignan recursos para mejorar componentes rechazados.\n\n**Mes 3:** Cobertura sube a 68%. Equipos empiezan a pedir nuevos componentes (buen signo).\n\n**Mes 4-6:** Escala a otros productos. Cada producto nuevo que entra, ya empieza a 65% de cobertura porque entienden el patrón.\n\n**Mes 12:** **80% de cobertura global. Sistema mantenido por 2 personas. Ahorro anual estimado: €200k-400k en horas de diseño/dev.**\n\n#\n\n#\n\n#\n\n# **❌ Lo que NO hagas**\nNo compares con otras empresas.\n\n**Cada banca es diferente. Cada contexto es diferente. Cada design system es diferente.**\n\nAquí es donde la mayoría falla:\n\n* Figma dice que la mejor práctica es tener 80% de componentes reutilizables.\n\n* Otra banca tiene 6 diseñadores y 50 componentes.\n\n* Design Systems Collective dice que debería tener X métrica.\n\n* Olvidar preguntar a los equipos por qué detachan componentes.\n\n* Medir solo la frecuencia en vez de entender el patrón.\n\n* Comparar tu sistema con bancos que tienen realidades regulatorias y de negocio distintas.\n\nOlvida todo.\n\n**Tu Design System es sumiso al proyecto, no al revés.**\n\nLas normas de Figma no son las tuyas.\n\nLas mejores prácticas de otra banca no son las tuyas.\n\n**¿Por qué?**\n\n* Porque tu contexto tiene regulaciones específicas.\n\n* Tiene equipos con dinámicas que no son las de otra banca.\n\n* Tiene historias de código y decisiones que otra empresa jamás enfrentó.\n\n> **Invierte en conocer tu contexto.<br>*****Un simple log de cuándo y por qué se detacha un botón puede ahorrar miles de euros/mes en soporte y QA.***\n\nDespués, diseña tus métricas desde ahí. No desde lo que otros hacen.\n\n**<br>Mitos frecuentes en métricas DS bancarias:**\n\n* \"Más componentes = más madurez\". Falso. (He visto bancos con +200 componentes que no logran ni 60% de coherencia visual.)\n\n* \"Estándar solo importa en UX\". Falso: en banca, el auditor legal usa tus pantallas como evidencia.\n\n* \"Comparar con benchmarks de otras empresas\". Falso, tu contexto manda.\n\n#\n\n#\n\n# **🚀 Tu primer movimiento (próximos 7 días)**\n\n* Toma 1 producto. Mira 3 flows completos.\n\n* Cuenta: cuántos componentes son DS, cuántos son custom.\n\n* Ese % es tu baseline.\n\n* Fija objetivo a 90 días: +15%.\n\n* Reúnete con 2 equipos. Pregunta: \"¿Qué componente necesitarías que no existe? ¿Qué componente nuestro es un problema?\"\n\n**Eso es suficiente para mover la aguja.**\n\n**Key Takeaways / Acciones para responsables:**\n\n* *Mide equipos, no solo instancias.*\n\n* *Registra cada custom, es una señal estratégica.*\n\n* *Pregunta a equipos por qué adaptan.*\n\n* *Ajusta el score regularmente: los productos bancarios evolucionan cada trimestre.*\n\n> ***Si quieres que tu equipo o tu manager vea el impacto, imprime este checklist y úsalo el próximo trimestre.***\n\n**Para profundizar:**\n\n* **Auditorías automáticas en Design Systems:**<br>**[Design System Metrics: From Adoption to Impact (by Zeroheight & DS expert Nathan Curtis)](https://blog.zeroheight.com/design-system-metrics-adoption-impact/)**\n\n* **Cómo analizar la amplitud real de uso con código:**<br>**[Measure Adoption of a Design System with Automated Scripts (Medium, Ryan Clark)](https://uxdesign.cc/measuring-adoption-of-a-design-system-32293ffb351c)**\n\n* **Métricas reales y tooling para Product Managers:**<br>**[Product Metrics: Find the North Star (by Intercom)](https://www.intercom.com/blog/product-metrics-north-star/)**\n\n* **Cómo detectar \"custom forks\" en librerías de componentes:**<br>**[Detecting UI Consistency and Component Forks in Large Codebases (by Engineering @Airbnb)](https://medium.com/airbnb-engineering/design-system-science-cc0dc49dec10)**\n\n* **Guía avanzada de governance para entornos complejos:**<br>**[Governance of Design Systems in Large Organizations (by Sparkbox)](https://seesparkbox.com/foundry/design_systems_governance_perspectives)**\n\n**¿Cuál sería el ahorro en horas (o reducción de deuda técnica) si pudieras visualizar todas las personalizaciones que hoy están ocultas?**\n\n#DesignSystems #Banca #ProductLeadership #Métricas #Eficiencia",
      "tags": [
        "Management",
        "ROI",
        "Strategy"
      ],
      "series": "Design Systems Mastery",
      "image": "assets/images/posts/roi-design-system.png"
    },
    {
      "id": "interface-dependency",
      "title": "Tu producto depende de la interfaz. Los agentes la ignoran.",
      "date": "2025-10-01",
      "readTime": "Future Tech",
      "description": "Mi reto desde Alexa hasta hoy: construir sistemas que funcionan incluso donde no hay pantallas. ¿Qué pasa cuando la UI desaparece?",
      "content": "Déjame contarte una historia en dos partes.\n\nLa primera es compleja, pero marca el antes y el después (y explica por qué **sigo enganchado a este dilema**).\n\nLa segunda es práctica: **cómo puedes aprovecharlo hoy**.\n\n<h2>**PARTE 1: Alexa Shopping y el dilema de las capas**</h2>Cuando trabajaba en Amazon Alexa Shopping, meses antes del hype de ChatGPT, me obsesioné con una pregunta:\n\n**¿Cómo diseñas un sistema de compra que funcione igual de bien en voz, pantallas, wearables y múltiples idiomas sin tener que reconstruir todo cada vez?**\n\n> Pasé 6 meses dándole vueltas a esto. No había referencias, ni gurús ni literatura sobre \"**Design Systems multimodales aplicados a shopping**\".\n\nEn vez de flujos lineales (buscar -> ver producto -> añadir al carrito -> pagar), propuse algo diferente: agrupar momentos en el tiempo.\n\nNo paths únicos. Multi-camino.\n\nPero aquí viene la parte técnica que me tenía obsesionado:\n\n**Cada \"momento\" no era un componente fijo del Design System. Era un grupo de información que se autogeneraba en un componente multimodal al vuelo.**\n\nDéjame explicar esto porque es el núcleo de todo:\n\n#\n\n#\n\n# **El componente multimodal autogenerado**\nEn un Design System tradicional tienes:\n\n* Un botón\n\n* Una card de producto\n\n* Un form de pago\n\nSon componentes **prediseñados y estáticos**.\n\nEn un sistema multimodal, tienes **grupos de información** que se convierten en componentes según el contexto:\n\n**Grupo de información: \"Confirmación de compra de pilas AA\"**\n\nContiene:\n\n* Nombre del producto\n\n* Precio\n\n* Método de pago guardado\n\n* Dirección de envío\n\n* Fecha estimada de entrega\n\n**Y este grupo se autorenderiza como:**\n\n🔲 **En Echo Show (visual + voz):**\n\n-> Card con imagen del producto\n\n-> Botón \"Comprar con 1-Click\"\n\n-> Voz: \"¿Confirmo tu pedido de pilas Duracell por €8.99?\"\n\n🗣️ **En Echo Dot (solo voz + luz):**\n\n-> No hay visual\n\n-> Voz: \"Pilas Duracell AA, €8.99, llegan mañana. Di 'confirmar' o 'cancelar'\"\n\n-> Anillo LED azul pulsante (esperando respuesta) -> verde (confirmado) -> rojo (cancelado)\n\n👆 **En app móvil (visual + touch):**\n\n-> Card expandible con detalles completos\n\n-> Botón grande \"Confirmar compra\"\n\n-> Swipe hacia arriba para ver más opciones\n\n📱 **En smartwatch (notificación mínima):**\n\n-> \"Tu pedido habitual de pilas - €8.99\"\n\n-> Dos botones: ✓ y ✗\n\n-> Vibración al confirmar\n\n🤖 **En agente de IA (solo API):**\n\n-> No hay visual ni voz\n\n-> Consume endpoint: <code>POST /orders/confirm</code>\n\n-> Recibe: <code>{orderId, status, estimatedDelivery}</code>\n\n#\n\n#\n\n# **Y aquí está la magia:**\n**El mismo grupo de información genera 5 componentes distintos automáticamente.**\n\nNo construyes 5 componentes separados.\n\nConstruyes **un sistema que sabe qué renderizar según el device**.\n\nLo mejor es que:\n\n**Cuando el usuario cambia de device a mitad del flujo, el componente se regenera en el nuevo contexto sin perder estado.**\n\n#\n\n#\n\n# Ejemplo real (más allá del cross-device típico):\nSupón que no solo el flujo se retoma entre devices, sino que el componente se reconfigura en tiempo real según el \"grupo de información\" y el canal en el que aparece.\n\n* Usuario está cocinando y pregunta a Alexa en voz: \"¿Queda aceite?\"\n\n* Alexa responde con voz: \"Queda poco. Puedes pedir tu favorito.\"\n\n* Alexa activa el componente \"pedido recurrente\" en modo solo voz, preguntando: \"¿Te lo encargo para hoy?\"\n\n* Usuario responde con un gesto (acercar la mano a Alexa):\n\n* El sistema traduce ese gesto como \"sí, pedir aceite\" porque el patrón de luz y la distancia están configurados para esa acción.\n\n* Sin intervención humana, el sistema agrupa toda la info relevante (producto, dirección, método de pago, historial) en un objeto base que puede interpretarse en cualquier contexto.\n\n* El usuario, ya fuera de casa, abre la app móvil de Amazon:\n\n* El sistema detecta el cambio de canal y **genera al instante un componente touch**, con botón \"Cancelar pedido\", opciones de cambiar la marca, y notificación con el resumen.\n\n* Todo el estado, opciones y contexto del flujo se mantienen, pero **el componente no es el mismo que en Alexa: se adapta automáticamente a las capacidades táctiles y visuales del dispositivo**.\n\nEl sistema entiende que no existe \"un botón de pedir aceite\", sino **la esencia del pedido**, que puede tomar cuerpo como frase de voz, opción en pantalla, vibración en un wearable, o petición a una API de agente de IA.\n\nAsí cada \"momento\" de la experiencia es **multimodal y adaptable**, no solo cross-device.\n\n> **Mismo flujo. Múltiples devices. Un solo sistema.**\n\nY esto era posible porque cada componente multimodal tenía estas capas:\n\n🔲 **Capa visual:** componentes 2D del DS tradicional (cards, botones, forms)\n\n🗣️ **Capa conversacional:** fragmentos de texto para voz\n\n👆 **Capa de input:** reglas de interacción (touch, voz, gestos, sensores de distancia)\n\n🔌 **Capa de datos:** API con el grupo de información\n\n🧭 **Capa de navegación:** reglas de transición (de dónde vienes, a dónde vas)\n\nDependiendo del device, el sistema activaba las capas necesarias **y generaba el componente al vuelo**.\n\nEn 2022, esto sonaba abstracto. \n\nPorque eso no escala cuando tienes 15 tipos de devices Alexa diferentes, más app móvil, más web, más wearables.\n\nEn 2025, con agentes de IA comprando solos...\n\n<h2>**PARTE 2: Por qué esto importa y cómo aprovecharlo ahora**</h2>Lo que cambió esta semana:\n\nLos agentes de IA ya compran solos.<br><br>**Preguntas a un asistente: *****\"Contrata a 10 creadores para mi campaña\"*****.**\n\n**El agente busca, compara, paga los $50 con tu permiso previo, y te entrega resultados.**\n\nSin app. Sin checkout. Sin formularios.\n\n**El agente de IA es solo otro \"device\" más, aunque actúe sin visual ni voz. Solo lógica de negocio.**\n\n#\n\n#\n\n#\n\n# **Los datos que lo avalan**\nEsto no es ciencia ficción. Los números son claros:\n\n📊 **$1.7 trillones** en comercio impulsado por IA proyectados para 2030 (Edgar Dunn & Co.)\n\n📊 **25% de ventas online** serán realizadas por agentes de IA para entonces (PayPal CEO)\n\n📊 **1M+ merchants** en Shopify ya habilitados para vender a través de agentes conversacionales\n\n📊 **58% de instituciones financieras** atribuyen crecimiento de ingresos a IA (McKinsey)\n\n**En Alexa Shopping en 2022, esto era un experimento.**\n\n> **En 2025, con agentes comprando solos, es la próxima ola.**\n\n#\n\n#\n\n# **El caso que lo hace tangible: cuando Stripe entendió el juego**\nStripe lo ejemplifica perfecto:\n\nUna sola API y contexto, infinitos usos.<br>No integraciones manuales sino reglas, tokens y componentes que se adaptan a cada canal.<br>Si necesitas un nuevo componente para cada contexto, te quedas atrás.<br>Si defines bien los grupos de información, el sistema se autogenera y escala solo.\n\n**Cómo empezar a construir para este futuro (sin reescribir todo)**\n\nLa buena noticia: no necesitas tirar tu sistema actual.\n\n<h2>**¿Cómo empezar?**</h2>Puedes empezar aplicando estos principios paso a paso:\n\n#\n\n#\n\n# **1. Deja de pensar en componentes fijos. Empieza a pensar en grupos de información.**\nEn lugar de diseñar \"una card de producto\", pregúntate:\n\n¿Qué información crítica necesito mostrar en este momento?\n\n(Nombre, precio, disponibilidad, método de pago...)\n\nLuego define cómo esa información se renderiza según el contexto:\n\n* **Visual:** card + botón\n\n* **Voz:** frase + confirmación\n\n* **API:** JSON con los mismos datos\n\n* **Wearable:** notificación mínima\n\n#\n\n#\n\n# **2. Separa datos de presentación.**\nTu \"grupo de información\" debe vivir en una capa de datos independiente.\n\nLa capa de presentación decide cómo mostrarlo según el device.\n\n#\n\n#\n\n# **3. Haz que tus componentes sean capaces de continuar en múltiples devices.**\nEl estado del flujo no debería vivir en el componente visual.\n\nDebería vivir en una capa de navegación que persiste entre devices.\n\nEjemplo: usuario empieza en voz, continúa en app, finaliza en web.\n\n**Mismo flujo. Múltiples contextos.**\n\n#\n\n#\n\n# **4. Convierte procesos manuales en reglas de renderizado automáticas.**\nEn lugar de crear manualmente variantes para cada contexto, define reglas:\n\n\"Si device = Alexa Dot -> solo voz\"\n\n\"Si device = Echo Show -> voz + visual\"\n\n\"Si device = agente IA -> solo API\"\n\n#\n\n#\n\n# **5. Haz la trazabilidad automática, no opcional.**\nCada componente autogenerado debe registrar:\n\n* ¿Qué información contenía?\n\n* ¿En qué device se renderizó?\n\n* ¿Qué capas se activaron?\n\n* ¿Cómo respondió el usuario?\n\nTodo auditable. Siempre.\n\n**Por qué esto me tiene tan entusiasmado**\n\nHace 3 años, en Alexa Shopping, empecé a explorar componentes multimodales  para compras. Ni siquiera sabía si alguien entendería el porqué, pero estaba decidido a llevar el Sistema de Diseño a su siguiente nivel.\n\nHoy veo agentes de IA comprando en milisegundos, saltando entre contextos, gestionando permisos...\n\nY pienso: **esto es exactamente lo que intentábamos resolver.**\n\nLa diferencia es que entonces no había demanda masiva.\n\nAhora, con $1.7 trillones proyectados en comercio agéntico para 2030...\n\nYa no es un experimento.\n\nPero por ahora, la pregunta es simple:\n\n**¿Hasta qué punto tus componentes se adaptan o solo se copian a cada canal?**\n\nPorque esa es la diferencia entre escalar y tener que crear una variante nueva cada vez que cambia algo.\n\n💬 **Me encantaría leer tus casos, retos o dudas. ¿Alguna vez lograste que un mismo flujo viviera en mil contextos sin rehacer componentes?**\"\n\nDéjalo en comentarios. Quiero saber qué están explorando otros equipos.\n\n</a>#DesignSystems #ProductLeadership #APIs #IA #AgenticCommerce #Multimodal #AlexaShopping",
      "tags": [
        "AI Agents",
        "Headless",
        "Voice UI"
      ],
      "series": "AI & Future of Work",
      "image": "assets/images/posts/interface-dependency.png"
    },
    {
      "id": "invisible-system",
      "title": "El mejor Design System es el que no se ve",
      "date": "2025-09-20",
      "readTime": "Philosophy",
      "description": "La fontanería solo se convierte en la protagonista cuando falla. Un buen sistema de diseño debe ser transparente para el desarrollador.",
      "content": "He trabajado con sistemas que tenían más de 100 componentes.\n\nLo curioso es que, llegado un punto, nadie del equipo sabía realmente cuál era el correcto para cada contexto.\n\nLas discusiones eternas, los tickets que se traspapelaban, los bloqueos en legal por falta de trazabilidad, y los desarrolladores perdiendo la concentración cada dos por tres...\n\nEl resultado era claro: el sistema no era invisible.\n\n**Era ruidoso. Y caro.**\n\nLa infraestructura bien diseñada desaparece.\n\n**Como la fontanería de una ciudad: solo la notas cuando falla.**\n\n<h2>**❌ El problema que nadie admite:**</h2>La mayoría de Design Systems en banca son catálogos de UI con manual de marca.\n\n**Bonitos ✨<br>Documentados 📚<br>Inútiles 🗑️**\n\nPorque no resuelven el problema real:\n\n* Equipos perdiendo días debatiendo qué botón usar\n\n* Developers perdiendo contexto cada dos tickets\n\n* Legal bloqueando cambios por falta de trazabilidad\n\n* Nadie midiendo la deuda invisible\n\nEse tiempo perdido recuperando el foco tras cada interrupción.\n\nNo lo ves en dashboards.<br>Pero es lo que destruye sprints.\n\n<h2>**✅ Cómo se construye un sistema invisible:**</h2>\n\n#\n\n#\n\n#\n\n# **1️⃣ Núcleo pequeño e innegociable**\n10-15 componentes core.<br>No 146.\n\nEl resto son variantes o composiciones.\n\n**¿Por qué importa?**\n\n* Si tienes 146 componentes, seguro tienes 12 botones, 8 inputs, 6 date pickers...\n\n* Cada equipo usará uno distinto, nadie sabrá cuál actualizar, y la deuda técnica crece a escondidas.\n\n* Cuando quieres cambiar un comportamiento global, acabas tocando 10 archivos y cruzando los dedos para que nada rompa en producción.\n\n#\n\n#\n\n#\n\n# **2️⃣ Variaciones regionales controladas**\n**El problema típico en banca:**\n\nTienes un formulario de pago.\n\nEspaña necesita mostrar un disclaimer legal específico.<br>Alemania necesita un orden diferente de campos por regulación.<br>Francia necesita traducción + formato de número distinto.\n\n> **La trampa:**<br>Cada equipo crea su propia versión del componente.\n\n**Resultado:** 15 variantes del mismo formulario.<br>Todas ligeramente diferentes.<br>Todas requieren mantenimiento separado.<br>**Fork hell.**\n\n#\n\n#\n\n#\n\n# **Cómo lo resuelve Stripe (y cómo deberías resolverlo tú):**\nStripe tiene **un solo componente de pago** que funciona en 40+ países.\n\n¿Cómo?\n\n**Las diferencias viven en configuración, no en código:**\n\n```\n<code>{\n  \"ES\": {\n    \"legalDisclaimer\": \"Texto específico español\",\n    \"fieldOrder\": [\"email\", \"card\", \"name\"],\n    \"dateFormat\": \"DD/MM/YYYY\"\n  },\n  \"DE\": {\n    \"legalDisclaimer\": \"Gesetzlicher Hinweis\",\n    \"fieldOrder\": [\"name\", \"card\", \"email\"],\n    \"dateFormat\": \"DD.MM.YYYY\"\n  }\n}\n</code>\n```\n**El componente es el mismo.**<br>La lógica es la misma.<br>Solo cambia la configuración.\n\nActualizas el JSON -> se propaga a todos los mercados.<br>**Cero forks.**\n\n🔗 **[Stripe Localization](https://stripe.com/docs/payments/payment-methods#localization)**\n\n**Otros ejemplos de lo que Stripe hace bien:**\n\n✓ **Validación IBAN en tiempo real:** No esperas días para saber que un formato es incorrecto. Lo sabes mientras escribes.\n\n✓ **Gestión de errores regulados:** Mensajes claros con códigos específicos. Legal aprueba templates una vez, no cada pantalla.\n\n✓ **Autenticación fuerte (SCA):** El sistema detecta automáticamente cuándo es necesario por regulación y lo muestra solo entonces.\n\n**La lección:**<br>Convierten complejidad regulatoria en ventaja competitiva.\n\nNo es magia. **Es diseño de infraestructura.**\n\n📝 **[Como expliqué en este post: cuando tu prototipo empieza a mentirte, es que no diseñaste infraestructura, diseñaste teatro](https://buildsystems.substack.com/p/the-day-our-perfect-prototype-started-lying-to-us-61971324637e)**\n\nSistemas que son invisibles pero imprescindibles.<br>Que priorizan operatividad por delante de estética.\n\n#\n\n#\n\n#\n\n# **3️⃣ Validación automática integrada**\nAccesibilidad, trazabilidad, consistencia.\n\n**Lo verifica el sistema. No la buena voluntad.**\n\n¿Por qué importa?\n\nPorque si la validación depende de que alguien recuerde revisar, tarde o temprano falla.\n\n**Accesibilidad:**<br>Tests automáticos de contraste, jerarquía de encabezados, navegación por teclado.<br>Si un componente no cumple WCAG AA, no pasa a producción. Automáticamente.\n\n**Y esto no es opcional:**<br>La Directiva Europea de Accesibilidad (European Accessibility Act) entra en vigor en junio 2025.<br>Las apps de banca están obligadas a cumplir WCAG 2.1 nivel AA.<br>No es recomendación. Es ley. Con multas.\n\nSi tu validación de accesibilidad es manual, ya vas tarde.\n\n#\n\n#\n\n#\n\n# **4️⃣ Source of truth interna**\nNo en Figma.<br>No en herramientas de terceros que controlan tus costes.\n\n**Hablemos de números reales:**\n\n**Equipo típico en banca: 100 developers + 20 UX**\n\n**Coste Figma en 2019:**\n\n* Professional: €12/editor/mes\n\n* 20 editores UX = €240/mes = **€2,880/año**\n\n* Viewers gratis para developers\n\n**Coste Figma en 2024:**\n\n* Professional: €15/editor/mes (subida 25%)\n\n* Organization: muchas empresas necesitan este plan ahora\n\n* Organization: €45/editor/mes\n\n* 20 editores = €900/mes = **€10,800/año**\n\n**Pero aquí viene el problema:**\n\nAhora Figma cobra por \"viewer seats\" en planes Enterprise para acceso completo a bibliotecas compartidas.\n\n**Enterprise plan (el que realmente necesitas para gobernanza):**\n\n* Precio estimado: €75-100/seat/mes\n\n* 120 usuarios (20 UX + 100 devs que necesitan acceso) = €9,000-12,000/mes\n\n* **= €108,000-144,000/año**\n\n**4,000% de aumento.**\n\nY no controlas:\n\n* Cuándo suben precios\n\n* Qué features nuevas te obligan a pagar más\n\n* Si mañana deciden cambiar el modelo de licencias\n\nEl verdadero riesgo no es solo el dinero, sino que tu gobernanza dependa de decisiones externas. **Por eso la fuente de verdad debe ser interna y controlada por tu organización.** \n\n**¿Por qué importa tanto?**\n\nPorque necesitas algo que:\n\n* **Para Product Managers:**<br>Cuando un Director Financiero pregunta \"¿por qué este copy funciona mejor?\", no puedes responder \"está en un archivo de Figma que alguien movió de carpeta\".\n\nNecesitas datos reales, versioning claro, histórico trazable.<br>Mostrar qué se aprobó, cuándo, por quién, y qué resultados dio.\n\n* **Para Desarrollo:**<br>Si la source of truth cambia cada semana porque alguien actualizó Figma sin avisar, los developers dejan de confiar.\n\nDocumentación interna, versionada y sincronizada con el código elimina ambigüedad.<br>Sin debates. Sin bloqueos.\n\n* **Para Legal:**<br>Cuando reguladores preguntan \"¿qué mostraban exactamente hace 6 meses?\", no puedes depender del histórico de Figma.\n\nNecesitas un sistema inmutable.<br>Que sobreviva cambios de herramientas, precios o políticas externas.<br>Que responda auditorías sin colapsar al equipo.\n\n<h2>**📊 La métrica que importa:**</h2>No son las historias cerradas.<br>No es la \"adopción del DS\".\n\nCada minuto perdido recuperando contexto es deuda silenciosa.\n\nLa que acaba con proyectos sin que nadie la vea venir.\n\n<h2>**🔄 Los rituales que mantienen el sistema vivo:**</h2>**-> Demos de aprendizajes, no solo de features**<br>Qué funcionó, qué falló, qué cambió. No es show & tell, es retrospectiva honesta.\n\n**-> Decisiones documentadas que se usan de verdad<br>**Un ADR (registro de decisión) no es un PDF que nadie vuelve a abrir.\n\nEs responder \"¿por qué lo hicimos así?\" sin necesidad de reuniones.\n\nCuando alguien nuevo pregunta, hay un documento claro que explica:\n\n* Qué decidimos\n\n* Por qué lo decidimos\n\n* Qué alternativas consideramos\n\nY está vinculado al código, no enterrado en Confluence.\n\n**-> Mapas de deuda técnica priorizados por coste real**<br>No por urgencia política. Por cuánto duele mantenerlo.\n\n**Liderar un DS no es \"entregar más rápido\".**\n\nEs:\n\n* Alinear incentivos entre equipos\n\n* Negociar excepciones con fecha de caducidad\n\n* Reducir deuda en silencio, sin ruido\n\n**El mejor líder de sistema es el que menos se nota.**\n\nPorque el sistema funciona solo.\n\n<h2>**🎯 Si el sistema se ve, interrumpe.**</h2>**Si ayuda, desaparece.**\n\n💬 **Preguntas para líderes de sistemas:**\n\n¿Qué métrica usas para detectar fragmentación?\n\n¿Dónde vive tu fuente de verdad?\n\n¿Cuánto pierdes cada vez que tu equipo se desvía del flujo por ambigüedades?\n\n👇 Comparte en comentarios 👇\n\n#DesignSystems #EnterpriseDesign #ProductLeadership #Banking #Governance",
      "tags": [
        "DX",
        "Invisible Design"
      ],
      "image": "assets/images/posts/invisible-system.png"
    },
    {
      "id": "breaking-rules",
      "title": "Tu Design System no falla por malos componentes",
      "date": "2025-09-10",
      "readTime": "System Ops",
      "description": "Falla porque nadie diseñó quién decide cuándo romper las reglas. La gobernanza es más importante que la librería de Figma.",
      "content": "He pasado los últimos años construyendo, rompiendo y reconstruyendo sistemas de diseño en Amazon, Western Union y startups. Y si hay una lección que se repite como un *loop* de error en consola, es esta:\n\n> **Nos obsesionamos con la superficie y ignoramos la estructura que la sostiene.**\n\nNo hablo de componentes, ni de tokens, ni de documentación. Hablo de la arquitectura *real*: la que define cómo se toman decisiones, quién tiene voz, y qué pasa cuando el sistema choca con la realidad del producto.\n\n<h2>**El mito del \"sistema perfecto\"**</h2>En mi artículo *\"[The Day Our Perfect Prototype Started Lying to Us](https://medium.com/@joanarbo/the-day-our-perfect-prototype-started-lying-to-us-61971324637e)\"*, conté cómo un prototipo impecable — con interacciones fluidas, estados definidos y lógica aparentemente sólida — se desmoronó en producción porque nadie había cuestionado **la API subyacente** .\n\nEl problema no estaba en Figma. Estaba en la brecha entre la *ilusión de control* del diseño y la *complejidad real* del sistema.\n\nEso mismo pasa con los Design Systems.\n\nCreamos bibliotecas hermosas, con variantes para cada caso de uso... pero no diseñamos el **protocolo de evolución**. No definimos cómo se resuelve un conflicto cuando un equipo necesita algo que el sistema no contempla. No establecemos quién puede romper las reglas... y cuándo.\n\n<h2>**La verdadera escalabilidad no es técnica. Es política.**</h2>Un Design System no escala por tener más componentes. Escala por tener **mecanismos claros para la toma de decisiones**.\n\n* ¿Quién decide que un token cambia de valor?\n\n* ¿Qué pasa cuando un equipo necesita un patrón que contradice el sistema?\n\n* ¿Cómo se resuelve un *trade-off* entre consistencia y innovación?\n\nEstas no son preguntas de diseño. Son preguntas de **gobernanza**. Y la mayoría de los sistemas las ignoran hasta que es demasiado tarde.\n\nEn *\"[Haikus y Tokens](https://medium.com/@joanarbo/haikus-y-tokens-18c753ad2b13)\"*, escribí que \"los Design Tokens son decisiones de diseño que se propagan a través de un sistema\" . Pero nunca dije la parte más incómoda: **las decisiones mal gobernadas se propagan como bugs**.\n\nYo también creí que con buenos componentes bastaba... hasta que mi sistema fue ignorado por 3 equipos.\n\n<h2>**El test de fuego: el primer fork**</h2>Todo sistema sano sobrevive su primer *fork*.\n\nEl momento en que un equipo, frustrado por la burocracia o la rigidez, decide crear su propia versión del sistema.\n\nMuchos lo ven como una traición. Yo lo veo como una señal.\n\nPorque si tu sistema no permite *evolución descentralizada*, no es un sistema. Es una cárcel.\n\nLa verdadera prueba no es si todos usan tu biblioteca. Es si, cuando alguien la rompe, **el sistema aprende en lugar de castigar**.\n\n<h2>**Entonces, ¿qué hacer?**</h2>Deja de pensar en tu Design System como un *producto*.\n\nPiénsalo como una **infraestructura de coordinación**.\n\n* Define reglas claras, pero no rígidas.\n\n* Documenta no solo *qué* hacer, sino *cómo decidir*.\n\n* Haz visible el proceso de cambio, no solo el resultado.\n\n* Celebra los *forks* que aportan valor, no solo la obediencia ciega.\n\n<h2>**La ironía final**</h2>Los mejores Design Systems no son los más usados.\n\nSon los que **desaparecen**.\n\nNo porque sean invisibles, sino porque su arquitectura es tan sólida que nadie tiene que pensar en ellas. El equipo se enfoca en resolver problemas reales, no en luchar contra el sistema.\n\nEso no se logra con más documentación.\n\n> Se logra con **menos ego y más estructura**.\n\n*Joan Arbó*\n\nUX Engineer @ Western Union | Ex-Amazon Alexa\n\n***¿Tu equipo ya hizo un fork de tu Design System? No lo castigues. Pregúntate: ¿qué feedback me está dando?***\n\nP.D.: Si tu Design System tiene un \"owner\" pero no un \"protocolo de desacuerdo\", ya está roto. Solo falta que alguien lo diga en voz alta.",
      "tags": [
        "Governance",
        "Ops"
      ],
      "image": "assets/images/posts/breaking-rules.png"
    },
    {
      "id": "two-scales",
      "title": "Las dos escalas del diseño: Átomos y Ecosistemas",
      "date": "2025-08-28",
      "readTime": "Deep Dive",
      "description": "Era el último día del curso de Design Systems cuando una pregunta lo cambió todo. Desde el átomo emocional de una invitación hasta la escala masiva de Amazon.",
      "content": "Era el último día del curso de Design Systems en MrMarcel School cuando Laura me hizo la pregunta que no pude quitarme de la cabeza.\n\n> \"Joan, hemos pasado meses estudiando design systems. Pero sigo sin entender cómo conectar la teoría con la práctica real. ¿Por qué todo se siente tan… plano?\"\n\nMe quedé en silencio.\n\nLlevaba dos años trabajando en un proyecto para Alexa, un Sistema de Diseño Conversacional. Interfaces multimodales que se desplegaban en diferentes pantallas, voz, gestos. Sistemas que orquestaban conversaciones, música, smart home, todo sincronizado. Era pensar en grande. Escala universo.\n\nPero esa noche me di cuenta: **Laura me estaba preguntando por el lado opuesto.**\n\n> ¿Y si la siguiente evolución no era hacia arriba, sino hacia abajo?\n\n**En los próximos 10 minutos te voy a mostrar cómo aplicar la metodología 'Powers of Ten' al diseño de sistemas. Descubrirás por qué trabajar solo en una escala (macro o micro) limita tu impacto, y cómo pensar en ambas simultáneamente puede cambiar radicalmente tus resultados.**\n\n#\n\n#\n\n# Powers of Ten: la lección que olvidamos\nEsa madrugada recordé un film de 1977 que cambió cómo vemos el mundo: \"**Powers of Ten**\" de Charles y Ray Eames.\n\nLa cámara está a 1 metro de distancia.\n\nCada 10 segundos, se aleja 10 veces más (10 metros, 100 metros, 1 kilómetro…).\n\nEl parque. La ciudad. Illinois. Estados Unidos. La Tierra. El sistema solar. La galaxia. El universo observable.\n\n*Llegamos a 10²⁴ metros. El borde de todo lo conocido.*\n\nLuego regresa. Al picnic. Y sigue hacia adentro.\n\nA la mano del hombre. A la piel. A las células. A las moléculas. A los átomos. A los quarks.\n\n*Hasta 10^-16 metros. La mínima expresión de la materia.*\n\n> 💡 El mismo punto. 40 órdenes de magnitud diferentes de verlo. Cada escala revela una realidad completamente nueva.\n\n#\n\n#\n\n# Alexa: cuando diseñaba en la escala del universo\nDurante dos años diseñé en el extremo macro.\n\nUn usuario en Boston dice: *\"Alexa, buenos días\"*\n\nEl sistema orquesta:\n\n* Lee noticias personalizadas\n\n* Ajusta luces de la casa\n\n* Muestra calendario en la pantalla\n\n* Sincroniza recordatorios en el móvil\n\n* Arranca playlist de Spotify\n\n***Una frase. Cinco experiencias. Tres dispositivos. Todo coherente.***\n\nEra diseño a escala ecosistema. Pensar en cómo sistemas complejos trabajan juntos. La vista desde 10^24 metros.\n\nPero esa noche, después de la pregunta de Laura, me di cuenta de algo inquietante:\n\n¿Qué pasa cuando bajas 40 órdenes de magnitud? ¿Cuál es la unidad mínima de un design system? ¿La mínima expresión que puede codificar significado?\n\n#\n\n#\n\n# El experimento: invitaciones de boda desde el átomo emocional\nDecidí aplicar \"**Powers of Ten**\" al caso más empático que se me ocurrió: invitaciones de boda digitales.\n\nLa escala tradicional (vista desde 10 metros):\n\nTenía 73 templates en Figma:\n\n* Template \"Romántico\" #1\n\n* Template \"Moderno\" #2\n\n* Template \"Clásico\" #3\n\nEl proceso era el de siempre: pareja elige template, cambio colores, ajusto nombres y fecha, envío. *Rinse and repeat.*\n\nEs la escala \"humana\" del diseño. Donde todos operamos normalmente.\n\n#\n\n#\n\n#\n\n# Pero ¿qué pasa si bajo a escala atómica?\nEn lugar de mostrar templates, pregunté a Laura (sí, mi alumna) y su pareja:\n\n*\"¿Cómo queréis que se sientan vuestros invitados cuando reciban la invitación?\"*\n\nLaura y su pareja: *\"Íntimos, cálidos, familiares\"*\n\nNo busqué *\"Template Romántico #3\"*.\n\n**Bajé a la mínima expresión. A los *****tokens emocionales de la invitación:***\n\n```\n$invitation-intimacy: (\n. spacing: generous, // respira, no agobia\n. palette: warm-earth, // terracotta, cream, sage\n. typography: gentle, // serif suave, no imponente\n. decoration: minimal. // flores discretas, no pomposas\n);sc\n```\n**Es como en el film de los Eames:** cuando bajas a escala molecular, descubres que lo que parecía sólido (un template de boda) en realidad está hecho de átomos (decisiones emocionales mínimas).\n\n#\n\n#\n\n# Las dos escalas en acción: Alexa vs invitaciones de boda\n#\n\n#\n\n#\n\n# **Escala Macro (mi proyecto en Alexa — 2 años):**\n**Usuario: Alexa, quiero ambiente romántico\"**\n\nSistema orquesta múltiples dispositivos:\n\n* Luces → warm amber, 30% intensidad\n\n* Música → jazz suave, volumen bajo\n\n* Pantalla → fireplace animation\n\n* Temperatura → sube 2 grados\n\nUna instrucción. Cuatro sistemas. Todo sincronizado.\n\nVista desde el universo: cómo experiencias complejas trabajan juntas.\n\n#\n\n#\n\n#\n\n# **Escala Micro (invitaciones de boda — el nuevo approach):**\nPero ¿qué hace que \"warm amber\" se sienta romántico y no \"bright white\"?\n\nAhí está el átomo. El mismo principio aplicado a una invitación de boda:\n\n```\n// El \"átomo romántico\" de Alexa\n$romantic-light: (\n. hue: 30, // naranja cálido\n. saturation: 85, // rico pero no saturado\n. brightness: 30. // íntimo, no brillante\n);\n\n// El mismo \"átomo romántico\" en una invitación\n$invitation-warmth: (\n. color-primary: hsl(30, 85%, 30%), // mismo hue\n. color-accent: hsl(30, 75%, 85%), // versión suave\n. color-background: hsl(30, 25%, 95%) // casi blanco cálido\n);\n```\n**⚠️ El insight:** Para que Alexa funcione a escala universo, alguien tuvo que diseñar primero a escala átomo. Lo mismo con las invitaciones de boda.\n\n#\n\n#\n\n# Cuando el átomo define el universo: caso real\nAna y Marcos responden diferente: \"Vibrante, internacional, celebración\"\n\n**Escala Micro (los tokens de su invitación):**\n\n```\n$invitation-celebration: (\n. spacing: dynamic, // elementos que se solapan\n. palette: festive-bold, // electric blue + gold\n. typography: geometric, // sans-serif arquitectónica\n. decoration: maximal. // ornamentación festiva\n);\n```\n**Escala Macro (toda su experiencia de boda digital):**\n\nDesde esos átomos, el sistema genera automáticamente:\n\n* Save the date (primer contacto)<br>Usa los tokens: espaciado dinámico, paleta festiva<br>Mood: \"algo grande viene\"\n\n* Invitación principal (core experience)<br>Mismos tokens, jerarquía más compleja<br>Mood: \"celebración internacional\"\n\n* RSVP card (interacción)<br>Tokens aplicados a formulario<br>Mood: \"responde con energía\"\n\n* Thank you notes (despedida)<br>Tokens más suaves pero reconocibles<br>Mood: \"gracias por celebrar con nosotros\"\n\n> Todo coherente. Porque los átomos emocionales son consistentes.\n\nEs exactamente como \"**Powers of Ten**\":\n\nDesde 10^-16 (el token `$festive-bold: hsl(210, 100%, 50%)`) hasta 10^24 (toda la experiencia digital de boda) hay 40 escalas entre medio.\n\n> 💡 Si el átomo no codifica emoción correctamente, toda la experiencia de boda se siente genérica.\n\n#\n\n#\n\n# Los números que validaron las dos escalas\nSeis meses probando este approach con invitaciones de boda digitales:\n\n📊 Client satisfaction: 78% → 94%\n\n⏱️ Iterations to approval: 5–7 → 2–3.\n\n💰 Conversion rate: 23% → 41%\n\n📈 Referrals: 12% → 38%\n\n#\n\n#\n\n# Lo revelador:\n**Las parejas dejaron de pedir \"cambia este color por ese\" (pensamiento macro, nivel template) y empezaron a decir\" se siente exactamente como nosotros\" (coherencia desde lo micro, nivel átomo).**\n\nPorque cuando diseñas invitaciones desde la mínima expresión emocional hacia arriba, **cada pieza hereda la personalidad de la pareja.**\n\n#\n\n#\n\n# Lo que Laura realmente me preguntó\nLaura no cuestionaba la teoría de design systems.\n\nSeñalaba algo más profundo: **todos pensamos design systems en una sola escala.**\n\nYo había pasado dos años en el extremo macro con Alexa:\n\n* Experiencias multimodales que orquestan dispositivos\n\n* Sistemas cross-platform sincronizados\n\n* Ecosistemas complejos de experiencias\n\nPero había ignorado el extremo opuesto en las invitaciones de boda:\n\n* ¿Cuál es el átomo emocional de una invitación?\n\n* ¿Qué es la mínima expresión que define \"romántico\"?\n\n* ¿Cómo se codifica \"intimidad familiar\" en un solo token?\n\n**Como en el film de los Eames:** si solo ves las invitaciones desde \"template completo\", nunca descubres los átomos emocionales que las construyen.\n\n> 🎯 El futuro del diseño no es elegir macro o micro. Es pensar en ambas escalas simultáneamente.\n\n#\n\n#\n\n# La conexión entre Alexa y una invitación de boda\nAsí es como funciona en ambos casos:\n\n**Escala Micro (10^-16): Un token de color**\n\n```\n// En Alexa\n$ambient-romantic: hsl(30, 85%, 30%);\n\n// En invitación de boda\n$invitation-warmth: hsl(30, 85%, 30%);\n```\n**Escala Molecular (10^-8): Un componente**\n\n```\n// En Alexa\n<LightControl mood=\"romantic\" />\n\n// En invitación\n<Card emotional-tone=\"intimate\" />\n```\n**Escala Celular (10^0): Una escena completa**\n\n```\n// En Alexa\n<RomanticAmbience room=\"living\" />\n\n// En invitación\n<WeddingInvitation couple=\"Laura-Pablo\" />\n```\n**Escala Ecosistema (10^8): Una experiencia completa**\n\n```\n// En Alexa (multi-dispositivo)\n<SmartHomeExperience mood=\"romantic\" />\n\n// En boda (multi-formato)\n<WeddingExperience theme=\"intimate-celebration\" />\n```\n**Cada escala construye sobre la anterior. Pero sin los átomos correctos en 10^-16, todo el universo en 10^24 se siente genérico.**\n\nYa sea Alexa orquestando tu casa o una invitación de boda llegando a tu WhatsApp.\n\n#\n\n#\n\n# Lo que viene: el diseñador bidireccional\nEstoy desarrollando una metodología que opera en ambas direcciones:\n\n**Cuando subes (macro):**\n\n* Desde tokens de boda → save the date → invitación → experiencia completa\n\n* Como construir una celebración desde sus átomos emocionales\n\n**Cuando bajas (micro):**\n\n* Desde \"quiero boda íntima\" → ¿qué paleta? → ¿qué tokens definen intimidad?\n\n* Como entender por qué una invitación se siente de cierta manera\n\n> El poder: Coherencia emocional desde el quark hasta el universo.\n\nYa sea en Alexa multimodal o en invitaciones de boda digitales.\n\n#\n\n#\n\n# **Tu turno:**\n¿En qué escala diseñas normalmente?\n\n¿Has pensado en experiencias macro (como Alexa, ecosistemas)?\n\n¿Has bajado a escala micro (tokens que sienten) en tus proyectos?\n\n¿Qué descubrirías si cambiaras tu escala 10x arriba o 10x abajo?\n\n**Ejercicio para hoy:**\n\n**Toma tu último proyecto. Identifica en qué escala trabajaste (¿templates completos o tokens básicos?). Ahora imagina: ¿qué descubrirías si bajaras/subieras 10 escalas? Comparte tu respuesta en comentarios.**\n\n#DesignSystems #PowersOfTen #SystemsThinking #EmotionalDesign #WeddingDesign #DesignScale",
      "tags": [
        "Scales",
        "Education",
        "Philosophy"
      ],
      "image": "assets/images/posts/two-scales.png"
    },
    {
      "id": "lying-prototype",
      "title": "The Day Our Perfect Prototype Started Lying to Us",
      "date": "2025-08-15",
      "readTime": "Case Study",
      "description": "Designers waste weeks chasing 'pixel-perfect' — when bold product questions need real answers, fast.",
      "content": "Sophie, our Product Manager, had that look. You know the one — when someone's trying to solve a puzzle that shouldn't exist.\n\nWe were in a routine demo of our e-commerce checkout flow, the kind of meeting that usually ends with everyone nodding and moving on. Our prototype was gorgeous. Every pixel in place, every interaction smooth. The demo ran like clockwork.\n\nBut Sophie was staring at her laptop, scrolling through customer support tickets.\n\n\"I don't get it,\" she said, breaking the satisfied silence. \"Henrik keeps failing at checkout, but it works perfectly here. If our API throws payment errors, why can't I see them in our documentation?\"\n\nThat's when it hit me. **We'd built a beautiful lie.**\n\n#\n\n#\n\n# The Comfortable Fiction of Happy-Path Testing\n**Our API documentation was like a restaurant menu that only shows pictures of perfect dishes — never the soggy chips or burnt edges that real customers sometimes get.**\n\nMeet our cast of characters:\n\n**Emma** lives in central Amsterdam. She has iDEAL banking, multiple saved cards, and her postcode gets next-day delivery for everything. When Emma shops, the internet loves her back.\n\n**Henrik** is a university student in rural Finland. His Nordea card gets declined for mysterious cross-border reasons, shipping to his address takes two weeks, and half the products he wants are \"not available for delivery to Finland.\" Henrik's shopping experience is an obstacle course.\n\n**Marcel** runs procurement for a mid-size company in Lyon. He needs bulk discounts, SEPA transfers, and someone from accounting to approve anything over €500. The e-commerce world wasn't built for Marcel's French procurement regulations.\n\nOur documentation only knew how to be Emma. It had never met Henrik or Marcel.\n\n#\n\n#\n\n# The €75,000 Documentation Problem\nHere's what we discovered: Henrik wasn't just failing at checkout. He was costing us serious money.\n\nEvery time Henrik's card got declined for a GDPR-related restriction we hadn't documented, someone called customer service. Every time his Finnish address triggered an error we'd never tested, we lost a sale and gained a support ticket.\n\nThe math was brutal. We were spending 48 hours in meetings trying to understand problems that should have taken 30 seconds to reproduce.\n\nOur beautiful documentation had become an expensive fiction.\n\n#\n\n#\n\n# The Fix: When Documentation Meets Reality\n**So we did something simple that felt radical. We put Henrik, Emma, and Marcel directly into our API documentation.**\n\nNow, when Sophie opens our docs, she sees a sidebar with three buttons. Click \"Henrik,\" and suddenly the same checkout API that worked perfectly for Emma starts throwing real errors: \"*Payment method not available in Finland.*\" \"*Shipping delayed due to customs requirements.*\" \"*Product restricted under EU regulations.*\"\n\nIt's not just different data — it's different reality. Henrik's button makes the API slower (rural Finnish internet), pickier (Nordic banking restrictions), and more honest about what doesn't work across the Single Market.\n\nThe testing environment stopped being a demo reel and became a truth machine.\n\n#\n\n#\n\n# What We Learned About Building for Real People\nThe change was immediate. Sophie could finally see what Henrik saw. Our engineers could debug GDPR edge cases without playing 20 questions with customer service. **Our support tickets for checkout issues dropped by 41%.**\n\nBut the bigger lesson was about who we'd been building for. Emma is real, but she's also easy. She has fiber internet, SEPA compatibility, and lives where everything ships quickly. Building for Emma feels like progress because everything works.\n\nHenrik is real too, but he's inconvenient. His limitations expose every assumption we've made about how European shopping should work. Building for Henrik feels like problem-solving because nothing is guaranteed across 27 member states.\n\nThe beautiful, Emma-optimized checkout that looked so good in demos was actually a wall that kept Henrik out. Our documentation had helped us build that wall by making it invisible.\n\n#\n\n#\n\n# The Bigger Picture: When Perfect Becomes the Enemy of Good\n**This isn't just about e-commerce or APIs. It's about a common management trap: optimizing for the ideal customer while ignoring the real ones.**\n\nEvery business has an Emma — the customer who makes your metrics look great and your demos sing. Every business also has a Henrik — the customer who reveals where your product actually breaks down across the complexity of the European market.\n\nMost teams build documentation like they're writing the owner's manual for a car that only drives on perfect German autobahns. They document the happy path because it's clean, predictable, and makes everyone feel competent.\n\nBut your customers don't live on perfect roads. They live in Henrik's Lapland, where the internet is slow and the banks have different rules. They work in Marcel's Lyon, where nothing is simple and everything needs approval under French commercial law.\n\n#\n\n#\n\n# Three Questions That Changed How We Build\nBefore we ship anything now, we ask:\n\n**Does this work for Henrik?** Not in theory — in practice, with his slow connection and strict Nordic banking requirements.\n\n**Can Sophie test the Henrik scenario herself?** Without scheduling an engineering deep-dive or hoping GDPR compliance works.\n\n**What does failure actually look like?** Not the sanitized error message, but the frustrated user experience across different EU regulations.\n\nThese questions changed how we think about everything from feature specs to marketing copy. Emma shows us what's possible. Henrik shows us what's necessary across the European Single Market.\n\nThe day our documentation started telling the truth about Henrik was the day we stopped building for the customer we wished we had and started building for the customers we actually serve across 27 different regulatory environments.\n\nThat's when our perfect prototype stopped lying and started working.\n\n> Your documentation isn't just instruction manual — it's a mirror. Make sure it's reflecting the right reality across all your markets.\n\n*More to come...*\n\n*I'll dig into the evolution of our API and its ripple effects on how we think about design systems.*\n\n*Want the rest of the story? Join me for the next one.*\n\n**#ProductStrategy #CustomerExperience #TechnicalDocumentation #EuropeanMarkets #ProductLeadership #APIDesign #UserCenteredDesign #GDPR #SingleMarket**",
      "tags": [
        "Prototyping",
        "Process",
        "Reality"
      ],
      "image": "assets/images/posts/lying-prototype.png"
    },
    {
      "id": "ai-thinking",
      "title": "La IA no me quita el trabajo, me reta a pensar distinto",
      "date": "2025-08-01",
      "readTime": "Essay",
      "description": "De pedirle que ejecute a pedirle que me rete: el prompt y el proceso que sí cambian cómo construyo.",
      "content": "Cómo paso de \"IA que ejecuta\" a \"IA que me reta\". El prompt y el proceso que sí cambian cómo construyo.\n\nHe visto a la IA generar archivos que imprimiría y enmarcaría. También la he visto romper contextos por complaciente. La diferencia no es magia: es cómo conversas con ella. Cuento el cambio que hice: de pedirle que ejecute a pedirle que me rete.\n\n#\n\n#\n\n# Un cambio real: cuando la IA me dejó sin palabras\nEn Western Union, tras definir una colección inicial de tokens, la IA refinó el set y generó un SCSS tan limpio que fui directo al director de tecnología: \"Esto hay que imprimirlo y enmarcarlo\". Concretamente: eliminó 27 duplicados, agrupó semánticos por intención y propuso una escala de spacing que luego adopté en todos los proyectos. Aprendizaje: el valor no fue el código, fue la conversación que nos obligó a decidir lo inmutable.\n\nLlevo años revisando y enseñando archivos de tokens — en empresas como Amazon o Western Union, con equipos grandes, analizándolos en cursos y charlas — y nunca había visto uno tan afinado, así, de una tacada.\n\n#\n\n#\n\n# Vulnerabilidad: lo que me inquieta de verdad\nSí, asusta que ahora alguien con menos experiencia monte un sistema en una fracción del tiempo. Mi respuesta no es competir contra la IA en ejecución, sino liderar el contexto, el criterio y los acuerdos. Eso no se autogenera: se diseña conversando.\n\n#\n\n#\n\n# Cuando la IA falla\n¿El talón de Aquiles de la IA? Si le falta contexto, puede fallar estrepitosamente. Las primeras versiones de GPT eran terriblemente complacientes: respondían siempre algo, aunque no tuviera sentido. Ahí sigue estando nuestro valor: saber decirle \"por aquí no\", exigirle que nos pregunte más y añada profundidad — no aceptar el primer borrador ni la respuesta fácil.\n\n#\n\n#\n\n#\n\n# **Señales de que la IA está complaciente (y cómo cortarlo):**\n\n* Te da respuestas largas sin pedirte más contexto -> Respuesta: pide 3 preguntas antes de proponer soluciones.\n\n* Te devuelve código perfecto pero desconectado del problema -> Pide \"razón, trade-offs y riesgos\".\n\n* Te dice \"sí\" a todo -> Pide contraejemplos y un test de estrés rápido.\n\n#\n\n#\n\n# El prompt más tonto pero potente que uso\nTe regalo el prompt que mejores resultados me ha dado:\n\n```\nEres un experto en tu campo. A partir de ahora serás mi asesor en {tema\nconcreto}. No seas complaciente conmigo: cuestiona mis supuestos, hazme \npreguntas antes de proponer soluciones y plantea riesgos y trade-offs. \n\nTrabajemos en iteraciones de máximo 10 minutos y termina cada vuelta con: \n\n1) decisión sugerida\n\n2) riesgos\n\n3) siguiente pregunta\n```\n#\n\n#\n\n#\n\n# Mi flujo en 5 pasos\n\n* Defino el contexto en 5 líneas (quién, para qué, restricciones).\n\n* Pido 3 preguntas y paro (si no pregunta, reintento).\n\n* Exijo 2 alternativas con trade-offs (no \"la mejor práctica\" genérica).\n\n* Valido con un ejemplo pequeño (no specs completas).\n\n* Resumo yo lo aprendido y lo uso como prompt para la siguiente iteración.\n\nLa clave: no es magia ni adulación — es abrir una dinámica de conversación exigente, ida y vuelta, exigiendo valor y afinando juntos.\n\n#\n\n#\n\n# Mi consejo práctico\nAtrévete: empieza un proyecto propio básico desde cero con ayuda de la IA, trastea, rómpelo, itera y, cuando lo termines, pídele a la IA que te resuma lo aprendido y vuelve a empezar con ese resumen como prompt inicial.<br>La segunda, tercera y cuarta versión serán mejores y más tuyas.\n\n#\n\n#\n\n# ¿Y tú?\n¿Te atreves a dejar a la IA retarte — no solo a ejecutarte tareas? ¿Qué fue lo último que la IA te enseñó o que nunca hubieses hecho sin ella?\n\n#AIUX #DesignSystems #Solopreneur #ProductThinking\n\n> La creatividad no la reemplaza la IA. Pero la IA, si la entiendes, te obliga a ser más creativo que nunca.",
      "tags": [
        "AI",
        "Mindset",
        "Career"
      ],
      "image": "assets/images/posts/ai-thinking.png"
    },
    {
      "id": "writing-workflow",
      "title": "Cómo lanzo un post valioso cada semana en 30 min",
      "date": "2025-07-20",
      "readTime": "Workflow",
      "description": "Sin quemarse, sin depender de la inspiración. Mi sistema de creación de contenido asistido por IA y Notion.",
      "content": "*Lee este artículo en inglés [aquí](https://medium.com/@joanarbo/how-i-write-and-publish-a-valuable-post-every-week-in-just-30-minutes-thanks-to-ai-notion-1e15de49805c)*\n\n¿Te imaginas escribir (y publicar), sin quemarte, ni depender de la inspiración… y sin postureo?<br>El primer día no sabía si solo escribiría por inercia. Ahora disfruto (casi) más del proceso que del post en sí.\n\n> \"A los famosos les escriben libros tras entrevistarles. Yo tengo una IA que me entrevista a diario, me reta y consigue que mis ideas tengan sentido — y con eso, me basta.\"\n\n#\n\n#\n\n#\n\n# Por qué sistematicé mi proceso de publicar semanalmente\nAntes creía que un post valioso requería dos o tres días de dar vueltas, bocetar, reescribir y ajustar. <br>Como diseñador e ingeniero, siempre he buscado claridad… pero casi siempre mi primer borrador solo lo entiendo yo (o mis alumnos más cercanos), mientras que a un público profesional y exigente rara vez le resuena.\n\nHasta que lo acepté:\n\n* Publicar tiene que ser sostenible y rápido, no perfecto.\n\n* Las mejores ideas suelen surgir después de publicar, no antes.\n\nAsí que monté una rutina semanal mezclando una plantilla en Notion, un protocolo muy simple y mi nueva \"*pareja creativa*\": una IA que me entrevista y perfecciona el resultado.\n\n* Antes: Dudas, bloqueos, textos que no conectaban.\n\n* Después: Libertad, foco y control creativo gracias a la rutina+IA.\n\n> Por ejemplo, antes cada borrador se quedaba sin publicar por miedo a la crítica. Ahora, publico sin miedo a que no sea perfecto, porque el aprendizaje real viene justo después.\n\n#\n\n#\n\n#\n\n# Mi workflow de 30 minutos: crear contenido sin quemarme\n¿El proceso real, sin postureo?\n\n**1. Abro mi plantilla de Notion.<br>** Cada semana duplico una simple \"Tarjeta diaria\". Me pide:\n\n```\n#\n\n#\n\n# Mi plantilla diaria en Notion (extracto)\n\n- **¿Cuál es el reto/tema concreto de hoy?**\n- **¿Por qué justo este tema es importante para mí / para otros?**\n- **¿Qué he hecho, experimentado o aprendido sobre esto (con una anécdota real)?**\n- **¿Qué barrera me frenó y cómo la sorteé (si la hubo)?**\n- **¿Qué \"microfracaso\" puedo compartir que ayude a otros?**\n- **¿Cuál es la idea principal que debería recordar si solo pudiese escribir 1 línea hoy?**\n- **¿Cómo puedo retar a mi audiencia para que me sorprenda?**\n- **Call to action claro: ¿Qué busco hoy? Feedback, conversación, co-creación...**\n\n*(Añado una sección de reflexión rápida tipo \"mini-diario\" para entender si lo que escribo hoy conecta con el rumbo que quiero.)*\n```\n**2. Dejo que la IA me entreviste en función de lo que he rellenado en la tarjeta.<br>** En vez de pelearme con la hoja en blanco, le pido a la IA que me desafíe — *\"¿Dónde está el verdadero problema? ¿En qué he fallado? ¿A quién sirve de verdad esto?\" *<br> A veces refina mis ideas genéricas, otras veces da la vuelta y pregunta justo lo que mi público necesitaría escuchar.\n\n> *Ejemplo real:* \"Hoy la IA me preguntó si ese ejemplo podía ser útil a alguien sin background técnico. Eso me hizo simplificar todo el post.\"\n\n**3. Mantengo el post compacto.<br>** Nada de ensayos largos: el aprendizaje o micro-historia, a lo sumo antes/después (**Antes: 3 días por post. Ahora: 30 minutos y una rutina establecida**).\n\n**4. Publico siempre un asset visual. <br>** Diagrama, snippet de código o simplemente una \"comparativa antes/después\" (¡a veces solo exporto de Figma!). <br>Publicar algo tangible separa tu mensaje del humo y da credibilidad real.\n\n**5. Cierro con una CTA honesta.<br>** Nada de \"DM ya\", sino propuesta real de interacción: que la gente comente su rutina, su peor fail, o si quiere la plantilla. Las mejores respuestas se convierten en material para el post de la siguiente semana.\n\n**6. Bloque de reflexión/confesión.<br>** Siempre una línea de auto-crítica real (\"*No sé si hoy lo he clavado para el público pro*\" / \"*Me he pasado de blando o me fui al tecnicismo fácil*\"). Es mi diario de a bordo: escribo para ordenarme yo y, de paso, para hacer comunidad.\n\n#\n\n#\n\n#\n\n# Ejemplos de prompts y preguntas reales que uso\n- \"*¿Qué aprendiste a las malas prototipando con código?*\"<br>- \"*¿Cuándo una rutina o plantilla realmente te ayudó a ir más rápido, de verdad?*\"<br>- \"*¿Dónde pierdes más tiempo o energía: redactando, editando, buscando feedback?*\"\n\n*(Si quieres, roba estas preguntas para tu Notion, Google Doc o pégalas a tu IA habitual.)*\n\n#\n\n#\n\n# Por qué esta rutina FUNCIONA\n\n* **Ahorra tiempo**: Pasé de días a 30 minutos (¡a veces menos!) por cada post.\n\n* **Te libra de la trampa de la perfección:** Publicar periódicamente me hace preocuparme menos por cada frase — y centrarme más en aprender junto a quien me lee.\n\n* **Construye autoridad real:** Repetición, minicuentos y enseñanzas realistas funcionan mucho mejor que cualquier \"*gran teoría*\".\n\n#\n\n#\n\n#\n\n# Vulnerabilidad real\nSinceramente: sigo dudando si mi voz conecta con el público pro. Muchas veces me lío, peco de empático ('ñoño') o quedo a medias entre mi yo profe de siempre y mi versión más estratégica. <br>Pero esta \"micro-rutina-diario\" me da foco y, lo mejor, crea un feedback loop donde los lectores (y hasta los que critican…) ayudan a mejorar tanto mi contenido como mi metodología.\n\n¿Y tú? ¿Sientes que tu voz a veces se diluye por 'ir de profe' o por miedo a no sonar lo bastante profesional? Yo sí — y por eso te propongo probar mi rutina y decirme si también te libera.\"\n\n#\n\n#\n\n# ¿Quieres la plantilla? ¿O ver cómo la IA me entrevista (de verdad)?\nSolo tienes que dejar un comentario \"ENTREVISTA\" o mandarme mensaje. Comparto plantilla, guion si te ayuda a empezar la tuya.<br>Todavía no he encontrado IA capaz de darme feedback tan 'real' como un comentario sincero, un debate productivo o incluso una crítica inesperada.\n\n> La rutina no mata la creatividad. Al revés: le da el espacio para ser honesta, breve y compartida cada día.\n\n#productividad #escribirendigital #designsystems #notion #ai #promptengineering #buildinpublic\n\n*Joan Arbó — UX Engineer con 18 años de experiencia, profesor de Design Systems y apasionado de acelerar equipos sin perder calidad. Ex-Amazon, ahora en Western Union. ¿Hablamos? [me@joanarbo.com](mailto:me@joanarbo.com)*",
      "tags": [
        "Productivity",
        "Writing",
        "Notion"
      ],
      "image": "assets/images/posts/writing-workflow.png"
    }
  ],
  "ideas": [
    {
      "id": "hybrid-engineer",
      "title": "El Colapso de las Especialidades",
      "date": "2026-01-14",
      "readTime": "12 min lectura",
      "description": "Una reflexión sobre la muerte del rol binario. El futuro pertenece al 'Full-Stack Designer' que no solo define la visión, sino que programa la infraestructura que la soporta.",
      "content": "Hace una década, la división del trabajo en productos digitales era clara y, aparentemente, necesaria. Teníamos \"Creativos\" que soñaban en Photoshop y \"Técnicos\" que construían en PHP o Java. Esta estructura, heredada de la línea de montaje industrial (Fordismo), optimizaba la producción lineal. Pero el software ya no es lineal.\n\n> **Concepto Visual**\n> Un diagrama evolutivo. Izquierda: 'Silo Era' (Diseño -> Spec -> Código). Derecha: 'System Era' (Tokens <-> Agentes <-> UI). Estilo: Data Viz editorial.\n\n#\n\n#\n\n# La Era de la Especialización (2010-2023)\n\nDurante el boom del SaaS, especializamos los roles hasta el absurdo. UX Researchers, UI Designers, Interaction Designers, UX Writers, Frontend Developers, CSS Specialists... La teoría era que la hiper-especialización aumentaba la calidad. La realidad fue que aumentó la **burocracia**.\n\nEl costo de coordinación (el \"overhead\" de comunicación) superó al valor del trabajo individual. Pasamos más tiempo sincronizando Figma con Jira que resolviendo problemas de usuario. Creamos el problema del \"Handoff\": el momento traumático donde la intención se pierde en la traducción.\n\n#\n\n#\n\n# El Catalizador: Inteligencia Artificial\n\nLa IA Generativa ha commoditizado la ejecución técnica de ambas partes.\n*   **Midjourney/v0** commoditizan la exploración visual.\n*   **Cursor/Copilot** commoditizan la sintaxis del código.\n\nSi la IA puede generar el mock-up y también puede escribir el componente en React, ¿cuál es el rol del humano? **La Orquestación Sistémica**.\n\n> \"El valor ya no reside en mover píxeles ni en escribir loops. Reside en definir la *Lógica del Sistema* que gobierna ambas cosas.\"\n\n#\n\n#\n\n# El renacimiento del Generalista (Full-Stack Designer)\n\nEstamos viendo el retorno del perfil \"Webmaster\" de los 90s, pero con superpoderes. Un solo individuo ahora puede concebir, diseñar y desplegar una aplicación completa. No porque sea un genio, sino porque las herramientas de abstracción se lo permiten.\n\nEl \"Full-Stack Designer\" no es un desarrollador mediocre y un diseñador mediocre. Es un **Arquitecto de Producto**. Alguien que entiende que:\n1.  Un **Design Token** en Figma no es un color, es una variable de pre-procesador.\n2.  Una **animación** no es un 'easing', es una función matemática de interpolación.\n3.  La **accesibilidad** no es un checklist, es una estructura semántica HTML correcta.\n\n#\n\n#\n\n# Engineering Case Study: La validación de una Hipótesis\n\nEn Amazon, observé cómo los equipos híbridos (Design Technologists) entregaban valor 4x más rápido que los equipos segregados. ¿Por qué?\n*   **Cero traducción**: No hay specs. El prototipo *es* la especificación.\n*   **Validación técnica inmediata**: Si el diseño rompía el performance, se sabía en el día 1, no en el día 40.\n*   **Iteración fluida**: Cambiar el diseño significaba cambiar una variable en el código, no actualizar 50 artboards.\n\n#\n\n#\n\n# Conclusión Educativa\n\nSi eres diseñador, deja de obsesionarte con las herramientas de dibujo y aprende cómo el navegador renderiza tu trabajo (Box Model, DOM, CSS Grid). Si eres desarrollador, estudia Tipografía, Gestalt y Jerarquía Visual.\n\nEl futuro no pertenece a quien mejor usa la herramienta, sino a quien mejor entiende el **medio**.\n\n---\n\n#\n\n#\n\n#\n\n# Auditoría de Madurez de Diseño\n¿Sientes que tu organización sufre de \"parálisis por especialización\"? **Audito la estructura de tu equipo de producto** para identificar cuellos de botella en el flujo Diseño-Ingeniería y propongo una transición hacia modelos híbridos de alta eficiencia.\n\n[<i class=\"ph ph-arrow-right\"></i> Solicitar Auditoría Organizacional](mailto:me@joanarbo.com?subject=Auditoría%20Organización%20Producto)",
      "tags": [
        "Filosofía",
        "Carrera",
        "Estrategia"
      ],
      "status": "active"
    },
    {
      "id": "ai-components-ex",
      "title": "Interfaces de Intención",
      "date": "2026-01-12",
      "status": "active",
      "readTime": "15 min lectura",
      "description": "Experimentos en UI generativa donde el usuario describe un objetivo sistémico y el motor renderiza la solución optimizada, validando accesibilidad y performance en tiempo real.",
      "content": "Durante los últimos 40 años, el paradigma de la Interfaz Gráfica de Usuario (GUI) ha sido **Imperativo**. Nosotros, como creadores, definimos *exactamente* qué elementos aparecen en pantalla, sus coordenadas, sus colores y sus estados. \"Pinta un botón de 40x20px en (x,y)\".\n\nEste modelo asume que conocemos el contexto del usuario mejor que el sistema. Pero con la diversidad actual de dispositivos y contextos, esa asunción es arrogante e ineficiente.\n\n> **Concepto Visual**\n> Comparativa. Lado A 'Imperativo': Un plano arquitectónico rígido. Lado B 'Declarativo': Un fluido orgánico que se adapta a un contenedor. Estilo: Abstracto, wireframe 3D.\n\n#\n\n#\n\n# El Problema: La Rigidez de los Componentes Estáticos\n\nImaginemos un flujo simple: **\"El usuario quiere cancelar su suscripción\"**.\n\nEn el diseño tradicional, creamos un \"Modal de Cancelación\". Diseñamos el estado ideal, el estado de error, el estado de carga. Pero, ¿qué pasa si el usuario está en un reloj inteligente? ¿Qué pasa si el usuario está usando un lector de pantalla a 200wpm? ¿Qué pasa si el usuario tiene prisa detectada por el acelerómetro?\n\nEl componente estático falla porque es sordo al contexto.\n\n#\n\n#\n\n# La Solución Propuesta: UI Generativa (Intention-based UI)\n\nLa IA Generativa nos permite movernos hacia un paradigma **Declarativo**. En lugar de diseñar pantallas, diseñamos **Intenciones** y **Restricciones**.\n\n#\n\n#\n\n#\n\n# Arquitectura del Experimento\n\nHe construido un prototipo utilizando Vercel AI SDK y una librería de componentes 'headless' (sin estilo predefinido). El flujo es el siguiente:\n\n1.  **Captura de Intención**: El sistema recibe un input abstracto. `UserIntent: { action: \"cancel_subscription\", urgency: \"high\", device: \"mobile\" }`.\n2.  **Motor de Decisión (LLM)**: Un modelo pequeño (SLM) analiza la intención contra una base de reglas de diseño.\n    *   *Regla 1*: Acciones destructivas requieren confirmación explícita.\n    *   *Regla 2*: En móvil, evitar modales centrados; usar 'Bottom Sheets'.\n    *   *Regla 3*: Usuario con prisa -> Eliminar textos de marketing.\n3.  **Renderizado Just-in-Time**: El sistema instancia los componentes necesarios en tiempo real.\n\n```jsx\n// El sistema decide qué renderizar\nif (context.isMobile) {\n  return <BottomSheet variant=\"danger\">\n           <ConfirmButton action={cancel} />\n         </BottomSheet>;\n} else {\n  return <Modal type=\"alert\">\n           <Illustration name=\"sad-face\" />\n           <ConfirmButton action={cancel} />\n         </Modal>;\n}\n```\n\n#\n\n#\n\n# Resultados y Aprendizajes\n\nEste enfoque cambia radicalmente el rol del Design System. Ya no documentamos \"Cómo se ve un modal\", documentamos \"Cuándo y Por qué se debe usar un modal\".\n\nLa interfaz resultante es intrínsecamente más accesible y usable, porque se ha generado *para* ese momento específico, no *para* un usuario genérico promedio que no existe.\n\n#\n\n#\n\n# Conclusión para System Builders\n\nDebemos empezar a tratar nuestros componentes no como bloques de Lego estáticos, sino como células capaces de adaptarse. La próxima gran librería de UI no tendrá componentes, tendrá **comportamientos**.\n\n---\n\n#\n\n#\n\n#\n\n# Auditoría de Madurez de Diseño\n¿Te interesa implementar estos patrones en tu producto? Ofrezco un workshop intensivo para equipos de ingeniería y diseño donde construimos un \"Motor de UI\" básico desde cero, conectando Tokens de Diseño con APIs de OpenAI.\n\n[<i class=\"ph ph-arrow-right\"></i> Reservar Workshop In-House](mailto:me@joanarbo.com?subject=Workshop%20UI%20Generativa)",
      "tags": [
        "IA Generativa",
        "LLM",
        "UX"
      ]
    },
    {
      "id": "semantic-tokens",
      "title": "Semántica Computacional",
      "date": "2026-01-10",
      "status": "active",
      "readTime": "13 min lectura",
      "description": "Cómo los LLMs entienden la intención detrás de un 'Design Token'. Dejando atrás las paletas de colores estáticas para abrazar sistemas de significado fluido y contextual.",
      "content": "En la ingeniería de software tradicional, la semántica es rígida. `const primaryColor = '#0000FF'` es una declaración absoluta. En el diseño de sistemas, hemos intentado imitar esto con \"Design Tokens\" semánticos (`color-action-primary`), pero seguimos dependiendo de que un humano mantenga ese mapa mental.\n\n¿Qué pasa cuando la máquina entiende el concepto de \"Acción\" mejor que el humano?\n\n> **Concepto Visual**\n> Visualización de un espacio vectorial (embedding space). Puntos flotantes conectados. 'Button' está cerca de 'Touch Target' y 'Call to Action', pero lejos de 'Background'. Estilo: Cyberpunk técnico.\n\n#\n\n#\n\n# El Modelo Vectorial de Diseño\n\nLos LLMs (Large Language Models) no ven texto, ven vectores. Números en un espacio multidimensional. Esto significa que podemos codificar nuestros Tokens de Diseño como vectores.\n\nEn lugar de buscar por nombre (`$color-blue-500`), podemos buscar por significado. Si le pregunto al sistema: *\"Dame un color que denote peligro pero que sea legible sobre fondo oscuro\"*, el sistema puede calcular la distancia vectorial y devolver el token óptimo, incluso si nunca le etiquetamos como \"peligro\".\n\n#\n\n#\n\n# Caso de Uso: Migración de Sistemas Legacy\n\nRecientemente ayudé a una Fintech a migrar un monolito de 15 años a un nuevo Design System. Tenían 50 tonos de gris hardcodeados (hex codes).\n\nEn lugar de mapear manualmente, creamos un script de **Búsqueda Semántica**:\n1.  Ingestamos todos los hex codes legacy.\n2.  Ingestamos los nuevos tokens del Design System.\n3.  Calculamos la similitud visual (Delta-E) y semántica (uso en el DOM).\n\nEl script propuso una migración automática con un 98% de precisión. Lo que hubiera tomado 3 meses a un equipo de 4 diseñadores, tomó 2 tardes de ejecución de script.\n\n#\n\n#\n\n# Hacia una Sintaxis Fluida\n\nEsto abre la puerta a sistemas de diseño fluidos. Imagina escribir CSS así:\n\n```css\n.card {\n  background: @semantic(\"surface suitable for elevated content in dark mode\");\n  border-radius: @semantic(\"smooth corner consistent with brand playfulness\");\n}\n```\n\nEl compilador (AI) resuelve esos valores al token más apropiado en tiempo de build. Si el branding cambia, la semántica se mantiene, pero la resolución de tokens se actualiza automáticamente.\n\n#\n\n#\n\n# Conclusión\n\nLa semántica computacional nos permite escalar la consistencia sin escalar la burocracia. Dejamos de ser bibliotecarios de variables para ser curadores de significado.\n\n---\n\n#\n\n#\n\n#\n\n# Auditoría de Design Tokens\n¿Tu sistema de tokens es un caos inmanejable? Realizo una **Auditoría Semántica y Vectorial** de tu taxonomía actual para identificar redundancias, inconsistencias y oportunidades de automatización.\n\n[<i class=\"ph ph-arrow-right\"></i> Solicitar Auditoría de Tokens](mailto:me@joanarbo.com?subject=Auditoría%20Design%20Tokens)",
      "tags": [
        "Sistemas",
        "Lógica",
        "NLP"
      ]
    },
    {
      "id": "design-agents",
      "title": "Agentes de Diseño Autónomos",
      "date": "2026-01-08",
      "status": "active",
      "readTime": "14 min lectura",
      "description": "Automatizando la burocracia creativa. Cómo delegar tareas de Design Ops (naming, linting, documentación) a agentes autónomos para liberar a los humanos.",
      "content": "El trabajo de un Product Designer moderno es 20% creatividad y 80% gestión de archivos. Renombrar capas en Figma, verificar contrastes WCAG, actualizar estados de Jira, documentar props de componentes... Es el \"trabajo de conserje\" digital.\n\nSi aplicamos la teoría de Agentes Autónomos, podemos externalizar casi toda esta carga cognitiva.\n\n> **Concepto Visual**\n> Un 'Bot' amigable (estilo Pixar abstracto) limpiando una interfaz desordenada. Organizando capas, alineando píxeles. Metáfora de 'Roomba para Figma'.\n\n#\n\n#\n\n# Anatomía de un Agente de Diseño\n\nUn agente requiere tres cosas:\n1.  **Percepción**: Capacidad de leer el archivo (Figma API).\n2.  **Cerebro**: Capacidad de razonar sobre lo leído (GPT-4 / Claude 3).\n3.  **Acción**: Capacidad de modificar el archivo (Write Access).\n\n#\n\n#\n\n# Experimento: El \"Linter\" que se arregla solo\n\nConstruí un plugin de Figma privado llamado \"Janitor\".\n*   **Trigger**: Cada vez que un diseñador cierra una página.\n*   **Acción**: Janitor escanea la jerarquía de capas.\n*   **Razonamiento**: Si encuentra un \"Frame 1232\" que contiene un botón y un input, deduce que es un formulario.\n*   **Ejecución**: Renombra el frame a \"LoginForm_Component\", aplica Auto-Layout y verifica que los colores usen variables locales.\n\nEl resultado no es perfecto, pero es mejor que el caos. Elimina la fricción de \"limpiar la casa\" antes de invitar a los desarrolladores.\n\n#\n\n#\n\n# Design Ops 2.0: De Policía a Jardinero\n\nTradicionalmente, Design Ops actuaba como policía: \"¡No usaste el componente correcto!\". Con agentes, Design Ops se convierte en jardinería automática. El sistema se poda y se riega a sí mismo.\n\nEsto cambia la economía del equipo de diseño. Ya no necesitas un \"Junior\" para ordenar archivos. Necesitas Seniors que sepan configurar las reglas de los agentes.\n\n#\n\n#\n\n# Riesgos y Ética\n\nLa automatización excesiva puede llevar a la atrofia de habilidades básicas. Si nunca ordenas tus capas, ¿olvidas cómo estructurar mentalmente un diseño? Es posible. Pero prefiero reservar mi energía mental para resolver problemas de usuario, no problemas de software.\n\n---\n\n#\n\n#\n\n#\n\n# Automatización de Design Ops\n¿Tu equipo pierde horas en tareas repetitivas en Figma/Jira? Ayudo a implementar **pipelines de automatización y agentes personalizados** para tu flujo de trabajo de diseño.\n\n[<i class=\"ph ph-arrow-right\"></i> Automatizar mi Design Ops](mailto:me@joanarbo.com?subject=DesignOps%20Automation)",
      "tags": [
        "Agentes",
        "Ops",
        "Automatización"
      ]
    }
  ],
  "talks": [
    {
      "id": "masterclass-stories",
      "title": "El mundo diseño está hecho de historias",
      "event": "Mr Marcel School",
      "date": "Masterclass",
      "image": "https://placehold.co/600x400/1e1e1e/FFF?text=Masterclass+Stories",
      "videoUrl": "https://youtu.be/eGj9ZZ3Lj2k",
      "description": "Una reinterpretación del Atomic Design: el mundo no está hecho de átomos, sino de historias que los usuarios recorren.",
      "tags": [
        "Atomic Design",
        "Storytelling"
      ]
    },
    {
      "id": "haikus-tokens",
      "title": "Haikus y tokens",
      "event": "Mr Marcel School",
      "date": "Masterclass",
      "image": "https://placehold.co/600x400/1e1e1e/FFF?text=Haikus+Tokens",
      "videoUrl": "https://youtu.be/6NuKWcpw4Ws",
      "description": "Combinando la brevedad del Haiku con la precisión de los Design Tokens para crear lenguajes visuales semánticos.",
      "tags": [
        "Design Tokens",
        "Semántica"
      ]
    }
  ],
  "projects": [
    {
      "id": "alexa-shopping-ds",
      "title": "Conversational Design System",
      "role": "Design Technologist Manager",
      "company": "Alexa Shopping (Amazon)",
      "impact": "Lanzamiento Q3 2022",
      "description": "Lideré la creación del primer sistema de diseño conversacional del mundo para dispositivos Echo y FireTV. Reduje un 80% el tiempo de creación de componentes mediante la automatización y el uso estratégico de Design Tokens.",
      "tags": [
        "Voice UI",
        "APL",
        "AI Strategy"
      ],
      "image": "assets/images/projects/alexa-shopping-ds.png",
      "architecture": "graph TD\n    A[Voice Intent] --> B[Conversational Model]\n    B --> C[Design System Tokens]\n    C --> D[Multi-modal Response]\n    D --> E[Echo Devices]"
    },
    {
      "id": "amazon-telescope",
      "title": "Amazon Telescope",
      "role": "Sr Design Technologist",
      "company": "Amazon Business",
      "impact": "-50% Tiempo de Prototipado",
      "description": "Desarrollé una herramienta interna de prototipado 'lean' basada íntegramente en código, eliminando la dependencia de Figma para validaciones de alta fidelidad. Los prototipos finales eran indistinguibles de la producción.",
      "tags": [
        "Prototyping",
        "React",
        "Research Tooling"
      ],
      "image": "assets/images/projects/amazon-telescope.png",
      "architecture": "flowchart LR\n    F[Figma Design] --> T[Telescope UI]\n    T --> C[Live Code Environment]\n    C --> P[Stakeholder Test]"
    },
    {
      "id": "ink-design-system",
      "title": "Estrategia Ink Design System",
      "role": "Senior UX Engineer",
      "company": "Amazon Business",
      "impact": "Escalabilidad Global",
      "description": "Redefiní el modelo de integración entre diseño y desarrollo para el sistema Ink, superando barreras de adopción en equipos de +50 ingenieros y optimizando la calidad del frontend mediante el uso de Storybook y Testing de Regresión Visual.",
      "tags": [
        "Design Ops",
        "Adopción",
        "Scale"
      ],
      "image": "assets/images/projects/ink-design-system.png",
      "architecture": "sequenceDiagram\n    UX->>Storybook: Valida Componentes\n    Storybook->>Dev: Implementación Backend\n    Dev->>Production: Lanzamiento Unificado"
    }
  ],
  "experience": [
    {
      "period": "Jun 2017 — Present",
      "company": "Amazon Madrid",
      "role": "Senior Design Technologist",
      "description": "Lead UX Engineer en Madrid y Hyderabad. Actuando como puente crítico entre ingeniería y diseño. Ganador doble de 'Most Peculiar Amazonian' por Ownership e Invent & Simplify. Lideré el lanzamiento de Amazon Business Prime entregando un mes antes de lo previsto y optimizando la eficiencia operativa significativamente mediante la creación de frameworks intern de prototipado rápido."
    },
    {
      "period": "Jan 2021 — Present",
      "company": "Mr Marcel School / UOC",
      "role": "Profesor de Design Systems",
      "description": "Director y mentor en el nanogrado de Design Systems. He formado a más de 200 profesionales de product engineering en la sistematización de productos digitales, arquitecturas de tokens y escalabilidad de interfaces."
    },
    {
      "period": "Jun 2010 — Jun 2017",
      "company": "Movistar+ TV",
      "role": "Research & Development",
      "description": "Diseño de sistemas complejos para STB, Web y Apps. Lideré el diseño de interacción para más de 300 campañas globales de alto impacto. Desarrollé prototipos experimentales en 2D/3D que definieron el futuro del consumo de TV interactiva en España."
    },
    {
      "period": "Feb 2016 — Jun 2017",
      "company": "CoworkingIT.co",
      "role": "Co-Founder & Product Designer",
      "description": "Definición de estrategia de producto y creación/codificación del Design System completo de la plataforma bajo metodologías Agile."
    },
    {
      "period": "Sep 2013 — Apr 2014",
      "company": "CESMA Business School",
      "role": "Profesor",
      "description": "Docente en el Grado de Marketing Digital."
    },
    {
      "period": "Jun 2008 — Jun 2009",
      "company": "NicePeopleAtWork",
      "role": "JS/ActionScript Developer",
      "description": "Desarrollo de reproductores de video de alta calidad con funcionalidades avanzadas (slow motion, pseudo-streaming, zoom)."
    },
    {
      "period": "Aug 2007 — May 2008",
      "company": "Sclipo",
      "role": "JS/ActionScript Developer",
      "description": "Startup de eLearning. Responsable de la programación de todos los reproductores de video de la plataforma."
    },
    {
      "period": "2000 — 2006",
      "company": "Universidad La Salle Barcelona",
      "role": "Ingeniero Multimedia",
      "description": "Formación técnica y creativa en el desarrollo de sistemas multimedia, interactividad y experiencias digitales."
    }
  ],
  "principles": [
    {
      "title": "Interfaces de Intención",
      "content": "Avanzar hacia experiencias naturales donde la interacción es efímera y se alinea con nuestra forma humana de comunicar."
    },
    {
      "title": "El Código es la Verdad",
      "content": "Si no está en la web (en el código funcional), no existe. El diseño es una promesa; el código es la entrega."
    },
    {
      "title": "Diseño Proactivo",
      "content": "Los sistemas no deben ser bibliotecas estáticas, sino ecosistemas que anticipan necesidades y facilitan la toma de decisiones."
    },
    {
      "title": "Impacto sobre Píxeles",
      "content": "Un sistema solo es útil si genera confianza y eficiencia. La adopción es la métrica definitiva del éxito de un Design System."
    }
  ],
  "now": {
    "lastUpdated": "2026-01-15",
    "location": "Madrid, Spain",
    "status": "Building & Teaching",
    "items": [
      {
        "title": "Crafting this Digital Garden",
        "description": "Moving away from static portfolios. Treating this site as a living system where design engineering and AI meet. It's built with vanilla JS and raw data, no frameworks, just craft."
      },
      {
        "title": "Stealth Mode: Redefining Events",
        "description": "Building an independent platform to transform how we experience live gatherings. Crafting bridge between craft, community, and the stage."
      },
      {
        "title": "Exploring Agentic Design Ops",
        "description": "Building private tools to automate the borrowing parts of design management (renaming, linting, handoff) using LLMs."
      }
    ],
    "reading": {
      "title": "The Timeless Way of Building",
      "author": "Christopher Alexander"
    }
  },
  "links": {
    "substack": "https://joanarbo.notion.site/?pvs=74",
    "linkedin": "https://www.linkedin.com/in/joanarbo/",
    "email": "me@joanarbo.com"
  },
  "testimonials": [
    {
      "name": "Alex Rivera",
      "role": "CTO / StartUp Co-founder",
      "content": "Joan no solo construye interfaces; construye sistemas que permiten a los equipos moverse 10 veces más rápido. Su visión de la IA es estratégica, no solo cosmética.",
      "tags": [
        "Engineering",
        "Leadership",
        "AI",
        "Systems"
      ]
    },
    {
      "name": "Sarah Chen",
      "role": "Design Manager",
      "content": "Finding the sweet spot between creativity and maintainability is hard. Joan lives there. The design systems he builds actually get used.",
      "tags": [
        "Design Systems",
        "UI/UX",
        "Product"
      ]
    },
    {
      "name": "David Miller",
      "role": "Senior Engineer",
      "content": "Rare to find someone who cares as much about code quality as pixel perfection. Debugging with Joan is a masterclass in systems thinking.",
      "tags": [
        "Engineering",
        "Career",
        "Lógica"
      ]
    }
  ],
  "playground": [
    {
      "id": "css-grid-experiments",
      "title": "CSS Grid Layout Patterns",
      "description": "Explorations in complex magazine-style layouts using CSS Grid and Subgrid.",
      "type": "CodePen",
      "url": "https://codepen.io/joanarbo/pen/Exxxxx",
      "image": "assets/images/playground/grid.png"
    },
    {
      "id": "generative-typography",
      "title": "Generative Typography",
      "description": "Canvas-based kinetic typography experiments reacting to mouse movement.",
      "type": "Canvas",
      "url": "#",
      "image": "assets/images/playground/typo.png"
    },
    {
      "id": "micro-interactions",
      "title": "Button Micro-interactions",
      "description": "A collection of subtle, state-based animations for design system components.",
      "type": "UI Kit",
      "url": "#",
      "image": "assets/images/playground/ui.png"
    }
  ],
  "services": [
    {
      "id": "design-system-audit",
      "icon": "ph-blueprint",
      "title": "Design System Audit & Strategy",
      "description": "Un análisis técnico integral diseñado para eliminar la fricción entre Figma y Código. Evaluamos la arquitectura de tus componentes, la escalabilidad de tus design tokens y la eficacia de tu documentación. El resultado es un roadmap estratégico para transformar tu Design System de una biblioteca estática a un acelerador de producto.",
      "price": "A partir de €2.500",
      "features": [
        "Component API & Slotting Strategy Review",
        "Semantic Design Tokens Architecture Audit",
        "Documentation Health (Storybook / Zeroheight)",
        "Accessibility (WCAG 2.1) & HTML Semantic Audit",
        "Handoff Workflow & Contribution Model Analysis",
        "Actionable Prioritized Roadmap Report"
      ],
      "cta": "Reservar Auditoría"
    },
    {
      "id": "fractional-staff-engineer",
      "icon": "ph-user-focus",
      "title": "Fractional Staff Engineer",
      "description": "Liderazgo técnico estratégico para startups y empresas en fases críticas de entrega. Ideal para equipos que acaban de recibir un Design System y necesitan asegurar su adopción, o para startups que requieren una visión arquitectónica senior sin el coste de un perfil C-level a tiempo completo.",
      "price": "Retainer a medida",
      "features": [
        "Architecture Review Board & Tech Strategy",
        "Mentorship & Coaching para Senior Engineers",
        "Acompañamiento en migraciones complejas",
        "Implementación de Design Ops & AI Workflows",
        "Aseguramiento de Calidad y Rendimiento",
        "Definición de Roadmaps de Ingeniería"
      ],
      "cta": "Consultar Disponibilidad"
    },
    {
      "id": "modern-project-launch",
      "icon": "ph-rocket-launch",
      "title": "Modern Digital Launch",
      "description": "Cómo arrancar un proyecto digital a día de hoy. Dejamos atrás los procesos lentos y pesados para adoptar un enfoque de 'Engineering-First' potenciado por IA. Te ayudo a definir el stack mínimo viable, la arquitectura de producto y los workflows de desarrollo para pasar de la idea al código funcional en tiempo récord.",
      "price": "Bajo consulta",
      "features": [
        "Definición de Stack Tecnológico Moderno",
        "Estrategia de MVP & Time-to-Market",
        "Workflows de Co-creación con IA (Cursor/Claude)",
        "Arquitectura Escalable desde el Día 1",
        "Setup de Entornos de Desarrollo Rápido",
        "Mentoría de Producto y Tecnología"
      ],
      "cta": "Empezar Proyecto"
    }
  ],
  "stack": {
    "software": [
      {
        "name": "Cursor + Antigravity",
        "desc": "AI-first code editor. My daily driver."
      },
      {
        "name": "Warp",
        "desc": "Gemini y perplexity para exploracion y notebook llm"
      },
      {
        "name": "Figma",
        "desc": "Where design systems begin."
      },
      {
        "name": "Notion",
        "desc": "Second brain and OS."
      }
    ],
    "analog": [
      {
        "name": "Leuchtturm1917",
        "desc": "Dotted A5. Daily bullet journaling."
      },
      {
        "name": "Rotring 600",
        "desc": "Drafting pencil. German engineering."
      },
      {
        "name": "Field Notes",
        "desc": "For quick capture on the go."
      }
    ]
  },
  "caseStudies": [
    {
      "id": "alexa-shopping-ds",
      "title": "Alexa Shopping Design System",
      "company": "Amazon",
      "year": "2020-2022",
      "role": "Lead Product Engineer",
      "challenge": "Fragmented UI across 15+ Alexa shopping experiences led to inconsistent user experiences and 60% longer development cycles",
      "solution": "Built unified design system with 50+ multimodal components supporting voice, visual, and touch interactions",
      "impact": {
        "adoption": "100%",
        "adoptionLabel": "Alexa Shopping Adoption",
        "efficiency": "60%",
        "efficiencyLabel": "Dev Time Reduction",
        "consistency": "95%",
        "consistencyLabel": "Design Consistency"
      },
      "technologies": [
        "React",
        "TypeScript",
        "Design Tokens",
        "Storybook",
        "Voice UI"
      ],
      "image": "assets/images/case-studies/alexa-ds.png",
      "link": "#alexa-shopping-ds"
    },
    {
      "id": "amazon-telescope",
      "title": "Amazon Telescope Analytics Platform",
      "company": "Amazon",
      "year": "2021-2022",
      "role": "Senior Product Engineer",
      "challenge": "Product teams lacked real-time visibility into design system adoption and component usage patterns",
      "solution": "Developed automated analytics platform tracking component usage, adoption metrics, and consistency scores across all products",
      "impact": {
        "adoption": "40+",
        "adoptionLabel": "Teams Tracked",
        "efficiency": "80%",
        "efficiencyLabel": "Faster Issue Detection",
        "consistency": "€200K",
        "consistencyLabel": "Annual Savings"
      },
      "technologies": [
        "Python",
        "AWS",
        "Data Visualization",
        "Analytics"
      ],
      "image": "assets/images/case-studies/telescope.png",
      "link": "#amazon-telescope"
    },
    {
      "id": "ink-design-system",
      "title": "Ink Design System",
      "company": "Substack",
      "year": "2023-2024",
      "role": "Staff Product Engineer",
      "challenge": "Rapid growth required scalable design system supporting millions of creators while maintaining editorial quality",
      "solution": "Architected premium design system with focus on typography, reading experience, and creator tools",
      "impact": {
        "adoption": "2M+",
        "adoptionLabel": "Creators Impacted",
        "efficiency": "45%",
        "efficiencyLabel": "Faster Feature Delivery",
        "consistency": "98%",
        "consistencyLabel": "Brand Consistency"
      },
      "technologies": [
        "React",
        "TypeScript",
        "CSS-in-JS",
        "Editorial Design"
      ],
      "image": "assets/images/case-studies/ink-ds.png",
      "link": "#ink-design-system"
    }
  ]
}