{
  "posts": [
    {
      "id": 1,
      "title": "Arquitectura de Sistemas de Diseño con IA",
      "date": "2026-01-12",
      "readTime": "8 min de lectura",
      "tags": [
        "Diseño IA",
        "Sistemas",
        "Arquitectura"
      ],
      "image": "./assets/blog_post_placeholder_1.png",
      "description": "Explorando cómo los Modelos de Lenguaje transforman los Design Systems de repositorios estáticos a ecosistemas vivos y proactivos.",
      "content": "La intersección entre la inteligencia artificial y los sistemas de diseño abre un nuevo paradigma en el desarrollo de software. Ya no hablamos solo de bibliotecas de componentes estáticos; estamos entrando en la era de los *Sistemas Proactivos*.\n\n### El Colapso de la Distancia entre Diseño y Código\n\nTradicionalmente, el 'handoff' ha sido la frontera más difícil de cruzar. Con la integración de agentes de IA en el flujo de trabajo, esta frontera desaparece. El código se convierte en una extensión directa del pensamiento de diseño, y viceversa.\n\n#### Pilares de la nueva arquitectura:\n1. **Tokens Dinámicos**: Variables que no solo almacenan valores, sino contextos de uso y reglas de accesibilidad autogeneradas.\n2. **Ecosistemas de Feedback**: Sistemas que analizan el uso de los componentes en producción y sugieren optimizaciones de legibilidad o performance.\n3. **Generación Just-in-Time**: Componentes que se adaptan a la necesidad del usuario final, manteniendo la coherencia de marca pero optimizando la función.\n\nEste es solo el comienzo. El futuro del diseño es generativo, y la arquitectura que construimos hoy debe estar lista para ser co-creada con máquinas inteligentes."
    },
    {
      "id": 2,
      "title": "Manifiesto del Prompt: Ingeniería de Diálogo",
      "date": "2026-01-08",
      "readTime": "6 min de lectura",
      "tags": [
        "IA",
        "Creatividad",
        "Ingeniería"
      ],
      "image": "./assets/blog_post_placeholder_2.png",
      "description": "Técnicas avanzadas para diseñadores de producto que buscan dominar los modelos fundacionales a través de la semántica.",
      "content": "Escribir un prompt no es dar una instrucción; es diseñar una arquitectura de pensamiento para una inteligencia externa. Para el diseñador de producto moderno, la palabra es ahora una herramienta de renderizado.\n\n### Más allá del 'Chat'\n\nEl error común es tratar a los modelos de lenguaje como buscadores. Son, en realidad, motores de razonamiento estadístico. Dominarlos requiere entender conceptos como:\n\n*   **Chain-of-Thought**: Forzar al modelo a verbalizar sus pasos lógicos antes de emitir un resultado.\n*   **Few-Shot Prompting**: Proporcionar ejemplos estructurales para que el modelo entienda el 'tono de voz' o la 'jerarquía visual' que buscamos.\n*   **Delimitadores Estructurales**: Usar sintaxis clara para separar el contexto de la tarea.\n\nCuando un diseñador domina estas técnicas, su flujo de trabajo se acelera exponencialmente, permitiéndole enfocarse en la estrategia y la visión artística."
    },
    {
      "id": 3,
      "title": "Workflows en Notion: Tu Segundo Cerebro",
      "date": "2025-12-28",
      "readTime": "10 min de lectura",
      "tags": [
        "Notion",
        "Productividad",
        "Flujo de Trabajo"
      ],
      "image": "./assets/blog_post_placeholder_3.png",
      "description": "Cómo estructurar un espacio de trabajo que potencie la creatividad mediante bases de datos relacionales y lógica de sistemas.",
      "content": "Notion ha evolucionado de ser una simple aplicación de notas a convertirse en un 'SRE' (Site Reliability Engine) personal. El secreto no está en las páginas, sino en la lógica subyacente de sus bases de datos.\n\n### La Metodología de Sistemas\n\nPara que un espacio en Notion sea efectivo, debe seguir principios de ingeniería de software:\n\n1. **Atomización**: Información guardada en el nivel más pequeño posible.\n2. **Normalización**: Evitar la duplicidad de datos mediante relaciones inteligentes.\n3. **Visualización**: Múltiples vistas para un mismo dato dependiendo del contexto de trabajo (Kanban para ejecución, Gallery para inspiración).\n\nHe diseñado mi propio framework que integra mis lecturas, mis proyectos de código y mis sistemas de diseño en un único ecosistema coherente que se actualiza automáticamente."
    }
  ],
  "ideas": [
    {
      "id": "hybrid-engineer",
      "title": "El Colapso de las Especialidades",
      "date": "2026-01-14",
      "readTime": "6 min lectura",
      "description": "Una reflexión sobre la muerte del rol binario. El futuro pertenece al 'Full-Stack Designer' que no solo define la visión, sino que programa la infraestructura que la soporta.",
      "content": "La distinción entre \"Diseñador\" e \"Ingeniero\" es un artefacto de la era industrial del software. En un mundo donde la IA genera código UI semánticamente correcto, el valor se desplaza de la *producción* de artefactos (mockups, specs) a la *definición* de sistemas.\n\n[Concepto Visual: Un diagrama de Venn donde los círculos 'Diseño' y 'Ingeniería' se superponen casi totalmente, etiquetados como 'System Logic' en el centro. Estilo Bauhaus minimalista.]\n\n### La Falacia del Handoff\n\nTradicionalmente operamos bajo el modelo de \"Línea de Ensamblaje\":\n1. Diseño define la \"apariencia\" (Figma).\n2. Ingeniería define la \"función\" (React/DOM).\n\nEste modelo está roto. El \"Full-Stack Designer\" (o UX Engineer) no es alguien que hace mal dos cosas. Es el arquitecto que entiende que el **Token en Figma** y la **Prop en React** son la misma entidad ontológica.\n\n> \"Si no puedes manipular el medio final (el código), estás diseñando ficciones.\"\n\n### El Nuevo Rol: Arquitecto de Sistemas\n\nLas empresas top (Google, Amazon, Uber) ya no buscan \"UI Designers\" que entreguen PNGs. Buscan perfiles híbridos capaces de:\n- Escribir lógica de renderizado condicional.\n- Definir APIs de componentes.\n- Auditar el impacto en performance de sus decisiones visuales.\n\nLa nueva 'especialidad' no es una herramienta, es la **Integridad Sistémica**: la capacidad de orquestar la experiencia de usuario desde la intención estratégica hasta el último renderizado en el DOM.\n\n---\n\n#### 🚀 Auditoría de Sistemas de Diseño\n¿Tu equipo sigue atrapado en discusiones infinitas de handoff? **Audito la arquitectura de diseño y código de tu empresa** para eliminar la fricción entre diseño e ingeniería. Transformo equipos fragmentados en unidades de producto sistémicas.\n[Contactar para Auditoría](mailto:me@joanarbo.com?subject=Auditoría%20Sistémica)",
      "tags": [
        "Filosofía",
        "Carrera",
        "Estrategia"
      ],
      "status": "active"
    },
    {
      "id": "ai-components-ex",
      "title": "Interfaces de Intención",
      "date": "2026-01-12",
      "readTime": "5 min lectura",
      "description": "Experimentos en UI generativa donde el usuario describe un objetivo sistémico y el motor renderiza la solución optimizada, validando accesibilidad y performance en tiempo real.",
      "content": "Estamos atrapados en el paradigma imperativo: \"Pinta un botón azul aquí\". La IA Generativa nos permite movernos hacia un diseño declarativo: \"Necesito una forma de que el usuario confirme esta acción crítica\".\n\n[Concepto Visual: Un esquema de flujo de datos. Input: 'Usuario quiere borrar cuenta'. Black Box: 'AI Layout Engine'. Output: 'Modal de confirmación con focus trap y variante danger'.]\n\n### De Píxeles a Reglas\n\nEl Sistema de Diseño del futuro no es una librería de componentes estáticos, sino un motor de decisiones (Decision Engine) impulsado por LLMs.\n\nEl sistema debe decidir en tiempo de ejecución (Runtime) si esa confirmación se manifiesta como un **Modal**, un **Toast** o un **Inline Expansion** basado en:\n- **El contexto del usuario**: ¿Está en móvil caminando? (Botones grandes, zona inferior).\n- **La carga cognitiva actual**: ¿Hay ya 3 modales abiertos?\n- **Capacidades del dispositivo**: ¿Soporta animaciones complejas?\n\n### Renderizado Semántico\n\nNo diseñamos pantallas. Diseñamos **reglas de renderizado**. El motor de UI ingiere \"Intención\" y escupe \"Interfaz\", validada por WCAG 2.2 y optimizada para Core Web Vitals en tiempo real. Esto no es ciencia ficción; es la evolución natural de React Server Components combinados con inferencia en el borde (Edge AI).\n\n---\n\n#### 🛠 Consultoría de UI Generativa\nAyudo a empresas visionarias a preparar sus Sistemas de Diseño para la era de la IA. Evaluamos si tu arquitectura de componentes es compatible con generación dinámica y automatización.\n[Solicitar Diagnóstico](mailto:me@joanarbo.com?subject=Consultoría%20UI%20Generativa)",
      "tags": [
        "IA Generativa",
        "LLM",
        "UX"
      ],
      "status": "active"
    },
    {
      "id": "design-tokens-v2",
      "title": "Semántica Computacional",
      "date": "2026-01-10",
      "readTime": "7 min lectura",
      "description": "Propuesta para una capa de abstracción sobre los Design Tokens que permita a modelos de IA razonar sobre la jerarquía visual y la intención de marca sin intervención humana.",
      "content": "Los Design Tokens actuales (W3C Draft) son diccionarios de estilos planos. `blue-500: #00AABB`. Esto es insuficiente para la Inteligencia Artificial. Necesitamos una capa semántica superior. `action-primary-hover` no es solo un color; es un estado interactivo con affordance crítica.\n\n[Concepto Visual: Un trozo de código JSON resaltado con sintaxis, flotando sobre una estructura alámbrica 3D de una interfaz. El código ilumina partes específicas de la UI.]\n\n### La Ontología del Diseño\n\nPara que un LLM (como GPT-4 o Claude) \"entienda\" tu marca, no basta con darle un archivo CSS. Propongo una estructura de datos oncológica donde los tokens lleven metadatos de propósito:\n\n```json\nToken {\n  value: #FFF,\n  role: \"surface\",\n  intent: \"neutral\",\n  context_rules: [\"dark-mode-aware\", \"high-contrast-safe\"],\n  accessibility: { \n    contrast_ratio_against_text: 4.5 \n  }\n}\n```\n\n### Por qué importa para el SEO y la Estructura\n\nCuando estructuramos el diseño así, no solo facilitamos la IA, facilitamos la accesibilidad y el SEO técnico. Los motores de búsqueda entienden mejor la jerarquía de una página construida semánticamente.\n\nCuando un LLM lee esto, no ve colores hexadecimales. Ve **jerarquía**. Ve **lógica de negocio**. Esto permite a los modelos de IA razonar sobre \"Contraste\" o \"Énfasis\" sin intervención humana, generando interfaces que son correctas por construcción y fieles a la marca.\n\n---\n\n#### 📐 Auditoría de Design Tokens\n¿Tu sistema de tokens es un caos inmanejable? Organizo y estructuro tu arquitectura de tokens para que sea escalable, mantenible y preparada para el futuro de la IA.\n[Auditar mis Tokens](mailto:me@joanarbo.com?subject=Auditoría%20Tokens)",
      "tags": [
        "Sistemas",
        "Lógica",
        "Arquitectura"
      ],
      "status": "concept"
    },
    {
      "id": "design-agents",
      "title": "Agentes de Diseño Autónomos",
      "date": "2026-01-08",
      "readTime": "4 min lectura",
      "description": "Sistemas que monitorizan el uso de los componentes en producción y proponen refactorizaciones automáticas para mejorar la consistencia visual y el rendimiento del bundle.",
      "content": "El Design System promedio se pudre desde el día 1 tras su lanzamiento. Reglas CSS muertas (dead code), componentes deprecados que nadie borra, inconsistencias de espaciado que se acumulan como deuda técnica silenciosa.\n\nLa solución no es más disciplina humana. Los humanos somos malos manteniendo consistencia a escala. La solución son **Agentes Autónomos**.\n\n[Concepto Visual: Un dashboard de terminal futurista mostrando 'System Health: 98%'. Logs de actividad mostrando 'Auto-refactor component ButtonGhost... Success'.]\n\n### Auto-Curación (Self-Healing Design Systems)\n\nImagine un pipeline de CI/CD (Integración Continua) donde:\n\n1. **Agente Guardián**: Bloquea Pull Requests que introducen valores hexadecimales *hardcodeados* en lugar de tokens.\n2. **Agente Jardinero**: Monitoriza el bundle de producción. \"¿Este botón secundario variante 'ghost' se usa solo en el 0.01% de las sesiones? Proponiendo refactorización a enlace de texto simple para ahorrar 5kb\".\n3. **Agente de Accesibilidad**: Audita cada deploy contra las reglas WCAG y genera *issues* automáticos en Jira.\n\nEl mantenimiento manual es insostenible en empresas grandes. El futuro es **Pruning automático**. Consistencia forzada por código. El Diseño se mantiene a sí mismo.\n\n---\n\n#### 🛡 Implementación de Design Ops\nAyudo a organizaciones a automatizar sus operaciones de diseño (DesignOps). Desde linters de estilo hasta pipelines de integración continua para sistemas de diseño.\n[Escalar mi Design System](mailto:me@joanarbo.com?subject=Consultoría%20DesignOps)",
      "tags": [
        "Agentes",
        "Automatización",
        "Ops"
      ],
      "status": "active"
    }
  ],
  "talks": [
    {
      "id": "masterclass-stories",
      "title": "El mundo diseño está hecho de historias",
      "event": "Mr Marcel School",
      "date": "Masterclass",
      "image": "https://placehold.co/600x400/1e1e1e/FFF?text=Masterclass+Stories",
      "videoUrl": "https://youtu.be/eGj9ZZ3Lj2k",
      "description": "Una reinterpretación del Atomic Design: el mundo no está hecho de átomos, sino de historias que los usuarios recorren.",
      "tags": [
        "Atomic Design",
        "Storytelling"
      ]
    },
    {
      "id": "haikus-tokens",
      "title": "Haikus y tokens",
      "event": "Mr Marcel School",
      "date": "Masterclass",
      "image": "https://placehold.co/600x400/1e1e1e/FFF?text=Haikus+Tokens",
      "videoUrl": "https://youtu.be/6NuKWcpw4Ws",
      "description": "Combinando la brevedad del Haiku con la precisión de los Design Tokens para crear lenguajes visuales semánticos.",
      "tags": [
        "Design Tokens",
        "Semántica"
      ]
    }
  ],
  "projects": [
    {
      "id": "alexa-shopping-ds",
      "title": "Conversational Design System",
      "role": "Design Technologist Manager",
      "company": "Alexa Shopping (Amazon)",
      "impact": "Lanzamiento Q3 2022",
      "description": "Lideré la creación del primer sistema de diseño conversacional del mundo para dispositivos Echo y FireTV. Reduje un 80% el tiempo de creación de componentes mediante la automatización y el uso estratégico de Design Tokens.",
      "tags": [
        "Voice UI",
        "APL",
        "AI Strategy"
      ],
      "image": "/Users/joanarbo/.gemini/antigravity/brain/36620de0-0b84-4ae2-aaf7-b003b414fa8a/alexa_conversational_ds_substack_1768409773451.png",
      "architecture": "graph TD\n    A[Voice Intent] --> B[Conversational Model]\n    B --> C[Design System Tokens]\n    C --> D[Multi-modal Response]\n    D --> E[Echo Devices]"
    },
    {
      "id": "amazon-telescope",
      "title": "Amazon Telescope",
      "role": "Sr Design Technologist",
      "company": "Amazon Business",
      "impact": "-50% Tiempo de Prototipado",
      "description": "Desarrollé una herramienta interna de prototipado 'lean' basada íntegramente en código, eliminando la dependencia de Figma para validaciones de alta fidelidad. Los prototipos finales eran indistinguibles de la producción.",
      "tags": [
        "Prototyping",
        "React",
        "Research Tooling"
      ],
      "image": "/Users/joanarbo/.gemini/antigravity/brain/36620de0-0b84-4ae2-aaf7-b003b414fa8a/amazon_telescope_substack_1768409790038.png",
      "architecture": "flowchart LR\n    F[Figma Design] --> T[Telescope UI]\n    T --> C[Live Code Environment]\n    C --> P[Stakeholder Test]"
    },
    {
      "id": "ink-design-system",
      "title": "Estrategia Ink Design System",
      "role": "Senior UX Engineer",
      "company": "Amazon Business",
      "impact": "Escalabilidad Global",
      "description": "Redefiní el modelo de integración entre diseño y desarrollo para el sistema Ink, superando barreras de adopción en equipos de +50 ingenieros y optimizando la calidad del frontend mediante el uso de Storybook y Testing de Regresión Visual.",
      "tags": [
        "Design Ops",
        "Adopción",
        "Scale"
      ],
      "image": "/Users/joanarbo/.gemini/antigravity/brain/36620de0-0b84-4ae2-aaf7-b003b414fa8a/ink_design_system_substack_1768409802855.png",
      "architecture": "sequenceDiagram\n    UX->>Storybook: Valida Componentes\n    Storybook->>Dev: Implementación Backend\n    Dev->>Production: Lanzamiento Unificado"
    }
  ],
  "experience": [
    {
      "period": "Jun 2017 — Present",
      "company": "Amazon Madrid",
      "role": "Senior Design Technologist",
      "description": "Lead UX Engineer en Madrid y Hyderabad. Actuando como puente crítico entre ingeniería y diseño. Ganador doble de 'Most Peculiar Amazonian' por Ownership e Invent & Simplify. Lideré el lanzamiento de Amazon Business Prime entregando un mes antes de lo previsto y optimizando la eficiencia operativa significativamente mediante la creación de frameworks intern de prototipado rápido."
    },
    {
      "period": "Jan 2021 — Present",
      "company": "Mr Marcel School / UOC",
      "role": "Profesor de Design Systems",
      "description": "Director y mentor en el nanogrado de Design Systems. He formado a más de 200 profesionales de product engineering en la sistematización de productos digitales, arquitecturas de tokens y escalabilidad de interfaces."
    },
    {
      "period": "Jun 2010 — Jun 2017",
      "company": "Movistar+ TV",
      "role": "Research & Development",
      "description": "Diseño de sistemas complejos para STB, Web y Apps. Lideré el diseño de interacción para más de 300 campañas globales de alto impacto. Desarrollé prototipos experimentales en 2D/3D que definieron el futuro del consumo de TV interactiva en España."
    },
    {
      "period": "Feb 2016 — Jun 2017",
      "company": "CoworkingIT.co",
      "role": "Co-Founder & Product Designer",
      "description": "Definición de estrategia de producto y creación/codificación del Design System completo de la plataforma bajo metodologías Agile."
    },
    {
      "period": "Sep 2013 — Apr 2014",
      "company": "CESMA Business School",
      "role": "Profesor",
      "description": "Docente en el Grado de Marketing Digital."
    },
    {
      "period": "Jun 2008 — Jun 2009",
      "company": "NicePeopleAtWork",
      "role": "JS/ActionScript Developer",
      "description": "Desarrollo de reproductores de video de alta calidad con funcionalidades avanzadas (slow motion, pseudo-streaming, zoom)."
    },
    {
      "period": "Aug 2007 — May 2008",
      "company": "Sclipo",
      "role": "JS/ActionScript Developer",
      "description": "Startup de eLearning. Responsable de la programación de todos los reproductores de video de la plataforma."
    },
    {
      "period": "2000 — 2006",
      "company": "Universidad La Salle Barcelona",
      "role": "Ingeniero Multimedia",
      "description": "Formación técnica y creativa en el desarrollo de sistemas multimedia, interactividad y experiencias digitales."
    }
  ],
  "principles": [
    {
      "title": "Interfaces de Intención",
      "content": "Avanzar hacia experiencias naturales donde la interacción es efímera y se alinea con nuestra forma humana de comunicar."
    },
    {
      "title": "El Código es la Verdad",
      "content": "Si no está en la web (en el código funcional), no existe. El diseño es una promesa; el código es la entrega."
    },
    {
      "title": "Diseño Proactivo",
      "content": "Los sistemas no deben ser bibliotecas estáticas, sino ecosistemas que anticipan necesidades y facilitan la toma de decisiones."
    },
    {
      "title": "Impacto sobre Píxeles",
      "content": "Un sistema solo es útil si genera confianza y eficiencia. La adopción es la métrica definitiva del éxito de un Design System."
    }
  ],
  "links": {
    "substack": "https://joanarbo.notion.site/?pvs=74",
    "linkedin": "https://www.linkedin.com/in/joanarbo/",
    "email": "me@joanarbo.com"
  },
  "testimonials": [
    {
      "name": "Alex Rivera",
      "role": "CTO / StartUp Co-founder",
      "content": "Joan no solo construye interfaces; construye sistemas que permiten a los equipos moverse 10 veces más rápido. Su visión de la IA es estratégica, no solo cosmética."
    },
    {
      "name": "Sarah Chen",
      "role": "Design Manager",
      "content": "The most technical designer I've worked with. He bridges the gap between Figma and Production with surgical precision."
    }
  ]
}