{
  "posts": [
    {
      "id": "perihelion",
      "title": "Perihelio: Encontrando el Estado de Flow en la Era de la Interrupción de la IA",
      "date": "2025-10-28",
      "readTime": "Deep Dive",
      "description": "How to find flow state and deep work in an age of AI interruption. A reflection on creative mastery, design systems, and the craft of subtraction.",
      "content": "<iframe width=\"100%\" height=\"400\" src=\"https://www.youtube.com/embed/7tTCZOHUWFA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\nEn astronomía, el perihelio es el punto en el que un cuerpo celeste se acerca más al Sol. Es el momento de máxima velocidad. Máxima intensidad. Después, se aleja. Pero ese instante -ese único instante- contiene toda la energía acumulada del viaje.\n\nJiro Ono, el legendario maestro de sushi, pasa 70 años buscando su perihelio.\n\nNo lo llama así. Lo llama perfección. Pureza. Pero es lo mismo: ese punto donde todo converge. Donde el detalle, la repetición y el silencio de décadas de artesanía se condensan en un solo gesto.\n\nUn grano de arroz. Un movimiento de cuchillo. Nada más.\n\nTodo.\n\n#\n\n#\n\n# I. Órbita: Entendiendo el Proceso Creativo\n*[0:00 - 1:30: La introducción. Cuerdas suaves, casi inaudibles.]*\n\nCuando diseñas, codificas, creas - estás en órbita.\n\nAlgunos días lejos del centro. Disperso. Saltando entre tareas, herramientas, notificaciones. La distancia te protege. No quema. Pero tampoco avanzas.\n\nOtros días, más cerca. Las horas desaparecen. Olvidas comer. El código fluye. El diseño respira. No piensas en lo que haces; simplemente lo haces.\n\nEs el estado de flujo. Ese estado donde el cerebro libera el control consciente y deja que redes neuronales especializadas -entrenadas durante años- trabajen solas. Sin supervisión. Sin fricción.\n\nPero hay un punto aún más profundo.\n\nEl Perihelio.\n\n#\n\n#\n\n# II. Aproximación: El Camino a la Maestría\n*[1:30 - 3:00: Entra el piano. Las cuerdas comienzan a tensarse.]*\n\nCharles Eames decía: \"Los detalles no son solo detalles. Hacen el diseño.\"\n\nNo hablaba de ornamento. Hablaba de esencia.\n\nEse lugar donde si quitas algo, todo colapsa. Si añades algo, todo se contamina.\n\nEs el punto más cercano a la verdad.\n\nY para llegar allí, no puedes apresurarte. Tienes que orbitar. Una y otra vez. Observar. Iterar. Repetir el mismo movimiento 10,000 veces hasta que el patrón emerge.\n\nJiro no inventó el sushi. Eliminó todo lo que no era sushi.\n\nEsa es la diferencia.\n\nNosotros añadimos: variables, casos de uso, excepciones, flexibilidad.\n\nLo llamamos \"cobertura.\"\n\nPero la maestría es lo opuesto. Es sustracción. Es decir: esto, y solo esto, es necesario.\n\nY cuando finalmente llegas -cuando tocas ese punto- todo lo demás se revela como obvio.\n\n#\n\n#\n\n# III. El Problema: La IA y la Fragmentación del Trabajo Profundo\n*[3:00 - 4:30: Crece la tensión. Violín, viola. Capas acumulándose.]*\n\nPero ahora algo ha cambiado.\n\nLa IA está aquí. Cursor, Figma, modelos generativos susurrando en cada pausa.\n\nY por primera vez en años, es difícil alcanzar el perihelio.\n\nPorque el perihelio requiere velocidad sostenida en una dirección. Horas continuas. Inmersión total. Esa desaceleración del mundo externo que permite la aceleración interna.\n\nPero la IA interrumpe.\n\nNo violentamente. Con sugerencias. Con atajos. Con la promesa seductora de que puedes llegar más rápido.\n\nY técnicamente, es cierto. Puedes generar más. Más componentes. Más código. Más variaciones.\n\nPero más no es perihelio.\n\nEl perihelio es el punto de máxima cercanía, no de máxima producción.\n\nEs estar tan cerca de la esencia que no hay distancia entre tú y lo que creas.\n\nY eso no se puede acelerar.\n\n#\n\n#\n\n# IV. Órbitas Rotas: Perdiendo el Flow en la Era de la IA\n*[4:30 - 5:45: El clímax comienza a construirse. Todo converge.]*\n\nHe notado algo.\n\nMi mejor trabajo -el trabajo que realmente ES algo- nació en largas sesiones. Ininterrumpidas. Sin IA. Sin Slack. Sin navegador.\n\nSolo yo, el problema, y horas evaporándose.\n\nEse estado donde la corteza prefrontal se apaga y las redes creativas trabajan solas. Donde no supervisas tu propio pensamiento; simplemente fluye.\n\nHipofrontalidad transitoria, lo llaman los neurocientíficos. El cerebro soltando el control para permitir que emerja lo que ya sabe pero no puede verbalizar.\n\nLa IA no entra ahí.\n\nNo porque sea incapaz. Porque es un diálogo. Y el diálogo te mantiene en la corteza prefrontal—supervisando, evaluando, ajustando.\n\nNunca soltando.\n\nNunca llegando al perihelio.\n\n#\n\n#\n\n# V. La Decisión: Protegiendo el Trabajo Profundo y el Estado de Flow\n*[5:45 - 7:00: El crescendo. Cuerdas en su pico.]*\n\nLa IA no es el enemigo.\n\nEs una herramienta para la órbita exterior. Para lo superficial. Para lo que escala.\n\nPero el perihelio -ese punto de máxima cercanía a lo verdadero- sigue siendo humano.\n\nSigue siendo lento.\n\nSigue siendo aburrido, a veces.\n\nY requiere algo radical en un mundo de velocidad: proteger las largas horas. Las sesiones donde desapareces. Donde un detalle consume tu día entero y al final -solo al final- ves que ese detalle lo era todo.\n\nApaga las notificaciones.\n\nCierra Cursor.\n\nDeja que el código, el diseño, el problema te miren de vuelta durante horas.\n\nHasta que llegues al punto donde no hay distancia.\n\nDonde tú eres el trabajo.\n\nDonde tocas el perihelio.\n\n#\n\n#\n\n# VI. El Viaje: Abrazando la Órbita\n*[7:00 - 7:48: La resolución. Todo se asienta. Silencio que respira.]*\n\nJiro, después de 70 años, dice: \"Nadie sabe dónde está la cima.\"\n\nNo ha llegado.\n\nQuizás nunca lo hará.\n\nPero cada día se acerca más. Cada movimiento. Cada repetición. Cada refinamiento mínimo que nadie más nota.\n\nEsa es la órbita.\n\nY el perihelio no es un destino. Es un instante. Fugaz. Intenso. Verdadero.\n\nY luego te alejas de nuevo.\n\nPero sabes que existió. Que lo tocaste.\n\nY eso cambia todo.\n\nLa esencia está ahí. Debajo. Siempre.\n\nSolo tienes que acercarte lo suficiente para sentirla.\n\nPero primero, tienes que soltar el control.\n\nDesconectar.\n\nY dejar que la órbita te leve.\n\n¿Cuándo fue la última vez que alcanzaste tu perihelio? Comparte tu experiencia en los comentarios.\n\nSi esto resonó, suscríbete para más reflexiones sobre sistemas de diseño, flujo creativo y mantenerse humano en un mundo impulsado por IA.\n\n#FlowState #DeepWork #ProcesoCreativo #Maestría #IAyCreatividad",
      "featured": true,
      "series": "IA y el Futuro del Trabajo",
      "tags": [
        "Flow",
        "Deep Work",
        "Philosophy"
      ],
      "image": "/assets/images/writing/perihelion.jpg"
    },
    {
      "id": "roi-design-system",
      "title": "Por qué tu Design System Manager no ve el ROI",
      "featured": true,
      "date": "2025-10-15",
      "readTime": "Management",
      "description": "Si tu rol es de responsable de producto o tech lead, este post tiene métricas, errores concretos y técnicas para elevar el valor real en tu organización.",
      "content": "**Si 40 equipos personalizan el mismo botón, tu Design System tiene un problema (y cómo detectarlo)**\n\nLos equipos de Design Systems en contextos complejos cargan con un problema silencioso:\n\nNadie sabe con certeza cuánto de lo que construyen realmente impacta en producción.\n\nTienes documentación. Tienes componentes. Tienes governance.\n\nPero no tienes visibilidad.\n\nUn día revisas 3 productos diferentes y encuentras que el mismo componente se implementó de 4 formas distintas en cada uno.\n\nY pasa en silencio. Sin que nadie lo vea como un problema.\n\nEso es la realidad de escalar un sistema en contextos con múltiples equipos autónomos.\n\n**No es caos. Es invisibilidad.**\n\n#\n\n#\n\n# **🧩 ¿Cómo medir el ROI de un Design System?**\nEn contextos financieros complejos la situación es más complicada que en otros sectores.\n\nNo es solo que tengas múltiples productos: tienes regulaciones, auditorías, cumplimiento normativo, y presión constante por eficiencia.\n\nUn cambio en tu sistema de diseño no es \"fast and furious\"; es coordinado, medido, rastreado.\n\nEntonces, ¿cómo mides si tu sistema funciona?\n\nAquí viene lo importante:\n\n#\n\n#\n\n# **🎯 ¿Por qué contar componentes no sirve?**\nHe visto a líderes decir: \"*Usamos 450 instancias de nuestro botón el mes pasado.*\"\n\nSuena impresionante.\n\nSignifica nada.\n\n¿Por qué?\n\nUn botón dentro de un header que aparece en 30 páginas: ¿cuenta como 1 o 30?\n\nUn componente copiado y pegado en 15 lugares ¿cuenta hacia tu sistema o cuenta como 15 fracasos?\n\nMás importante: si construyes 200 componentes pero solo 15 se usan en serio...\n\n**¿Realmente tienes un sistema o tienes una biblioteca gigante que nadie mantiene?**\n\n> Lo brutal es que la mayoría de equipos pasa meses midiendo números que no dicen nada.\n\nNecesitas cambiar el enfoque.\n\n**De \"frecuencia absoluta\" a \"amplitud de uso\".**\n\nNo \"cuántas instancias de un componente\".\n\nSino **\"cuántos equipos diferentes usan este componente.\"**\n\n#\n\n#\n\n# **📊 ¿Cuáles son las métricas mínimas viables?**\nPrimer sprint (Semana 1-2):\n\nOlvida 50 gráficos. Necesitas 4 métricas. Punto.\n\n1️⃣ **Cobertura visual**: ¿Qué % de tu interfaz usa componentes DS?\n\n2️⃣ **Adopción por equipo**: ¿Cuántos equipos usan el sistema?\n\n3️⃣ **Consistency score**: ¿Cuántas desviaciones hay por producto?\n\n4️⃣ **Time to component**: ¿Cuánto tardan los equipos en implementar un componente nuevo?\n\n**Eso. Es. Todo.**\n\n#\n\n#\n\n#\n\n# **¿Cómo crear tu baseline en menos de dos horas?**\n\n* **Selecciona 3 productos reales de tu compañía.**\n\n* **Cuenta manualmente (sí, old school):**\n\n* Ejemplo: \"*En el flow de onboarding, 7 de 10 pantallas usan componentes propios del DS.*\"\n\n* Ese es tu baseline: **70% de cobertura en onboarding.**\n\n* Define un objetivo realista a 90 días, por ejemplo: **subirlo al 85%.**\n\n* **Calcula tu \"consistency score\":**\n\n* Escoge 20 pantallas representativas (elige 3-4 flujos clave: onboarding, transferencias, pagos...).\n\n* Revisa visualmente y toma nota de incoherencias:\n\n* \"Este botón tiene padding de 12px aquí, 16px allá.\"\n\n* \"Este input lleva borde, en el siguiente no.\"\n\n* Si tu DS cubre solo un 65% en alta de usuario, el 35% restante es deuda visual y funcional que crecerá con cada release.\n\n* **Registra cada desviación (ese es tu score inicial).**\n\n**Truco para escalar sin volverte loco:**\n\n* Puedes acelerar este proceso automatizando parte del análisis:\n\n* Sube las capturas de esas 20 pantallas a una carpeta.\n\n* Lanza un script sencillo (por ejemplo, en Cursor) o usa una herramienta que detecte inconsistencias visuales o a nivel de código.\n\n* Al final obtendrás algo así:\n\n* \"En estas 20 pantallas encontré X desviaciones. Las más críticas son: Button padding (8 veces), Input border (6), Spacing en cards (4).\"\n\n#\n\n#\n\n# **🔥 ¿Cuál es la métrica que nadie mide pero debería?**\nAquí viene lo que te hace brillar:\n\nCada vez que un equipo detacha o customiza un componente existente (en lugar de usarlo directo), lo registran.\n\nSimple: un comment en el Figma o un ticket.\n\n\"Usamos Button pero con border-radius customizado porque nuestro caso de uso es diferente.\"\n\nAhora multiplica.\n\n**Si 40 equipos detachan el Button de 5 maneras diferentes = mismo problema resuelto 40 veces.**\n\nTraducción: **desperdicio masivo.**\n\nHoras perdidas. Inconsistencia en producción. Deuda técnica acumulada.\n\nPero aquí está lo fascinante.\n\nCada detach que registres es un insight puro.\n\n**No es fallo de adoption.**\n\n**Es fallo de diseño.**\n\nPorque ahora sabes exactamente dónde iterar.\n\n#\n\n#\n\n# **💡 El script que lo cambia todo**\nAquí tienes el copy final para explicar el escaneo por código (sin Figma) y con tu tono claro y técnico:\n\n**¿Cómo saber cuántos equipos realmente usan tu componente estándar y cuántos hacen la suya por libre?**\n\nUn script sencillo te lo da en minutos.<br>No toca Figma ni docs—solo código real.\n\n**Escanea automáticamente toda la base de código:**<br>Busca importaciones del tipo:\n\n```\n<code>import { Button } from 'design-system';</code>\n```\nCuenta cada import y lo agrupa por carpeta, equipo, o contexto (puedes mapear esto a tu monorepo o naming de proyectos).\n\n**Detecta \"copias\" y personalizaciones:**<br>Localiza componentes que se llaman igual pero se redefinen localmente, o que extienden el original con estilos, props o code duplicado.<br>Ejemplo:\n\n```\nimport { Button } from 'design-system';\n\n// Creo una variante para casos especiales\nconst DangerButton = (props) => (\n  <Button {...props} color=\"red\" />\n);\n```\nCada caso suma como \"instancia customizada\".\n\n**Te saca un informe real:**\n\n```\nEquipo Onboarding: 11 imports estándar, 2 custom \nEquipo Cuentas: 17 imports estándar, 7 custom \nEquipo Pagos: 13 imports estándar, 1 custom\n```\nAsí ves, sin interpretación, qué equipos adoptan 100% el patrón y cuáles lo \"rompen\".\n\n**Puedes extraer extra info:**<br>El script te lista también las props usadas, variantes más frecuentes, o props sospechosas de ser hack:\n\n```\n<Button size=\"large\" color=\"error\" style={{borderRadius: 20}} />\n```\n**¿Qué ganas?**\n\n* Datos accionables para saber qué componentes funcionan y cuáles invitan a custom.\n\n* Argumentos sólidos para priorizar refactors (\"este equipo lo rompe siempre, hablemos con ellos\").\n\n* Una visión de verdad sobre la salud y adopción de tu Design System—la métrica que de verdad importa.\n\n**Zero human effort después del setup (2 horas máximo).**\n\n#\n\n#\n\n# **🧠 Predicción de adoption antes de que falle**\nAquí es donde brilla el machine learning simple (y no lo digo como AI hype).\n\nEl patrón es claro:\n\nSi ves que componentes similares fueron detachados 3+ veces en los últimos 90 días...\n\nEl componente nuevo que vas a lanzar **probablemente TAMBIÉN será detachado.**\n\n¿Por qué?\n\nPorque hay un patrón no resuelto en ese dominio de componentes.\n\nEntonces, antes de lanzar ese componente nuevo, puedes:\n\n* Detectar automáticamente el patrón de detach histórico\n\n* Correlacionarlo con el nuevo componente\n\n* **Generar alertas**: \"Este Button tiene 8 deviaciones en el histórico. Tu nuevo componente tiene similitudes. Revisa estos 3 casos de uso antes de lanzar.\"\n\n> Básicamente, **predices si algo va a fallar antes de que falle.**\n\nEl diseñador no se frustra. El componente sale mejor.\n\nAdoption sube automáticamente porque resolviste el problema real.\n\n#\n\n#\n\n# **📈 Cómo crece esto sin romperse**\n**Mes 1:** 50% de cobertura en 2 productos piloto. Baseline feo pero honesto.\n\n**Mes 2:** Líderes ven el problema. Asignan recursos para mejorar componentes rechazados.\n\n**Mes 3:** Cobertura sube a 68%. Equipos empiezan a pedir nuevos componentes (buen signo).\n\n**Mes 4-6:** Escala a otros productos. Cada producto nuevo que entra, ya empieza a 65% de cobertura porque entienden el patrón.\n\n**Mes 12:** **80% de cobertura global. Sistema mantenido por 2 personas. Ahorro anual estimado: €200k-400k en horas de diseño/dev.**\n\n#\n\n#\n\n#\n\n# **❌ Lo que NO hagas**\nNo compares con otras empresas.\n\n**Cada banca es diferente. Cada contexto es diferente. Cada design system es diferente.**\n\nAquí es donde la mayoría falla:\n\n* Figma dice que la mejor práctica es tener 80% de componentes reutilizables.\n\n* Otra banca tiene 6 diseñadores y 50 componentes.\n\n* Design Systems Collective dice que debería tener X métrica.\n\n* Olvidar preguntar a los equipos por qué detachan componentes.\n\n* Medir solo la frecuencia en vez de entender el patrón.\n\n* Comparar tu sistema con bancos que tienen realidades regulatorias y de negocio distintas.\n\nOlvida todo.\n\n**Tu Design System es sumiso al proyecto, no al revés.**\n\nLas normas de Figma no son las tuyas.\n\nLas mejores prácticas de otra banca no son las tuyas.\n\n**¿Por qué?**\n\n* Porque tu contexto tiene regulaciones específicas.\n\n* Tiene equipos con dinámicas que no son las de otra banca.\n\n* Tiene historias de código y decisiones que otra empresa jamás enfrentó.\n\n> **Invierte en conocer tu contexto.<br>*****Un simple log de cuándo y por qué se detacha un botón puede ahorrar miles de euros/mes en soporte y QA.***\n\nDespués, diseña tus métricas desde ahí. No desde lo que otros hacen.\n\n**<br>Mitos frecuentes en métricas DS bancarias:**\n\n* \"Más componentes = más madurez\". Falso. (He visto bancos con +200 componentes que no logran ni 60% de coherencia visual.)\n\n* \"Estándar solo importa en UX\". Falso: en banca, el auditor legal usa tus pantallas como evidencia.\n\n* \"Comparar con benchmarks de otras empresas\". Falso, tu contexto manda.\n\n#\n\n#\n\n# **🚀 Tu primer movimiento (próximos 7 días)**\n\n* Toma 1 producto. Mira 3 flows completos.\n\n* Cuenta: cuántos componentes son DS, cuántos son custom.\n\n* Ese % es tu baseline.\n\n* Fija objetivo a 90 días: +15%.\n\n* Reúnete con 2 equipos. Pregunta: \"¿Qué componente necesitarías que no existe? ¿Qué componente nuestro es un problema?\"\n\n**Eso es suficiente para mover la aguja.**\n\n**Key Takeaways / Acciones para responsables:**\n\n* *Mide equipos, no solo instancias.*\n\n* *Registra cada custom, es una señal estratégica.*\n\n* *Pregunta a equipos por qué adaptan.*\n\n* *Ajusta el score regularmente: los productos bancarios evolucionan cada trimestre.*\n\n> ***Si quieres que tu equipo o tu manager vea el impacto, imprime este checklist y úsalo el próximo trimestre.***\n\n**Para profundizar:**\n\n* **Auditorías automáticas en Design Systems:**<br>**[Design System Metrics: From Adoption to Impact (by Zeroheight & DS expert Nathan Curtis)](https://blog.zeroheight.com/design-system-metrics-adoption-impact/)**\n\n* **Cómo analizar la amplitud real de uso con código:**<br>**[Measure Adoption of a Design System with Automated Scripts (Medium, Ryan Clark)](https://uxdesign.cc/measuring-adoption-of-a-design-system-32293ffb351c)**\n\n* **Métricas reales y tooling para Product Managers:**<br>**[Product Metrics: Find the North Star (by Intercom)](https://www.intercom.com/blog/product-metrics-north-star/)**\n\n* **Cómo detectar \"custom forks\" en librerías de componentes:**<br>**[Detecting UI Consistency and Component Forks in Large Codebases (by Engineering @Airbnb)](https://medium.com/airbnb-engineering/design-system-science-cc0dc49dec10)**\n\n* **Guía avanzada de governance para entornos complejos:**<br>**[Governance of Design Systems in Large Organizations (by Sparkbox)](https://seesparkbox.com/foundry/design_systems_governance_perspectives)**\n\n**¿Cuál sería el ahorro en horas (o reducción de deuda técnica) si pudieras visualizar todas las personalizaciones que hoy están ocultas?**\n\n#DesignSystems #Banca #ProductLeadership #Métricas #Eficiencia",
      "tags": [
        "Gestión",
        "ROI",
        "Estrategia"
      ],
      "series": "Maestría en Design Systems",
      "image": "/assets/images/writing/roi-design-system.png"
    },
    {
      "id": "interface-dependency",
      "title": "Tu producto depende de la interfaz. Los agentes la ignoran.",
      "featured": true,
      "date": "2025-10-01",
      "readTime": "Future Tech",
      "description": "Mi reto desde Alexa hasta hoy: construir sistemas que funcionan incluso donde no hay pantallas. ¿Qué pasa cuando la UI desaparece?",
      "content": "Déjame contarte una historia en dos partes.\n\nLa primera es compleja, pero marca el antes y el después (y explica por qué **sigo enganchado a este dilema**).\n\nLa segunda es práctica: **cómo puedes aprovecharlo hoy**.\n\n<h2>**PARTE 1: Alexa Shopping y el dilema de las capas**</h2>Cuando trabajaba en Amazon Alexa Shopping, meses antes del hype de ChatGPT, me obsesioné con una pregunta:\n\n**¿Cómo diseñas un sistema de compra que funcione igual de bien en voz, pantallas, wearables y múltiples idiomas sin tener que reconstruir todo cada vez?**\n\n> Pasé 6 meses dándole vueltas a esto. No había referencias, ni gurús ni literatura sobre \"**Design Systems multimodales aplicados a shopping**\".\n\nEn vez de flujos lineales (buscar -> ver producto -> añadir al carrito -> pagar), propuse algo diferente: agrupar momentos en el tiempo.\n\nNo paths únicos. Multi-camino.\n\nPero aquí viene la parte técnica que me tenía obsesionado:\n\n**Cada \"momento\" no era un componente fijo del Design System. Era un grupo de información que se autogeneraba en un componente multimodal al vuelo.**\n\nDéjame explicar esto porque es el núcleo de todo:\n\n#\n\n#\n\n# **El componente multimodal autogenerado**\nEn un Design System tradicional tienes:\n\n* Un botón\n\n* Una card de producto\n\n* Un form de pago\n\nSon componentes **prediseñados y estáticos**.\n\nEn un sistema multimodal, tienes **grupos de información** que se convierten en componentes según el contexto:\n\n**Grupo de información: \"Confirmación de compra de pilas AA\"**\n\nContiene:\n\n* Nombre del producto\n\n* Precio\n\n* Método de pago guardado\n\n* Dirección de envío\n\n* Fecha estimada de entrega\n\n**Y este grupo se autorenderiza como:**\n\n🔲 **En Echo Show (visual + voz):**\n\n-> Card con imagen del producto\n\n-> Botón \"Comprar con 1-Click\"\n\n-> Voz: \"¿Confirmo tu pedido de pilas Duracell por €8.99?\"\n\n🗣️ **En Echo Dot (solo voz + luz):**\n\n-> No hay visual\n\n-> Voz: \"Pilas Duracell AA, €8.99, llegan mañana. Di 'confirmar' o 'cancelar'\"\n\n-> Anillo LED azul pulsante (esperando respuesta) -> verde (confirmado) -> rojo (cancelado)\n\n👆 **En app móvil (visual + touch):**\n\n-> Card expandible con detalles completos\n\n-> Botón grande \"Confirmar compra\"\n\n-> Swipe hacia arriba para ver más opciones\n\n📱 **En smartwatch (notificación mínima):**\n\n-> \"Tu pedido habitual de pilas - €8.99\"\n\n-> Dos botones: ✓ y ✗\n\n-> Vibración al confirmar\n\n🤖 **En agente de IA (solo API):**\n\n-> No hay visual ni voz\n\n-> Consume endpoint: <code>POST /orders/confirm</code>\n\n-> Recibe: <code>{orderId, status, estimatedDelivery}</code>\n\n#\n\n#\n\n# **Y aquí está la magia:**\n**El mismo grupo de información genera 5 componentes distintos automáticamente.**\n\nNo construyes 5 componentes separados.\n\nConstruyes **un sistema que sabe qué renderizar según el device**.\n\nLo mejor es que:\n\n**Cuando el usuario cambia de device a mitad del flujo, el componente se regenera en el nuevo contexto sin perder estado.**\n\n#\n\n#\n\n# Ejemplo real (más allá del cross-device típico):\nSupón que no solo el flujo se retoma entre devices, sino que el componente se reconfigura en tiempo real según el \"grupo de información\" y el canal en el que aparece.\n\n* Usuario está cocinando y pregunta a Alexa en voz: \"¿Queda aceite?\"\n\n* Alexa responde con voz: \"Queda poco. Puedes pedir tu favorito.\"\n\n* Alexa activa el componente \"pedido recurrente\" en modo solo voz, preguntando: \"¿Te lo encargo para hoy?\"\n\n* Usuario responde con un gesto (acercar la mano a Alexa):\n\n* El sistema traduce ese gesto como \"sí, pedir aceite\" porque el patrón de luz y la distancia están configurados para esa acción.\n\n* Sin intervención humana, el sistema agrupa toda la info relevante (producto, dirección, método de pago, historial) en un objeto base que puede interpretarse en cualquier contexto.\n\n* El usuario, ya fuera de casa, abre la app móvil de Amazon:\n\n* El sistema detecta el cambio de canal y **genera al instante un componente touch**, con botón \"Cancelar pedido\", opciones de cambiar la marca, y notificación con el resumen.\n\n* Todo el estado, opciones y contexto del flujo se mantienen, pero **el componente no es el mismo que en Alexa: se adapta automáticamente a las capacidades táctiles y visuales del dispositivo**.\n\nEl sistema entiende que no existe \"un botón de pedir aceite\", sino **la esencia del pedido**, que puede tomar cuerpo como frase de voz, opción en pantalla, vibración en un wearable, o petición a una API de agente de IA.\n\nAsí cada \"momento\" de la experiencia es **multimodal y adaptable**, no solo cross-device.\n\n> **Mismo flujo. Múltiples devices. Un solo sistema.**\n\nY esto era posible porque cada componente multimodal tenía estas capas:\n\n🔲 **Capa visual:** componentes 2D del DS tradicional (cards, botones, forms)\n\n🗣️ **Capa conversacional:** fragmentos de texto para voz\n\n👆 **Capa de input:** reglas de interacción (touch, voz, gestos, sensores de distancia)\n\n🔌 **Capa de datos:** API con el grupo de información\n\n🧭 **Capa de navegación:** reglas de transición (de dónde vienes, a dónde vas)\n\nDependiendo del device, el sistema activaba las capas necesarias **y generaba el componente al vuelo**.\n\nEn 2022, esto sonaba abstracto. \n\nPorque eso no escala cuando tienes 15 tipos de devices Alexa diferentes, más app móvil, más web, más wearables.\n\nEn 2025, con agentes de IA comprando solos...\n\n<h2>**PARTE 2: Por qué esto importa y cómo aprovecharlo ahora**</h2>Lo que cambió esta semana:\n\nLos agentes de IA ya compran solos.<br><br>**Preguntas a un asistente: *****\"Contrata a 10 creadores para mi campaña\"*****.**\n\n**El agente busca, compara, paga los $50 con tu permiso previo, y te entrega resultados.**\n\nSin app. Sin checkout. Sin formularios.\n\n**El agente de IA es solo otro \"device\" más, aunque actúe sin visual ni voz. Solo lógica de negocio.**\n\n#\n\n#\n\n#\n\n# **Los datos que lo avalan**\nEsto no es ciencia ficción. Los números son claros:\n\n📊 **$1.7 trillones** en comercio impulsado por IA proyectados para 2030 (Edgar Dunn & Co.)\n\n📊 **25% de ventas online** serán realizadas por agentes de IA para entonces (PayPal CEO)\n\n📊 **1M+ merchants** en Shopify ya habilitados para vender a través de agentes conversacionales\n\n📊 **58% de instituciones financieras** atribuyen crecimiento de ingresos a IA (McKinsey)\n\n**En Alexa Shopping en 2022, esto era un experimento.**\n\n> **En 2025, con agentes comprando solos, es la próxima ola.**\n\n#\n\n#\n\n# **El caso que lo hace tangible: cuando Stripe entendió el juego**\nStripe lo ejemplifica perfecto:\n\nUna sola API y contexto, infinitos usos.<br>No integraciones manuales sino reglas, tokens y componentes que se adaptan a cada canal.<br>Si necesitas un nuevo componente para cada contexto, te quedas atrás.<br>Si defines bien los grupos de información, el sistema se autogenera y escala solo.\n\n**Cómo empezar a construir para este futuro (sin reescribir todo)**\n\nLa buena noticia: no necesitas tirar tu sistema actual.\n\n<h2>**¿Cómo empezar?**</h2>Puedes empezar aplicando estos principios paso a paso:\n\n#\n\n#\n\n# **1. Deja de pensar en componentes fijos. Empieza a pensar en grupos de información.**\nEn lugar de diseñar \"una card de producto\", pregúntate:\n\n¿Qué información crítica necesito mostrar en este momento?\n\n(Nombre, precio, disponibilidad, método de pago...)\n\nLuego define cómo esa información se renderiza según el contexto:\n\n* **Visual:** card + botón\n\n* **Voz:** frase + confirmación\n\n* **API:** JSON con los mismos datos\n\n* **Wearable:** notificación mínima\n\n#\n\n#\n\n# **2. Separa datos de presentación.**\nTu \"grupo de información\" debe vivir en una capa de datos independiente.\n\nLa capa de presentación decide cómo mostrarlo según el device.\n\n#\n\n#\n\n# **3. Haz que tus componentes sean capaces de continuar en múltiples devices.**\nEl estado del flujo no debería vivir en el componente visual.\n\nDebería vivir en una capa de navegación que persiste entre devices.\n\nEjemplo: usuario empieza en voz, continúa en app, finaliza en web.\n\n**Mismo flujo. Múltiples contextos.**\n\n#\n\n#\n\n# **4. Convierte procesos manuales en reglas de renderizado automáticas.**\nEn lugar de crear manualmente variantes para cada contexto, define reglas:\n\n\"Si device = Alexa Dot -> solo voz\"\n\n\"Si device = Echo Show -> voz + visual\"\n\n\"Si device = agente IA -> solo API\"\n\n#\n\n#\n\n# **5. Haz la trazabilidad automática, no opcional.**\nCada componente autogenerado debe registrar:\n\n* ¿Qué información contenía?\n\n* ¿En qué device se renderizó?\n\n* ¿Qué capas se activaron?\n\n* ¿Cómo respondió el usuario?\n\nTodo auditable. Siempre.\n\n**Por qué esto me tiene tan entusiasmado**\n\nHace 3 años, en Alexa Shopping, empecé a explorar componentes multimodales  para compras. Ni siquiera sabía si alguien entendería el porqué, pero estaba decidido a llevar el Sistema de Diseño a su siguiente nivel.\n\nHoy veo agentes de IA comprando en milisegundos, saltando entre contextos, gestionando permisos...\n\nY pienso: **esto es exactamente lo que intentábamos resolver.**\n\nLa diferencia es que entonces no había demanda masiva.\n\nAhora, con $1.7 trillones proyectados en comercio agéntico para 2030...\n\nYa no es un experimento.\n\nPero por ahora, la pregunta es simple:\n\n**¿Hasta qué punto tus componentes se adaptan o solo se copian a cada canal?**\n\nPorque esa es la diferencia entre escalar y tener que crear una variante nueva cada vez que cambia algo.\n\n💬 **Me encantaría leer tus casos, retos o dudas. ¿Alguna vez lograste que un mismo flujo viviera en mil contextos sin rehacer componentes?**\"\n\nDéjalo en comentarios. Quiero saber qué están explorando otros equipos.\n\n</a>#DesignSystems #ProductLeadership #APIs #IA #AgenticCommerce #Multimodal #AlexaShopping",
      "tags": [
        "Agentes IA",
        "Headless",
        "UI de Voz"
      ],
      "series": "IA y el Futuro del Trabajo",
      "image": "/assets/images/writing/interface-dependency.png"
    },
    {
      "id": "invisible-system",
      "title": "El mejor Design System es el que no se ve",
      "date": "2025-09-20",
      "readTime": "Philosophy",
      "description": "La fontanería solo se convierte en la protagonista cuando falla. Un buen sistema de diseño debe ser transparente para el desarrollador.",
      "content": "He trabajado con sistemas que tenían más de 100 componentes.\n\nLo curioso es que, llegado un punto, nadie del equipo sabía realmente cuál era el correcto para cada contexto.\n\nLas discusiones eternas, los tickets que se traspapelaban, los bloqueos en legal por falta de trazabilidad, y los desarrolladores perdiendo la concentración cada dos por tres...\n\nEl resultado era claro: el sistema no era invisible.\n\n**Era ruidoso. Y caro.**\n\nLa infraestructura bien diseñada desaparece.\n\n**Como la fontanería de una ciudad: solo la notas cuando falla.**\n\n<h2>**❌ El problema que nadie admite:**</h2>La mayoría de Design Systems en banca son catálogos de UI con manual de marca.\n\n**Bonitos ✨<br>Documentados 📚<br>Inútiles 🗑️**\n\nPorque no resuelven el problema real:\n\n* Equipos perdiendo días debatiendo qué botón usar\n\n* Developers perdiendo contexto cada dos tickets\n\n* Legal bloqueando cambios por falta de trazabilidad\n\n* Nadie midiendo la deuda invisible\n\nEse tiempo perdido recuperando el foco tras cada interrupción.\n\nNo lo ves en dashboards.<br>Pero es lo que destruye sprints.\n\n<h2>**✅ Cómo se construye un sistema invisible:**</h2>\n\n#\n\n#\n\n#\n\n# **1️⃣ Núcleo pequeño e innegociable**\n10-15 componentes core.<br>No 146.\n\nEl resto son variantes o composiciones.\n\n**¿Por qué importa?**\n\n* Si tienes 146 componentes, seguro tienes 12 botones, 8 inputs, 6 date pickers...\n\n* Cada equipo usará uno distinto, nadie sabrá cuál actualizar, y la deuda técnica crece a escondidas.\n\n* Cuando quieres cambiar un comportamiento global, acabas tocando 10 archivos y cruzando los dedos para que nada rompa en producción.\n\n#\n\n#\n\n#\n\n# **2️⃣ Variaciones regionales controladas**\n**El problema típico en banca:**\n\nTienes un formulario de pago.\n\nEspaña necesita mostrar un disclaimer legal específico.<br>Alemania necesita un orden diferente de campos por regulación.<br>Francia necesita traducción + formato de número distinto.\n\n> **La trampa:**<br>Cada equipo crea su propia versión del componente.\n\n**Resultado:** 15 variantes del mismo formulario.<br>Todas ligeramente diferentes.<br>Todas requieren mantenimiento separado.<br>**Fork hell.**\n\n#\n\n#\n\n#\n\n# **Cómo lo resuelve Stripe (y cómo deberías resolverlo tú):**\nStripe tiene **un solo componente de pago** que funciona en 40+ países.\n\n¿Cómo?\n\n**Las diferencias viven en configuración, no en código:**\n\n```\n<code>{\n  \"ES\": {\n    \"legalDisclaimer\": \"Texto específico español\",\n    \"fieldOrder\": [\"email\", \"card\", \"name\"],\n    \"dateFormat\": \"DD/MM/YYYY\"\n  },\n  \"DE\": {\n    \"legalDisclaimer\": \"Gesetzlicher Hinweis\",\n    \"fieldOrder\": [\"name\", \"card\", \"email\"],\n    \"dateFormat\": \"DD.MM.YYYY\"\n  }\n}\n</code>\n```\n**El componente es el mismo.**<br>La lógica es la misma.<br>Solo cambia la configuración.\n\nActualizas el JSON -> se propaga a todos los mercados.<br>**Cero forks.**\n\n🔗 **[Stripe Localization](https://stripe.com/docs/payments/payment-methods#localization)**\n\n**Otros ejemplos de lo que Stripe hace bien:**\n\n✓ **Validación IBAN en tiempo real:** No esperas días para saber que un formato es incorrecto. Lo sabes mientras escribes.\n\n✓ **Gestión de errores regulados:** Mensajes claros con códigos específicos. Legal aprueba templates una vez, no cada pantalla.\n\n✓ **Autenticación fuerte (SCA):** El sistema detecta automáticamente cuándo es necesario por regulación y lo muestra solo entonces.\n\n**La lección:**<br>Convierten complejidad regulatoria en ventaja competitiva.\n\nNo es magia. **Es diseño de infraestructura.**\n\n📝 **[Como expliqué en este post: cuando tu prototipo empieza a mentirte, es que no diseñaste infraestructura, diseñaste teatro](https://buildsystems.substack.com/p/the-day-our-perfect-prototype-started-lying-to-us-61971324637e)**\n\nSistemas que son invisibles pero imprescindibles.<br>Que priorizan operatividad por delante de estética.\n\n#\n\n#\n\n#\n\n# **3️⃣ Validación automática integrada**\nAccesibilidad, trazabilidad, consistencia.\n\n**Lo verifica el sistema. No la buena voluntad.**\n\n¿Por qué importa?\n\nPorque si la validación depende de que alguien recuerde revisar, tarde o temprano falla.\n\n**Accesibilidad:**<br>Tests automáticos de contraste, jerarquía de encabezados, navegación por teclado.<br>Si un componente no cumple WCAG AA, no pasa a producción. Automáticamente.\n\n**Y esto no es opcional:**<br>La Directiva Europea de Accesibilidad (European Accessibility Act) entra en vigor en junio 2025.<br>Las apps de banca están obligadas a cumplir WCAG 2.1 nivel AA.<br>No es recomendación. Es ley. Con multas.\n\nSi tu validación de accesibilidad es manual, ya vas tarde.\n\n#\n\n#\n\n#\n\n# **4️⃣ Source of truth interna**\nNo en Figma.<br>No en herramientas de terceros que controlan tus costes.\n\n**Hablemos de números reales:**\n\n**Equipo típico en banca: 100 developers + 20 UX**\n\n**Coste Figma en 2019:**\n\n* Professional: €12/editor/mes\n\n* 20 editores UX = €240/mes = **€2,880/año**\n\n* Viewers gratis para developers\n\n**Coste Figma en 2024:**\n\n* Professional: €15/editor/mes (subida 25%)\n\n* Organization: muchas empresas necesitan este plan ahora\n\n* Organization: €45/editor/mes\n\n* 20 editores = €900/mes = **€10,800/año**\n\n**Pero aquí viene el problema:**\n\nAhora Figma cobra por \"viewer seats\" en planes Enterprise para acceso completo a bibliotecas compartidas.\n\n**Enterprise plan (el que realmente necesitas para gobernanza):**\n\n* Precio estimado: €75-100/seat/mes\n\n* 120 usuarios (20 UX + 100 devs que necesitan acceso) = €9,000-12,000/mes\n\n* **= €108,000-144,000/año**\n\n**4,000% de aumento.**\n\nY no controlas:\n\n* Cuándo suben precios\n\n* Qué features nuevas te obligan a pagar más\n\n* Si mañana deciden cambiar el modelo de licencias\n\nEl verdadero riesgo no es solo el dinero, sino que tu gobernanza dependa de decisiones externas. **Por eso la fuente de verdad debe ser interna y controlada por tu organización.** \n\n**¿Por qué importa tanto?**\n\nPorque necesitas algo que:\n\n* **Para Product Managers:**<br>Cuando un Director Financiero pregunta \"¿por qué este copy funciona mejor?\", no puedes responder \"está en un archivo de Figma que alguien movió de carpeta\".\n\nNecesitas datos reales, versioning claro, histórico trazable.<br>Mostrar qué se aprobó, cuándo, por quién, y qué resultados dio.\n\n* **Para Desarrollo:**<br>Si la source of truth cambia cada semana porque alguien actualizó Figma sin avisar, los developers dejan de confiar.\n\nDocumentación interna, versionada y sincronizada con el código elimina ambigüedad.<br>Sin debates. Sin bloqueos.\n\n* **Para Legal:**<br>Cuando reguladores preguntan \"¿qué mostraban exactamente hace 6 meses?\", no puedes depender del histórico de Figma.\n\nNecesitas un sistema inmutable.<br>Que sobreviva cambios de herramientas, precios o políticas externas.<br>Que responda auditorías sin colapsar al equipo.\n\n<h2>**📊 La métrica que importa:**</h2>No son las historias cerradas.<br>No es la \"adopción del DS\".\n\nCada minuto perdido recuperando contexto es deuda silenciosa.\n\nLa que acaba con proyectos sin que nadie la vea venir.\n\n<h2>**🔄 Los rituales que mantienen el sistema vivo:**</h2>**-> Demos de aprendizajes, no solo de features**<br>Qué funcionó, qué falló, qué cambió. No es show & tell, es retrospectiva honesta.\n\n**-> Decisiones documentadas que se usan de verdad<br>**Un ADR (registro de decisión) no es un PDF que nadie vuelve a abrir.\n\nEs responder \"¿por qué lo hicimos así?\" sin necesidad de reuniones.\n\nCuando alguien nuevo pregunta, hay un documento claro que explica:\n\n* Qué decidimos\n\n* Por qué lo decidimos\n\n* Qué alternativas consideramos\n\nY está vinculado al código, no enterrado en Confluence.\n\n**-> Mapas de deuda técnica priorizados por coste real**<br>No por urgencia política. Por cuánto duele mantenerlo.\n\n**Liderar un DS no es \"entregar más rápido\".**\n\nEs:\n\n* Alinear incentivos entre equipos\n\n* Negociar excepciones con fecha de caducidad\n\n* Reducir deuda en silencio, sin ruido\n\n**El mejor líder de sistema es el que menos se nota.**\n\nPorque el sistema funciona solo.\n\n<h2>**🎯 Si el sistema se ve, interrumpe.**</h2>**Si ayuda, desaparece.**\n\n💬 **Preguntas para líderes de sistemas:**\n\n¿Qué métrica usas para detectar fragmentación?\n\n¿Dónde vive tu fuente de verdad?\n\n¿Cuánto pierdes cada vez que tu equipo se desvía del flujo por ambigüedades?\n\n👇 Comparte en comentarios 👇\n\n#DesignSystems #EnterpriseDesign #ProductLeadership #Banking #Governance",
      "tags": [
        "DX",
        "Invisible Design"
      ],
      "image": "/assets/images/writing/invisible-system.png"
    },
    {
      "id": "breaking-rules",
      "title": "Tu Design System no falla por malos componentes",
      "date": "2025-09-10",
      "readTime": "System Ops",
      "description": "Falla porque nadie diseñó quién decide cuándo romper las reglas. La gobernanza es más importante que la librería de Figma.",
      "content": "He pasado los últimos años construyendo, rompiendo y reconstruyendo sistemas de diseño en Amazon, Western Union y startups. Y si hay una lección que se repite como un *loop* de error en consola, es esta:\n\n> **Nos obsesionamos con la superficie y ignoramos la estructura que la sostiene.**\n\nNo hablo de componentes, ni de tokens, ni de documentación. Hablo de la arquitectura *real*: la que define cómo se toman decisiones, quién tiene voz, y qué pasa cuando el sistema choca con la realidad del producto.\n\n<h2>**El mito del \"sistema perfecto\"**</h2>En mi artículo *\"[The Day Our Perfect Prototype Started Lying to Us](https://medium.com/@joanarbo/the-day-our-perfect-prototype-started-lying-to-us-61971324637e)\"*, conté cómo un prototipo impecable — con interacciones fluidas, estados definidos y lógica aparentemente sólida — se desmoronó en producción porque nadie había cuestionado **la API subyacente** .\n\nEl problema no estaba en Figma. Estaba en la brecha entre la *ilusión de control* del diseño y la *complejidad real* del sistema.\n\nEso mismo pasa con los Design Systems.\n\nCreamos bibliotecas hermosas, con variantes para cada caso de uso... pero no diseñamos el **protocolo de evolución**. No definimos cómo se resuelve un conflicto cuando un equipo necesita algo que el sistema no contempla. No establecemos quién puede romper las reglas... y cuándo.\n\n<h2>**La verdadera escalabilidad no es técnica. Es política.**</h2>Un Design System no escala por tener más componentes. Escala por tener **mecanismos claros para la toma de decisiones**.\n\n* ¿Quién decide que un token cambia de valor?\n\n* ¿Qué pasa cuando un equipo necesita un patrón que contradice el sistema?\n\n* ¿Cómo se resuelve un *trade-off* entre consistencia y innovación?\n\nEstas no son preguntas de diseño. Son preguntas de **gobernanza**. Y la mayoría de los sistemas las ignoran hasta que es demasiado tarde.\n\nEn *\"[Haikus y Tokens](https://medium.com/@joanarbo/haikus-y-tokens-18c753ad2b13)\"*, escribí que \"los Design Tokens son decisiones de diseño que se propagan a través de un sistema\" . Pero nunca dije la parte más incómoda: **las decisiones mal gobernadas se propagan como bugs**.\n\nYo también creí que con buenos componentes bastaba... hasta que mi sistema fue ignorado por 3 equipos.\n\n<h2>**El test de fuego: el primer fork**</h2>Todo sistema sano sobrevive su primer *fork*.\n\nEl momento en que un equipo, frustrado por la burocracia o la rigidez, decide crear su propia versión del sistema.\n\nMuchos lo ven como una traición. Yo lo veo como una señal.\n\nPorque si tu sistema no permite *evolución descentralizada*, no es un sistema. Es una cárcel.\n\nLa verdadera prueba no es si todos usan tu biblioteca. Es si, cuando alguien la rompe, **el sistema aprende en lugar de castigar**.\n\n<h2>**Entonces, ¿qué hacer?**</h2>Deja de pensar en tu Design System como un *producto*.\n\nPiénsalo como una **infraestructura de coordinación**.\n\n* Define reglas claras, pero no rígidas.\n\n* Documenta no solo *qué* hacer, sino *cómo decidir*.\n\n* Haz visible el proceso de cambio, no solo el resultado.\n\n* Celebra los *forks* que aportan valor, no solo la obediencia ciega.\n\n<h2>**La ironía final**</h2>Los mejores Design Systems no son los más usados.\n\nSon los que **desaparecen**.\n\nNo porque sean invisibles, sino porque su arquitectura es tan sólida que nadie tiene que pensar en ellas. El equipo se enfoca en resolver problemas reales, no en luchar contra el sistema.\n\nEso no se logra con más documentación.\n\n> Se logra con **menos ego y más estructura**.\n\n*Joan Arbó*\n\nUX Engineer @ Western Union | Ex-Amazon Alexa\n\n***¿Tu equipo ya hizo un fork de tu Design System? No lo castigues. Pregúntate: ¿qué feedback me está dando?***\n\nP.D.: Si tu Design System tiene un \"owner\" pero no un \"protocolo de desacuerdo\", ya está roto. Solo falta que alguien lo diga en voz alta.",
      "tags": [
        "Governance",
        "Ops"
      ],
      "featured": false,
      "series": "Maestría en Design Systems",
      "image": "/assets/images/writing/breaking-rules.png"
    },
    {
      "id": "two-scales",
      "title": "Las dos escalas del diseño: Átomos y Ecosistemas",
      "date": "2025-08-28",
      "readTime": "Deep Dive",
      "description": "Era el último día del curso de Design Systems cuando una pregunta lo cambió todo. Desde el átomo emocional de una invitación hasta la escala masiva de Amazon.",
      "content": "Era el último día del curso de Design Systems en MrMarcel School cuando Laura me hizo la pregunta que no pude quitarme de la cabeza.\n\n> \"Joan, hemos pasado meses estudiando design systems. Pero sigo sin entender cómo conectar la teoría con la práctica real. ¿Por qué todo se siente tan… plano?\"\n\nMe quedé en silencio.\n\nLlevaba dos años trabajando en un proyecto para Alexa, un Sistema de Diseño Conversacional. Interfaces multimodales que se desplegaban en diferentes pantallas, voz, gestos. Sistemas que orquestaban conversaciones, música, smart home, todo sincronizado. Era pensar en grande. Escala universo.\n\nPero esa noche me di cuenta: **Laura me estaba preguntando por el lado opuesto.**\n\n> ¿Y si la siguiente evolución no era hacia arriba, sino hacia abajo?\n\n**En los próximos 10 minutos te voy a mostrar cómo aplicar la metodología 'Powers of Ten' al diseño de sistemas. Descubrirás por qué trabajar solo en una escala (macro o micro) limita tu impacto, y cómo pensar en ambas simultáneamente puede cambiar radicalmente tus resultados.**\n\n#\n\n#\n\n# Powers of Ten: la lección que olvidamos\nEsa madrugada recordé un film de 1977 que cambió cómo vemos el mundo: \"**Powers of Ten**\" de Charles y Ray Eames.\n\nLa cámara está a 1 metro de distancia.\n\nCada 10 segundos, se aleja 10 veces más (10 metros, 100 metros, 1 kilómetro…).\n\nEl parque. La ciudad. Illinois. Estados Unidos. La Tierra. El sistema solar. La galaxia. El universo observable.\n\n*Llegamos a 10²⁴ metros. El borde de todo lo conocido.*\n\nLuego regresa. Al picnic. Y sigue hacia adentro.\n\nA la mano del hombre. A la piel. A las células. A las moléculas. A los átomos. A los quarks.\n\n*Hasta 10^-16 metros. La mínima expresión de la materia.*\n\n> 💡 El mismo punto. 40 órdenes de magnitud diferentes de verlo. Cada escala revela una realidad completamente nueva.\n\n#\n\n#\n\n# Alexa: cuando diseñaba en la escala del universo\nDurante dos años diseñé en el extremo macro.\n\nUn usuario en Boston dice: *\"Alexa, buenos días\"*\n\nEl sistema orquesta:\n\n* Lee noticias personalizadas\n\n* Ajusta luces de la casa\n\n* Muestra calendario en la pantalla\n\n* Sincroniza recordatorios en el móvil\n\n* Arranca playlist de Spotify\n\n***Una frase. Cinco experiencias. Tres dispositivos. Todo coherente.***\n\nEra diseño a escala ecosistema. Pensar en cómo sistemas complejos trabajan juntos. La vista desde 10^24 metros.\n\nPero esa noche, después de la pregunta de Laura, me di cuenta de algo inquietante:\n\n¿Qué pasa cuando bajas 40 órdenes de magnitud? ¿Cuál es la unidad mínima de un design system? ¿La mínima expresión que puede codificar significado?\n\n#\n\n#\n\n# El experimento: invitaciones de boda desde el átomo emocional\nDecidí aplicar \"**Powers of Ten**\" al caso más empático que se me ocurrió: invitaciones de boda digitales.\n\nLa escala tradicional (vista desde 10 metros):\n\nTenía 73 templates en Figma:\n\n* Template \"Romántico\" #1\n\n* Template \"Moderno\" #2\n\n* Template \"Clásico\" #3\n\nEl proceso era el de siempre: pareja elige template, cambio colores, ajusto nombres y fecha, envío. *Rinse and repeat.*\n\nEs la escala \"humana\" del diseño. Donde todos operamos normalmente.\n\n#\n\n#\n\n#\n\n# Pero ¿qué pasa si bajo a escala atómica?\nEn lugar de mostrar templates, pregunté a Laura (sí, mi alumna) y su pareja:\n\n*\"¿Cómo queréis que se sientan vuestros invitados cuando reciban la invitación?\"*\n\nLaura y su pareja: *\"Íntimos, cálidos, familiares\"*\n\nNo busqué *\"Template Romántico #3\"*.\n\n**Bajé a la mínima expresión. A los *****tokens emocionales de la invitación:***\n\n```\n$invitation-intimacy: (\n. spacing: generous, // respira, no agobia\n. palette: warm-earth, // terracotta, cream, sage\n. typography: gentle, // serif suave, no imponente\n. decoration: minimal. // flores discretas, no pomposas\n);sc\n```\n**Es como en el film de los Eames:** cuando bajas a escala molecular, descubres que lo que parecía sólido (un template de boda) en realidad está hecho de átomos (decisiones emocionales mínimas).\n\n#\n\n#\n\n# Las dos escalas en acción: Alexa vs invitaciones de boda\n#\n\n#\n\n#\n\n# **Escala Macro (mi proyecto en Alexa — 2 años):**\n**Usuario: Alexa, quiero ambiente romántico\"**\n\nSistema orquesta múltiples dispositivos:\n\n* Luces → warm amber, 30% intensidad\n\n* Música → jazz suave, volumen bajo\n\n* Pantalla → fireplace animation\n\n* Temperatura → sube 2 grados\n\nUna instrucción. Cuatro sistemas. Todo sincronizado.\n\nVista desde el universo: cómo experiencias complejas trabajan juntas.\n\n#\n\n#\n\n#\n\n# **Escala Micro (invitaciones de boda — el nuevo approach):**\nPero ¿qué hace que \"warm amber\" se sienta romántico y no \"bright white\"?\n\nAhí está el átomo. El mismo principio aplicado a una invitación de boda:\n\n```\n// El \"átomo romántico\" de Alexa\n$romantic-light: (\n. hue: 30, // naranja cálido\n. saturation: 85, // rico pero no saturado\n. brightness: 30. // íntimo, no brillante\n);\n\n// El mismo \"átomo romántico\" en una invitación\n$invitation-warmth: (\n. color-primary: hsl(30, 85%, 30%), // mismo hue\n. color-accent: hsl(30, 75%, 85%), // versión suave\n. color-background: hsl(30, 25%, 95%) // casi blanco cálido\n);\n```\n**⚠️ El insight:** Para que Alexa funcione a escala universo, alguien tuvo que diseñar primero a escala átomo. Lo mismo con las invitaciones de boda.\n\n#\n\n#\n\n# Cuando el átomo define el universo: caso real\nAna y Marcos responden diferente: \"Vibrante, internacional, celebración\"\n\n**Escala Micro (los tokens de su invitación):**\n\n```\n$invitation-celebration: (\n. spacing: dynamic, // elementos que se solapan\n. palette: festive-bold, // electric blue + gold\n. typography: geometric, // sans-serif arquitectónica\n. decoration: maximal. // ornamentación festiva\n);\n```\n**Escala Macro (toda su experiencia de boda digital):**\n\nDesde esos átomos, el sistema genera automáticamente:\n\n* Save the date (primer contacto)<br>Usa los tokens: espaciado dinámico, paleta festiva<br>Mood: \"algo grande viene\"\n\n* Invitación principal (core experience)<br>Mismos tokens, jerarquía más compleja<br>Mood: \"celebración internacional\"\n\n* RSVP card (interacción)<br>Tokens aplicados a formulario<br>Mood: \"responde con energía\"\n\n* Thank you notes (despedida)<br>Tokens más suaves pero reconocibles<br>Mood: \"gracias por celebrar con nosotros\"\n\n> Todo coherente. Porque los átomos emocionales son consistentes.\n\nEs exactamente como \"**Powers of Ten**\":\n\nDesde 10^-16 (el token `$festive-bold: hsl(210, 100%, 50%)`) hasta 10^24 (toda la experiencia digital de boda) hay 40 escalas entre medio.\n\n> 💡 Si el átomo no codifica emoción correctamente, toda la experiencia de boda se siente genérica.\n\n#\n\n#\n\n# Los números que validaron las dos escalas\nSeis meses probando este approach con invitaciones de boda digitales:\n\n📊 Client satisfaction: 78% → 94%\n\n⏱️ Iterations to approval: 5–7 → 2–3.\n\n💰 Conversion rate: 23% → 41%\n\n📈 Referrals: 12% → 38%\n\n#\n\n#\n\n# Lo revelador:\n**Las parejas dejaron de pedir \"cambia este color por ese\" (pensamiento macro, nivel template) y empezaron a decir\" se siente exactamente como nosotros\" (coherencia desde lo micro, nivel átomo).**\n\nPorque cuando diseñas invitaciones desde la mínima expresión emocional hacia arriba, **cada pieza hereda la personalidad de la pareja.**\n\n#\n\n#\n\n# Lo que Laura realmente me preguntó\nLaura no cuestionaba la teoría de design systems.\n\nSeñalaba algo más profundo: **todos pensamos design systems en una sola escala.**\n\nYo había pasado dos años en el extremo macro con Alexa:\n\n* Experiencias multimodales que orquestan dispositivos\n\n* Sistemas cross-platform sincronizados\n\n* Ecosistemas complejos de experiencias\n\nPero había ignorado el extremo opuesto en las invitaciones de boda:\n\n* ¿Cuál es el átomo emocional de una invitación?\n\n* ¿Qué es la mínima expresión que define \"romántico\"?\n\n* ¿Cómo se codifica \"intimidad familiar\" en un solo token?\n\n**Como en el film de los Eames:** si solo ves las invitaciones desde \"template completo\", nunca descubres los átomos emocionales que las construyen.\n\n> 🎯 El futuro del diseño no es elegir macro o micro. Es pensar en ambas escalas simultáneamente.\n\n#\n\n#\n\n# La conexión entre Alexa y una invitación de boda\nAsí es como funciona en ambos casos:\n\n**Escala Micro (10^-16): Un token de color**\n\n```\n// En Alexa\n$ambient-romantic: hsl(30, 85%, 30%);\n\n// En invitación de boda\n$invitation-warmth: hsl(30, 85%, 30%);\n```\n**Escala Molecular (10^-8): Un componente**\n\n```\n// En Alexa\n<LightControl mood=\"romantic\" />\n\n// En invitación\n<Card emotional-tone=\"intimate\" />\n```\n**Escala Celular (10^0): Una escena completa**\n\n```\n// En Alexa\n<RomanticAmbience room=\"living\" />\n\n// En invitación\n<WeddingInvitation couple=\"Laura-Pablo\" />\n```\n**Escala Ecosistema (10^8): Una experiencia completa**\n\n```\n// En Alexa (multi-dispositivo)\n<SmartHomeExperience mood=\"romantic\" />\n\n// En boda (multi-formato)\n<WeddingExperience theme=\"intimate-celebration\" />\n```\n**Cada escala construye sobre la anterior. Pero sin los átomos correctos en 10^-16, todo el universo en 10^24 se siente genérico.**\n\nYa sea Alexa orquestando tu casa o una invitación de boda llegando a tu WhatsApp.\n\n#\n\n#\n\n# Lo que viene: el diseñador bidireccional\nEstoy desarrollando una metodología que opera en ambas direcciones:\n\n**Cuando subes (macro):**\n\n* Desde tokens de boda → save the date → invitación → experiencia completa\n\n* Como construir una celebración desde sus átomos emocionales\n\n**Cuando bajas (micro):**\n\n* Desde \"quiero boda íntima\" → ¿qué paleta? → ¿qué tokens definen intimidad?\n\n* Como entender por qué una invitación se siente de cierta manera\n\n> El poder: Coherencia emocional desde el quark hasta el universo.\n\nYa sea en Alexa multimodal o en invitaciones de boda digitales.\n\n#\n\n#\n\n# **Tu turno:**\n¿En qué escala diseñas normalmente?\n\n¿Has pensado en experiencias macro (como Alexa, ecosistemas)?\n\n¿Has bajado a escala micro (tokens que sienten) en tus proyectos?\n\n¿Qué descubrirías si cambiaras tu escala 10x arriba o 10x abajo?\n\n**Ejercicio para hoy:**\n\n**Toma tu último proyecto. Identifica en qué escala trabajaste (¿templates completos o tokens básicos?). Ahora imagina: ¿qué descubrirías si bajaras/subieras 10 escalas? Comparte tu respuesta en comentarios.**\n\n#DesignSystems #PowersOfTen #SystemsThinking #EmotionalDesign #WeddingDesign #DesignScale",
      "tags": [
        "Scales",
        "Education",
        "Philosophy"
      ],
      "featured": false,
      "series": "Maestría en Design Systems",
      "image": "/assets/images/writing/two-scales.png"
    },
    {
      "id": "lying-prototype",
      "title": "El día en que nuestro prototipo perfecto empezó a mentirnos",
      "date": "2025-08-15",
      "readTime": "Management",
      "description": "El día en que nuestro prototipo perfecto empezó a mentirnos.",
      "content": "Contenido en camino.",
      "tags": [
        "Design Systems",
        "Prototyping"
      ],
      "featured": true,
      "series": "Maestría en Design Systems",
      "image": "/assets/images/writing/lying-prototype.png"
    },
    {
      "id": "ai-thinking",
      "title": "Pensamiento sistémico en la era de la IA",
      "date": "2025-08-01",
      "readTime": "Deep Dive",
      "description": "Pensamiento sistémico en la era de la IA.",
      "content": "Contenido en camino.",
      "tags": [
        "AI",
        "Systems Thinking"
      ],
      "featured": false,
      "series": "IA y el Futuro del Trabajo",
      "image": "/assets/images/writing/ai-thinking.png"
    },
    {
      "id": "ai-thinking",
      "title": "La IA no me quita el trabajo, me reta a pensar distinto",
      "date": "2025-08-01",
      "readTime": "Essay",
      "description": "De pedirle que ejecute a pedirle que me rete: el prompt y el proceso que sí cambian cómo construyo.",
      "content": "Cómo paso de \"IA que ejecuta\" a \"IA que me reta\". El prompt y el proceso que sí cambian cómo construyo.\n\nHe visto a la IA generar archivos que imprimiría y enmarcaría. También la he visto romper contextos por complaciente. La diferencia no es magia: es cómo conversas con ella. Cuento el cambio que hice: de pedirle que ejecute a pedirle que me rete.\n\n#\n\n#\n\n# Un cambio real: cuando la IA me dejó sin palabras\nEn Western Union, tras definir una colección inicial de tokens, la IA refinó el set y generó un SCSS tan limpio que fui directo al director de tecnología: \"Esto hay que imprimirlo y enmarcarlo\". Concretamente: eliminó 27 duplicados, agrupó semánticos por intención y propuso una escala de spacing que luego adopté en todos los proyectos. Aprendizaje: el valor no fue el código, fue la conversación que nos obligó a decidir lo inmutable.\n\nLlevo años revisando y enseñando archivos de tokens — en empresas como Amazon o Western Union, con equipos grandes, analizándolos en cursos y charlas — y nunca había visto uno tan afinado, así, de una tacada.\n\n#\n\n#\n\n# Vulnerabilidad: lo que me inquieta de verdad\nSí, asusta que ahora alguien con menos experiencia monte un sistema en una fracción del tiempo. Mi respuesta no es competir contra la IA en ejecución, sino liderar el contexto, el criterio y los acuerdos. Eso no se autogenera: se diseña conversando.\n\n#\n\n#\n\n# Cuando la IA falla\n¿El talón de Aquiles de la IA? Si le falta contexto, puede fallar estrepitosamente. Las primeras versiones de GPT eran terriblemente complacientes: respondían siempre algo, aunque no tuviera sentido. Ahí sigue estando nuestro valor: saber decirle \"por aquí no\", exigirle que nos pregunte más y añada profundidad — no aceptar el primer borrador ni la respuesta fácil.\n\n#\n\n#\n\n#\n\n# **Señales de que la IA está complaciente (y cómo cortarlo):**\n\n* Te da respuestas largas sin pedirte más contexto -> Respuesta: pide 3 preguntas antes de proponer soluciones.\n\n* Te devuelve código perfecto pero desconectado del problema -> Pide \"razón, trade-offs y riesgos\".\n\n* Te dice \"sí\" a todo -> Pide contraejemplos y un test de estrés rápido.\n\n#\n\n#\n\n# El prompt más tonto pero potente que uso\nTe regalo el prompt que mejores resultados me ha dado:\n\n```\nEres un experto en tu campo. A partir de ahora serás mi asesor en {tema\nconcreto}. No seas complaciente conmigo: cuestiona mis supuestos, hazme \npreguntas antes de proponer soluciones y plantea riesgos y trade-offs. \n\nTrabajemos en iteraciones de máximo 10 minutos y termina cada vuelta con: \n\n1) decisión sugerida\n\n2) riesgos\n\n3) siguiente pregunta\n```\n#\n\n#\n\n#\n\n# Mi flujo en 5 pasos\n\n* Defino el contexto en 5 líneas (quién, para qué, restricciones).\n\n* Pido 3 preguntas y paro (si no pregunta, reintento).\n\n* Exijo 2 alternativas con trade-offs (no \"la mejor práctica\" genérica).\n\n* Valido con un ejemplo pequeño (no specs completas).\n\n* Resumo yo lo aprendido y lo uso como prompt para la siguiente iteración.\n\nLa clave: no es magia ni adulación — es abrir una dinámica de conversación exigente, ida y vuelta, exigiendo valor y afinando juntos.\n\n#\n\n#\n\n# Mi consejo práctico\nAtrévete: empieza un proyecto propio básico desde cero con ayuda de la IA, trastea, rómpelo, itera y, cuando lo termines, pídele a la IA que te resuma lo aprendido y vuelve a empezar con ese resumen como prompt inicial.<br>La segunda, tercera y cuarta versión serán mejores y más tuyas.\n\n#\n\n#\n\n# ¿Y tú?\n¿Te atreves a dejar a la IA retarte — no solo a ejecutarte tareas? ¿Qué fue lo último que la IA te enseñó o que nunca hubieses hecho sin ella?\n\n#AIUX #DesignSystems #Solopreneur #ProductThinking\n\n> La creatividad no la reemplaza la IA. Pero la IA, si la entiendes, te obliga a ser más creativo que nunca.",
      "tags": [
        "IA",
        "Mentalidad",
        "Carrera"
      ],
      "featured": false,
      "series": "IA y el Futuro del Trabajo",
      "image": "/assets/images/writing/ai-thinking.png"
    },
    {
      "id": "writing-workflow",
      "title": "Cómo lanzo un post valioso cada semana en 30 min",
      "date": "2025-07-20",
      "readTime": "Workflow",
      "description": "Sin quemarse, sin depender de la inspiración. Mi sistema de creación de contenido asistido por IA y Notion.",
      "content": "*Lee este artículo en inglés [aquí](https://medium.com/@joanarbo/how-i-write-and-publish-a-valuable-post-every-week-in-just-30-minutes-thanks-to-ai-notion-1e15de49805c)*\n\n¿Te imaginas escribir (y publicar), sin quemarte, ni depender de la inspiración… y sin postureo?<br>El primer día no sabía si solo escribiría por inercia. Ahora disfruto (casi) más del proceso que del post en sí.\n\n> \"A los famosos les escriben libros tras entrevistarles. Yo tengo una IA que me entrevista a diario, me reta y consigue que mis ideas tengan sentido — y con eso, me basta.\"\n\n#\n\n#\n\n#\n\n# Por qué sistematicé mi proceso de publicar semanalmente\nAntes creía que un post valioso requería dos o tres días de dar vueltas, bocetar, reescribir y ajustar. <br>Como diseñador e ingeniero, siempre he buscado claridad… pero casi siempre mi primer borrador solo lo entiendo yo (o mis alumnos más cercanos), mientras que a un público profesional y exigente rara vez le resuena.\n\nHasta que lo acepté:\n\n* Publicar tiene que ser sostenible y rápido, no perfecto.\n\n* Las mejores ideas suelen surgir después de publicar, no antes.\n\nAsí que monté una rutina semanal mezclando una plantilla en Notion, un protocolo muy simple y mi nueva \"*pareja creativa*\": una IA que me entrevista y perfecciona el resultado.\n\n* Antes: Dudas, bloqueos, textos que no conectaban.\n\n* Después: Libertad, foco y control creativo gracias a la rutina+IA.\n\n> Por ejemplo, antes cada borrador se quedaba sin publicar por miedo a la crítica. Ahora, publico sin miedo a que no sea perfecto, porque el aprendizaje real viene justo después.\n\n#\n\n#\n\n#\n\n# Mi workflow de 30 minutos: crear contenido sin quemarme\n¿El proceso real, sin postureo?\n\n**1. Abro mi plantilla de Notion.<br>** Cada semana duplico una simple \"Tarjeta diaria\". Me pide:\n\n```\n#\n\n#\n\n# Mi plantilla diaria en Notion (extracto)\n\n- **¿Cuál es el reto/tema concreto de hoy?**\n- **¿Por qué justo este tema es importante para mí / para otros?**\n- **¿Qué he hecho, experimentado o aprendido sobre esto (con una anécdota real)?**\n- **¿Qué barrera me frenó y cómo la sorteé (si la hubo)?**\n- **¿Qué \"microfracaso\" puedo compartir que ayude a otros?**\n- **¿Cuál es la idea principal que debería recordar si solo pudiese escribir 1 línea hoy?**\n- **¿Cómo puedo retar a mi audiencia para que me sorprenda?**\n- **Call to action claro: ¿Qué busco hoy? Feedback, conversación, co-creación...**\n\n*(Añado una sección de reflexión rápida tipo \"mini-diario\" para entender si lo que escribo hoy conecta con el rumbo que quiero.)*\n```\n**2. Dejo que la IA me entreviste en función de lo que he rellenado en la tarjeta.<br>** En vez de pelearme con la hoja en blanco, le pido a la IA que me desafíe — *\"¿Dónde está el verdadero problema? ¿En qué he fallado? ¿A quién sirve de verdad esto?\" *<br> A veces refina mis ideas genéricas, otras veces da la vuelta y pregunta justo lo que mi público necesitaría escuchar.\n\n> *Ejemplo real:* \"Hoy la IA me preguntó si ese ejemplo podía ser útil a alguien sin background técnico. Eso me hizo simplificar todo el post.\"\n\n**3. Mantengo el post compacto.<br>** Nada de ensayos largos: el aprendizaje o micro-historia, a lo sumo antes/después (**Antes: 3 días por post. Ahora: 30 minutos y una rutina establecida**).\n\n**4. Publico siempre un asset visual. <br>** Diagrama, snippet de código o simplemente una \"comparativa antes/después\" (¡a veces solo exporto de Figma!). <br>Publicar algo tangible separa tu mensaje del humo y da credibilidad real.\n\n**5. Cierro con una CTA honesta.<br>** Nada de \"DM ya\", sino propuesta real de interacción: que la gente comente su rutina, su peor fail, o si quiere la plantilla. Las mejores respuestas se convierten en material para el post de la siguiente semana.\n\n**6. Bloque de reflexión/confesión.<br>** Siempre una línea de auto-crítica real (\"*No sé si hoy lo he clavado para el público pro*\" / \"*Me he pasado de blando o me fui al tecnicismo fácil*\"). Es mi diario de a bordo: escribo para ordenarme yo y, de paso, para hacer comunidad.\n\n#\n\n#\n\n#\n\n# Ejemplos de prompts y preguntas reales que uso\n- \"*¿Qué aprendiste a las malas prototipando con código?*\"<br>- \"*¿Cuándo una rutina o plantilla realmente te ayudó a ir más rápido, de verdad?*\"<br>- \"*¿Dónde pierdes más tiempo o energía: redactando, editando, buscando feedback?*\"\n\n*(Si quieres, roba estas preguntas para tu Notion, Google Doc o pégalas a tu IA habitual.)*\n\n#\n\n#\n\n# Por qué esta rutina FUNCIONA\n\n* **Ahorra tiempo**: Pasé de días a 30 minutos (¡a veces menos!) por cada post.\n\n* **Te libra de la trampa de la perfección:** Publicar periódicamente me hace preocuparme menos por cada frase — y centrarme más en aprender junto a quien me lee.\n\n* **Construye autoridad real:** Repetición, minicuentos y enseñanzas realistas funcionan mucho mejor que cualquier \"*gran teoría*\".\n\n#\n\n#\n\n#\n\n# Vulnerabilidad real\nSinceramente: sigo dudando si mi voz conecta con el público pro. Muchas veces me lío, peco de empático ('ñoño') o quedo a medias entre mi yo profe de siempre y mi versión más estratégica. <br>Pero esta \"micro-rutina-diario\" me da foco y, lo mejor, crea un feedback loop donde los lectores (y hasta los que critican…) ayudan a mejorar tanto mi contenido como mi metodología.\n\n¿Y tú? ¿Sientes que tu voz a veces se diluye por 'ir de profe' o por miedo a no sonar lo bastante profesional? Yo sí — y por eso te propongo probar mi rutina y decirme si también te libera.\"\n\n#\n\n#\n\n# ¿Quieres la plantilla? ¿O ver cómo la IA me entrevista (de verdad)?\nSolo tienes que dejar un comentario \"ENTREVISTA\" o mandarme mensaje. Comparto plantilla, guion si te ayuda a empezar la tuya.<br>Todavía no he encontrado IA capaz de darme feedback tan 'real' como un comentario sincero, un debate productivo o incluso una crítica inesperada.\n\n> La rutina no mata la creatividad. Al revés: le da el espacio para ser honesta, breve y compartida cada día.\n\n#productividad #escribirendigital #designsystems #notion #ai #promptengineering #buildinpublic\n\n*Joan Arbó — UX Engineer con 18 años de experiencia, profesor de Design Systems y apasionado de acelerar equipos sin perder calidad. Ex-Amazon, ahora en Western Union. ¿Hablamos? [me@joanarbo.com](mailto:me@joanarbo.com)*",
      "tags": [
        "Productividad",
        "Escritura",
        "Notion"
      ],
      "featured": false,
      "series": "IA y el Futuro del Trabajo",
      "image": "/assets/images/writing/writing-workflow.png"
    }
  ],
  "ideas": [
    {
      "id": "design-agents",
      "title": "Agentes de Diseño Autónomos",
      "date": "2026-01-08",
      "status": "active",
      "readTime": "14 min lectura",
      "description": "Automatizando la burocracia creativa. Cómo delegar tareas de Design Ops (naming, linting, documentación) a agentes autónomos para liberar a los humanos.",
      "content": "El trabajo de un Product Designer moderno es 20% creatividad y 80% gestión de archivos. Renombrar capas en Figma, verificar contrastes WCAG, actualizar estados de Jira, documentar props de componentes... Es el \"trabajo de conserje\" digital.\n\nSi aplicamos la teoría de Agentes Autónomos, podemos externalizar casi toda esta carga cognitiva.\n\n#\n\n#\n\n# Anatomía de un Agente de Diseño\n\nUn agente requiere tres cosas:\n1.  **Percepción**: Capacidad de leer el archivo (Figma API).\n2.  **Cerebro**: Capacidad de razonar sobre lo leído (GPT-4 / Claude 3).\n3.  **Acción**: Capacidad de modificar el archivo (Write Access).\n\n#\n\n#\n\n# Design Ops 2.0: De Policía a Jardinero\n\nTradicionalmente, Design Ops actuaba como policía: \"¡No usaste el componente correcto!\". Con agentes, Design Ops se convierte en jardinería automática. El sistema se poda y se riega a sí mismo.\n\nEsto cambia la economía del equipo de diseño. Ya no necesitas un \"Junior\" para ordenar archivos. Necesitas Seniors que sepan configurar las reglas de los agentes.\n\n---\n\n#\n\n#\n\n#\n\n# Automatización de Design Ops\n¿Tu equipo pierde horas en tareas repetitivas en Figma/Jira? Ayudo a implementar **pipelines de automatización y agentes personalizados** para tu flujo de trabajo de diseño.\n\n[<i class=\"ph-thin ph-arrow-right\"></i> Automatizar mi Design Ops](mailto:me@joanarbo.com?subject=DesignOps%20Automation)",
      "tags": [
        "Agentes",
        "Ops",
        "Automatización"
      ]
    },
    {
      "id": "multimodal-evolution",
      "title": "Evolución de sistemas de diseño multimodales",
      "date": "2026-01-15",
      "status": "active",
      "readTime": "10 min lectura",
      "description": "Explorando cómo los sistemas de diseño deben evolucionar para soportar interacciones que van más allá de la pantalla, integrando voz, gestos y agentes IA.",
      "content": "La evolución de los sistemas de diseño multimodal no se trata solo de añadir nuevos componentes, sino de redefinir cómo la información se adapta a diferentes canales de interacción. \n\nEn un mundo donde Rufus y otros agentes IA están redefiniendo el comercio y la interacción, nuestros sistemas deben ser capaces de orquestar experiencias coherentes en dispositivos Echo, móviles, y wearables sin duplicar esfuerzos.",
      "tags": [
        "Multimodal",
        "AI Agents",
        "Future UI"
      ]
    }
  ],
  "thoughtLeadershipItems": [
    {
      "id": "redbility-talk",
      "type": "talk",
      "title": "El futuro de los Sistemas de Diseño más allá de la interfaz",
      "event": "Redbility Innovation Center",
      "date": "2024",
      "image": "https://img.youtube.com/vi/wUPlE682OqY/maxresdefault.jpg",
      "videoUrl": "https://youtu.be/wUPlE682OqY",
      "description": "En esta charla exploramos por qué los sistemas de diseño tradicionales centrados en píxeles están alcanzando su límite. Analizaremos cómo la llegada de la IA generativa y las interfaces multimodales (voz, gesto, espacial) requieren una nueva arquitectura: 'Systems as Infrastructure'. Discutiremos cómo desacoplar la lógica de diseño de la implementación visual para permitir que el mismo sistema alimente un sitio web, un asistente de voz y un agente de IA simultáneamente. También veremos cómo equipos como Amazon y Spotify están redefiniendo sus sistemas para priorizar la semántica sobre la estética, permitiendo una personalización radical y una velocidad de iteración imposible con las herramientas actuales.",
      "tags": [
        "Design Systems",
        "Future UI"
      ]
    },
    {
      "id": "masterclass-historias",
      "type": "talk",
      "title": "El mundo diseño está hecho de historias",
      "event": "Mr Marcel School",
      "date": "2023",
      "image": "https://img.youtube.com/vi/eGj9ZZ3Lj2k/maxresdefault.jpg",
      "videoUrl": "https://youtu.be/eGj9ZZ3Lj2k",
      "description": "¿Cómo convertimos un conjunto de componentes fríos en una experiencia cálida y memorable? En esta charla, deconstruyo la relación entre el Atomic Design y la narrativa clásica. Descubriremos cómo cada token, átomo y molécula contribuye a un 'arco narrativo' del usuario. A través de ejemplos reales, muestro cómo definir 'tonos de voz' visuales que se adaptan al contexto emocional del usuario (ansiedad vs. celebración) y cómo documentar estas decisiones no como reglas rígidas, sino como principios de storytelling. Es una guía esencial para equipos que quieren que su producto tenga alma, no solo funcionalidad.",
      "tags": [
        "Atomic Design",
        "Storytelling"
      ]
    },
    {
      "id": "haikus-tokens",
      "type": "talk",
      "title": "Haikus y tokens",
      "event": "Mr Marcel School",
      "date": "2023",
      "image": "https://img.youtube.com/vi/6NuKWcpw4Ws/maxresdefault.jpg",
      "videoUrl": "https://youtu.be/6NuKWcpw4Ws",
      "description": "El Haiku japonés logra la máxima expresión con la mínima estructura (5-7-5 sílabas). Los Design Tokens buscan lo mismo: máxima consistencia con unidades mínimas de información. En esta sesión teórica y práctica, enseño cómo aplicar la filosofía de la restricción creativa del Haiku a la arquitectura de tokens. Aprenderás a nombrar variables de forma semántica para que 'cuenten una historia' a los desarrolladores, evitando nombres crípticos como 'blue-500'. Veremos cómo crear una taxonomía de tokens que sea resiliente al cambio, fácil de aprender para nuevos miembros del equipo y capaz de escalar desde una app móvil hasta un ecosistema multiplataforma sin romperse.",
      "tags": [
        "Design Tokens",
        "Semántica"
      ]
    },
    {
      "id": "garaje-ideas-js",
      "type": "talk",
      "title": "Cómo hacer prototipos con Javascript orientado a objetos",
      "event": "Garaje de Ideas",
      "date": "2022",
      "image": "https://img.youtube.com/vi/d9jj5USBhno/maxresdefault.jpg",
      "videoUrl": "https://youtu.be/d9jj5USBhno",
      "description": "La mayoría de los prototipos fallan porque son solo 'dibujos interactivos' que no manejan datos reales. En este live coding, rompo la barrera entre diseñador e ingeniero. Te enseñaré a usar JavaScript Moderno (ES6+) y Programación Orientada a Objetos para crear 'Modelos de Dominio' en tus prototipos. Imagina un prototipo de e-commerce que realmente 'sabe' cuánto stock queda, o un dashboard financiero que calcula intereses en tiempo real. Aprenderás patrones sencillos para gestionar estado y lógica, permitiéndote testear no solo la usabilidad visual, sino la utilidad real de las features antes de escribir una sola línea de código de producción. Ideal para diseñadores que quieren superpoderes técnicos.",
      "tags": [
        "JS",
        "Prototyping"
      ]
    }
  ],
  "projects": [
    {
      "id": "western-union",
      "title": "Racionalización Radical",
      "company": "Western Union",
      "year": "2023-Present",
      "impact": "2023–Presente",
      "description": "No un rediseño cosmético, sino una auditoría sistémica y estrategia de gobernanza federada. Implementación de una 'Fuente de Verdad' (Single Source of Truth) basada en tokens de diseño. Infraestructura escalable que permite localización rápida en 4+ países.",
      "tags": [
        "Gobernanza Federada",
        "Arquitectura Tokens",
        "Gestión Cambio"
      ],
      "image": "/assets/images/projects/wu-ds.png",
      "metrics": {
        "primary": "146 → 10",
        "primaryLabel": "Componentes Core Atómicos",
        "secondary": "-40%",
        "secondaryLabel": "Reducción OpEx"
      }
    },
    {
      "id": "alexa-multimodal",
      "title": "Innovación Multimodal",
      "company": "Amazon Alexa",
      "year": "2021-2022",
      "impact": "2021–2022",
      "description": "Creación del primer sistema de diseño de voz del mundo. Prototipos de alta fidelidad para 'Rufus' (Next-Gen AI Assistant) presentados al CEO Andy Jassy. Estandarización de patrones VUI utilizados per millones de usuarios.",
      "tags": [
        "Voice UI",
        "Multimodalidad",
        "Colaboración ML"
      ],
      "image": "/assets/images/projects/alexa.png",
      "metrics": {
        "primary": "C-Level",
        "primaryLabel": "Presentado al CEO",
        "secondary": "-6 meses",
        "secondaryLabel": "Tiempo de Integración"
      }
    },
    {
      "id": "amazon-business",
      "title": "Innovación en Tooling Interno",
      "company": "Amazon Business",
      "year": "2019-2021",
      "impact": "2019–2021",
      "description": "Creación de 'Telescope': una herramienta interna para asistir el prototipado, reduciendo el tiempo de iteración en un 45%. Cuando las herramientas no existen, las construyo. Democratización del prototipado de alta fidelidad en 12+ equipos.",
      "tags": [
        "Tooling Interno",
        "Prototipado",
        "Innovación Proceso"
      ],
      "image": "/assets/images/projects/amazon-business.png",
      "metrics": {
        "primary": "-45%",
        "primaryLabel": "Tiempo Prototipado",
        "secondary": "12+",
        "secondaryLabel": "Equipos Usando Herramienta"
      }
    },
    {
      "id": "telefonica",
      "title": "Orígenes Técnicos",
      "company": "Telefónica",
      "year": "2014-2019",
      "impact": "2014–2019",
      "description": "Desarrollo de librerías frontend reutilizables para despliegue rápido de campañas. Rol de Creative Technologist como puente entre diseño e ingeniería. Fundación técnica establecida: 10+ años en las trincheras del frontend.",
      "tags": [
        "Creative Tech",
        "Frontend",
        "Librerías Componentes"
      ],
      "image": "/assets/images/projects/telefonica.png",
      "metrics": {
        "primary": "10+",
        "primaryLabel": "Años Frontend",
        "secondary": "Rápido",
        "secondaryLabel": "Despliegue Campañas"
      }
    }
  ],
  "ventureLab": {
    "title": "Cómo la IA me permitió operar como un equipo de ingeniería de 5 personas",
    "subtitle": "Technical Venture",
    "role": "Fundador & Solo Builder",
    "period": "2024 — Presente",
    "company": "BODADOS",
    "narrative": "Esto no va de la app. Va del proceso. Bodados demuestra que no solo lidero equipos humanos en Western Union—sé cómo orquestar fuerzas laborales sintéticas (agentes de IA) para construir software complejo. Esta es una habilidad futurista que me posiciona por delante de la curva.",
    "pillars": [
      {
        "title": "Orquestación IA",
        "description": "Construcción y coordinación de múltiples agentes de IA (Antigravity) que manejan generación de código, testing y despliegue."
      },
      {
        "title": "Dirección Técnica",
        "description": "Selección de stack (Next.js, Supabase) para maximizar ROI. Ciclos de desarrollo reducidos un 70%."
      },
      {
        "title": "Validación de Negocio",
        "description": "Testing de mercado real: invitaciones como vectores virales, dinámicas de cashflow, y optimización del k-factor."
      }
    ],
    "productModel": [
      {
        "stage": "Input",
        "items": [
          "Hipótesis de Mercado",
          "Investigación Usuario",
          "Restricciones Técnicas"
        ]
      },
      {
        "stage": "Agentes IA",
        "items": [
          "Framework Antigravity",
          "Generación Código",
          "Auto-Testing"
        ]
      },
      {
        "stage": "Output",
        "items": [
          "Software Producción",
          "Aprendizaje Validado",
          "Infraestructura Escalable"
        ]
      }
    ],
    "link": "https://bodados.com"
  },
  "experience": [
    {
      "period": "2024 — Presente",
      "company": "BODADOS",
      "role": "Operational Strategy Lead (Founder)",
      "description": "Orquestando 'Wedding OS'. Liderazgo de producto end-to-end: desde la visión de negocio y roadmap hasta la arquitectura técnica y gestión de agentes IA."
    },
    {
      "period": "2023 — Presente",
      "company": "Western Union",
      "role": "UX Manager (Estrategia y Gobernanza)",
      "description": "Arquitectando el Sistema de Diseño multimarca europeo. Consolidación radical de 146 componentes en 10 primitivos atómicos. Impulsando el cambio cultural mediante Systems Thinking en Digital, App y Retail físico."
    },
    {
      "period": "2020 — 2023",
      "company": "Amazon Alexa",
      "role": "UX Engineer Manager",
      "description": "Lideré el primer sistema de diseño de voz del mundo para Alexa. Ingenié prototipos de alta fidelidad para 'Rufus' presentados al CEO Andy Jassy. Reduje los tiempos de integración en 6 meses globalmente."
    },
    {
      "period": "2021 — Presente",
      "company": "Mr Marcel School / UOC",
      "role": "Profesor de UX y Sistemas de Diseño",
      "description": "Formando a la próxima generación de Arquitectos de Producto. Foco en la intersección de Systems Thinking, flujos de trabajo impulsados por IA y ROI cuantificable. Soy el poli malo y convenzo a los diseñadores para salir de la zona de comfort y saber leer (que no escribir) código."
    }
  ],
  "principles": [
    {
      "title": "El Código es la Verdad",
      "content": "Si no está en producción, es solo una opinión. El diseño es una hipótesis; el código es la única validación real."
    },
    {
      "title": "Sistemas > Componentes",
      "content": "No construyo bibliotecas de UI estáticas. Diseño flujos de decisión y arquitecturas que escalan con el negocio."
    },
    {
      "title": "03 — IA como Multiplicador",
      "content": "Apalancar IA para colapsar ciclos de exploración y boilerplate, reservando la inteligencia humana para validación estratégica y casos límite."
    }
  ],
  "advisory": [
    {
      "title": "Socio Estratégico para VPs",
      "description": "Traduzco objetivos de negocio en ejecución técnica. Ayudo a VPs de Ingeniería y Producto a alinear sus organizaciones."
    },
    {
      "title": "Diseño Organizacional",
      "description": "Ayudo a definir roles, ladders y procesos de contratación para crear equipos de Design Engineering de alto rendimiento."
    },
    {
      "title": "Tech Due Diligence",
      "description": "Auditoría de arquitectura y escalabilidad para inversores y fundadores. Identificación de deuda técnica crítica antes de escalar."
    }
  ],
  "now": {
    "lastUpdated": "15 Ene, 2026",
    "location": "Madrid, España",
    "status": "Construyendo y Enseñando",
    "items": [
      {
        "title": "Cultivando este Jardín Digital",
        "description": "Alejándome de los portfolios estáticos. Tratando este sitio como un sistema vivo donde la ingeniería de diseño y la IA se encuentran. Construido con vanilla JS y datos puros, sin frameworks, solo oficio."
      },
      {
        "title": "Modo Incógnito: Redefiniendo los Eventos",
        "description": "Construyendo una plataforma independiente para transformar cómo vivimos los encuentros en vivo. Creando un puente entre oficio, comunidad y el escenario."
      },
      {
        "title": "Explorando Design Ops Agénticos",
        "description": "Construyendo herramientas privadas para automatizar las partes aburridas de la gestión de diseño (renombrado, linting, handoff) usando LLMs."
      }
    ],
    "reading": {
      "title": "The Timeless Way of Building",
      "author": "Christopher Alexander"
    }
  },
  "links": {
    "substack": "https://joanarbo.notion.site/?pvs=74",
    "linkedin": "https://www.linkedin.com/in/joanarbo/",
    "email": "me@joanarbo.com"
  },
  "testimonials": [],
  "playground": [],
  "services": [
    {
      "id": "ds-mentorship",
      "icon": "ph-student",
      "title": "Mentoría de Design Systems",
      "description": "Sesiones 1:1 para líderes de Diseño e Ingeniería. Desbloquea problemas de gobernanza, arquitectura o carrera.",
      "price": "€250 / sesión",
      "features": [
        "Revisión de arquitectura",
        "Estrategia de adopción",
        "Resolución de bloqueos políticos",
        "Career path para Design Technologists"
      ],
      "cta": "Reservar sesión"
    },
    {
      "id": "build-with-me",
      "icon": "ph-code",
      "title": "Build With Me (Día)",
      "description": "Un día entero construyendo juntos. Tú y yo, en vivo. Prototipamos, codeamos y resolvemos un problema real de tu sistema.",
      "price": "€1,200 / día",
      "features": [
        "8 horas de foco intenso",
        "Pair programming real",
        "Auditoría en tiempo real",
        "Entrega de código funcional"
      ],
      "cta": "Agendar día"
    },
    {
      "id": "ds-audit",
      "icon": "ph-check-circle",
      "title": "Auditoría de Design System",
      "description": "Auditoría técnica y de procesos. En 2 semanas te digo exactamente por qué tu sistema no escala y cómo arreglarlo.",
      "price": "Desde €3,500",
      "features": [
        "Análisis de deuda técnica",
        "Revisión de consistencia visual",
        "Entrevistas con equipos",
        "Roadmap de refactorización"
      ],
      "cta": "Solicitar auditoría"
    }
  ],
  "stack": {
    "software": [
      {
        "name": "Cursor + Antigravity",
        "desc": "Editor de código AI-first. Mi herramienta diaria."
      },
      {
        "name": "Warp",
        "desc": "Gemini y Perplexity para exploración y NotebookLM"
      },
      {
        "name": "Figma",
        "desc": "Donde empiezan los sistemas de diseño."
      },
      {
        "name": "Notion",
        "desc": "Segundo cerebro y OS."
      }
    ],
    "analog": [
      {
        "name": "Leuchtturm1917",
        "desc": "Dotted A5. Bullet journaling diario."
      },
      {
        "name": "Rotring 600",
        "desc": "Lápiz de dibujo. Ingeniería alemana."
      },
      {
        "name": "Field Notes",
        "desc": "Para capturas rápidas."
      }
    ]
  },
  "caseStudies": [
    {
      "id": "bodados",
      "title": "BODADOS: Tesis de Liderazgo de Producto",
      "status": "Venture Lab",
      "company": "BODADOS",
      "year": "2024",
      "role": "Operational Strategy Lead (Founder)",
      "timeline": "Ongoing",
      "myRole": "Estrategia de Producto End-to-End",
      "team": "Agentes IA + Founder",
      "challenge": "Validar una tesis de negocio compleja (SaaS vertical para bodas) minimizando el capital riesgo y maximizando la velocidad de ejecución.",
      "solution": "Un 'Living Lab' donde aplico estrategia de producto, gestión de roadmap y validación de hipótesis de negocio con recursos limitados (IA Agents).",
      "businessImpact": "Demostración de capacidad de ejecución 'Hands-on' y visión de negocio completa. Validación de canales de adquisición y modelos de revenue.",
      "architecture": "Arquitectura optimizada para iteración rápida (Supabase, Next.js).",
      "content": "# Bodados: Mi Laboratorio de Liderazgo de Producto\n\nComo líder, creo que es vital mantenerse 'cerca del metal'. Bodados no es solo una app, es mi tesis de maestría en liderazgo de producto.\n\nEs un laboratorio vivo donde demuestro que puedo:\n\n1.  **Definir Visión y Estrategia**: Identificar un mercado fragmentado (bodas) y proponer una solución sistémica (Wedding OS).\n2.  **Gestionar Roadmaps Complejos**: Priorizar features críticas (Cashflow, Alergias) sobre 'nice-to-haves'.\n3.  **Ejecutar con Recursos Limitados**: Orquestar un equipo de Agentes de IA para suplir la falta de headcount, demostrando eficiencia operativa.\n\n***\n\n## 🧩 Visión de Negocio\n\nEl mercado de bodas sufre de falta de transparencia y herramientas obsoletas. Mi estrategia se centra en resolver el 'drama social' y la 'fricción financiera' mediante grafos sociales y previsión de cashflow.\n\n***\n\n## ⚡ Liderazgo Técnico y Ejecución\n\nMás allá de la estrategia, Bodados demuestra que puedo bajar al barro y tomar decisiones técnicas que maximizan el ROI. Elegir Next.js y Supabase no fue una preferencia personal, fue una decisión de negocio para reducir el Time-to-Market.",
      "impact": {
        "adoption": "Product",
        "adoptionLabel": "Visión",
        "efficiency": "Biz",
        "efficiencyLabel": "Estrategia",
        "consistency": "Exec",
        "consistencyLabel": "Ejecución"
      },
      "technologies": [
        "Product Strategy",
        "Roadmap Mgmt",
        "Business Logic",
        "AI Ops"
      ],
      "image": "/assets/images/case-studies/bodados.png",
      "link": "https://bodados.com"
    },
    {
      "id": "western-union",
      "title": "Racionalización Radical",
      "status": "En curso - 2023-Presente",
      "company": "Western Union",
      "year": "2023-Presente",
      "leadership": true,
      "role": "UX Manager & Design System Lead (Europe)",
      "timeline": "En curso",
      "myRole": "Líder de Arquitectura Estratégica y Gobernanza",
      "team": "Madrid, Seattle, Londres, Chicago",
      "description": "No un rediseño cosmético, sino una auditoría sistémica y estrategia de gobernanza federada. Implementación de una 'Fuente de Verdad' (Single Source of Truth) basada en tokens de diseño. Infraestructura escalable que permite localización rápida en 4+ países.",
      "challenge": "Fragmentación visual global y redundancia operativa costando millones.",
      "solution": "Consolidación estratégica: de 146 componentes a 10 primitivos. Implantación de modelo de gobernanza para 4 mercados.",
      "businessImpact": "Reducción de OpEx en mantenimiento y aceleración de delivery en equipos distribuidos.",
      "architecture": "Arquitectura multimarca basada en tokens integrada con APIs para sincronización visual.",
      "impact": {
        "adoption": "100%",
        "adoptionLabel": "Consistencia de Marca",
        "efficiency": "93%",
        "efficiencyLabel": "Reducción Componentes",
        "consistency": "4+",
        "consistencyLabel": "Países Sincronizados"
      },
      "technologies": [
        "Design Tokens",
        "Modelos de Gobernanza",
        "Escalado Multimarca",
        "Cumplimiento Regulatorio",
        "Integración API-Token"
      ],
      "image": "/assets/images/case-studies/wu-ds.png",
      "link": "#western-union"
    },
    {
      "id": "alexa-multimodal",
      "title": "Innovación Multimodal",
      "status": "ON HOLD - 2020-2022",
      "company": "Amazon",
      "year": "2020-2022",
      "leadership": true,
      "role": "UX Engineer Manager",
      "timeline": "6 meses",
      "myRole": "Ingeniero de Producto (Asistente Rufus AI)",
      "team": "Madrid, Seattle, Londres, Chicago",
      "description": "Creación del primer sistema de diseño de voz del mundo. Prototipos de alta fidelidad para 'Rufus' (Next-Gen AI Assistant) presentados al CEO Andy Jassy. Estandarización de patrones VUI usados por millones de usuarios.",
      "challenge": "Definir estándares de experiencia para una tecnología emergente (Voz/Multimodal) sin referencias de mercado.",
      "solution": "Liderazgo de la definición de estándares VUI. Influencia en equipos de ingeniería ML para alinear tecnología con UX.",
      "businessImpact": "Presentación de visión estratégica al C-Level (Andy Jassy). Demostración de capacidad de innovar en ambigüedad.",
      "architecture": "El reto real era implantar un sistema de diseño en las tripas de los dispositivos Alexa que funciona principalmente con archivos JSON.",
      "impact": {
        "adoption": "Global",
        "adoptionLabel": "Escala",
        "efficiency": "6 meses",
        "efficiencyLabel": "Tiempo Ahorrado",
        "consistency": "Redifiniendo y escalando la definición de sistemas de diseño.",
        "consistencyLabel": "Sistemas de Diseño"
      },
      "technologies": [
        "Voice UI",
        "Diseño Multimodal",
        "Prototipado IA",
        "Rufus AI",
        "ML Handoff"
      ],
      "image": "/assets/images/case-studies/rufus.gif",
      "videoUrl": "https://youtu.be/uXkDMBNCoFo",
      "content": "# Rufus: Asistente de IA para Amazon Shopping\n\nRufus es un asistente de compras capacitado en el catálogo de productos de Amazon y en información de toda la web para responder a las preguntas de los clientes sobre necesidades de compra, productos y comparaciones.\n\n***\n\n## 🎥 Demostración de Rufus\n\n<div class=\"video-container\" style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; margin: 2rem 0; border-radius: var(--radius-md);\">\n  <iframe src=\"https://www.youtube.com/embed/uXkDMBNCoFo\" frameborder=\"0\" allowfullscreen style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%;\"></iframe>\n</div>\n\n***\n\n## 🧩 El Reto Multimodal\n\nEl verdadero desafío no fue solo crear un asistente de chat, sino integrar esa inteligencia en un ecosistema multimodal (Echo, FireTV, Mobile) donde la voz y la interfaz visual deben trabajar en perfecta sincronía.\n\n### Arquitectura Multimodal\n\n- **Sincronización de Estado**: Mantener el contexto de la conversación a través de diferentes dispositivos.\n- **Adaptabilidad de UI**: Renderizar componentes visuales que complementen la respuesta de voz sin saturar al usuario.\n- **Handoff de ML**: Traducir las intenciones del modelo probabilístico a una interfaz determinista y coherente.",
      "link": "#alexa-multimodal"
    },
    {
      "id": "amazon-business",
      "title": "Innovación en Tooling Intern",
      "status": "HERRAMIENTAS INTERNAS",
      "company": "Amazon Business",
      "year": "2021-2022",
      "role": "Senior UX Engineer",
      "timeline": "4 meses",
      "myRole": "Arquitecto Principal y Product Owner",
      "team": "Madrid, Hyderabad, Seattle, Austin, Tokio",
      "description": "Creación de 'Telescope': una herramienta interna para asistir el prototipado, reduciendo el tiempo de iteración en un 45%. Cuando las herramientas no existen, las construyo. Democratización del prototipado de alta fidelidad en más de 12 equipos.",
      "challenge": "Ciclos de validación lentos basados en herramientas de diseño estáticas que no reflejaban datos o restricciones de producción reales.",
      "solution": "Construí 'Telescope', una herramienta de prototipado basada en código adoptada globalmente para validación de alta fidelidad.",
      "businessImpact": "Reduje el tiempo de prototipado en un 45% (velocidad desarrollo frontend) globalmente y gané dos premios 'Most Peculiar Amazonian' por innovación.",
      "architecture": "Entorno basado en React capaz de renderizar prototipos de grado de producción con pipelines de datos en vivo. Muchos de los componentes al ser de tanta calidad terminaban usándose en producción.",
      "impact": {
        "adoption": "Global",
        "adoptionLabel": "Hubs Desplegados",
        "efficiency": "45%",
        "efficiencyLabel": "Velocidad Prototipado",
        "consistency": "Premiado",
        "consistencyLabel": "Amazon Innovation"
      },
      "technologies": [
        "React",
        "Validación Producto",
        "Diseño Code-First",
        "Herramientas Internas",
        "ROI Analytics"
      ],
      "leadership": true,
      "image": "/assets/images/case-studies/telescope.png",
      "link": "#amazon-business"
    }
  ]
}