{
  "posts": [
    {
      "id": "perihelion",
      "title": "Periheli: Trobant l'Estat de Flow en l'Era de la Interrupció de la IA",
      "date": "2025-10-28",
      "readTime": "Deep Dive",
      "description": "Com trobar l'estat de flow i el treball profund en una era d'interrupció de la IA. Una reflexió sobre el mestratge creatiu, els sistemes de disseny i l'ofici de la subtracció.",
      "content": "<iframe width=\"100%\" height=\"400\" src=\"https://www.youtube.com/embed/7tTCZOHUWFA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\nEn astronomia, el periheli és el punt en què un cos celeste s'acosta més al Sol. És el moment de màxima velocitat. Màxima intensitat. Després, s'allunya. Però aquest instant -aquest únic instant- conté tota l'energia acumulada del viatge.\n\nJiro Ono, el llegendari mestre de sushi, passa 70 anys buscant el seu periheli.\n\nNo l'anomena així. L'anomena perfecció. Puresa. Però és el mateix: aquest punt on tot convergeix. On el detall, la repetició i el silenci de dècades d'artesania es condensen en un sol gest.\n\nUn gra d'arròs. Un moviment de ganivet. Res més.\n\nTot.\n\n#\n\n#\n\n# I. Òrbita: Entenent el Procés Creatiu\n*[0:00 - 1:30: La introducció. Cordes suaus, gairebé inaudibles.]*\n\nQuan dissenyes, codifiques, crees - estàs en òrbita.\n\nAlguns dies lluny del centre. Dispers. Saltant entre tasques, eines, notificacions. La distància et protegeix. No crema. Però tampoc avances.\n\nAltres dies, més a prop. Les hores desapareixen. Oblides menjar. El codi flueix. El disseny respira. No penses en el que fas; simplement ho fas.\n\nÉs l'estat de flux. Aquest estat on el cervell allibera el control conscient i deixa que xarxes neuronals especialitzades -entrenades durant anys- treballin soles. Sense supervisió. Sense fricció.\n\nPerò hi ha un punt encara més profund.\n\nEl Periheli.\n\n#\n\n#\n\n# II. Aproximació: El Camí al Mestratge\n*[1:30 - 3:00: Entra el piano. Les cordes comencen a tensar-se.]*\n\nCharles Eames deia: \"Els detalls no són només detalls. Fan el disseny.\"\n\nNo parlava d'ornament. Parlava d'essència.\n\nAquest lloc on si treus alguna cosa, tot col·lapsa. Si afegeixes alguna cosa, tot es contamina.\n\nÉs l'estat de flux. Aquest estat on el cervell allibera el control conscient i deixa que xarxes neuronals especialitzades -entrenades durant anys- treballin soles. Sense supervisió. Sense fricció.\n\nPerò hi ha un punt encara més profund.\n\nEl Periheli.\n\n#\n\n#\n\n# II. Aproximació: El Camí al Mestratge\n*[1:30 - 3:00: Entra el piano. Les cordes comencen a tensar-se.]*\n\nCharles Eames deia: \"Els detalls no són només detalls. Fan el disseny.\"\n\nNo parlava d'ornament. Parlava d'essència.\n\nAquest lloc on si treus alguna cosa, tot col·lapsa. Si afegeixes alguna cosa, tot es contamina.\n\nÉs el punt més proper a la veritat.\n\nI per arribar-hi, no pots apressar-te. Has d'orbitar. Una vegada i una altra. Observar. Iterar. Repetir el mateix moviment 10,000 vegades fins que el patró emergeix.\n\nJiro no va inventar el sushi. Va eliminar tot el que no era sushi.\n\nAquesta és la diferència.\n\nNosaltres afegim: variables, casos d'ús, excepcions, flexibilitat.\n\nL'anomenem \"cobertura.\"\n\nPerò el mestratge és l'oposat. És substracció. És dir: això, i només això, és necessari.\n\nI quan finalment arribes -quan toques aquest punt- tota la resta es revela com a obvi.\n\n#\n\n#\n\n# III. El Problema: La IA i la Fragmentació del Treball Profund\n*[3:00 - 4:30: Creix la tensió. Violín, viola. Capes acumulant-se.]*\n\nPerò ara alguna cosa ha canviat.\n\nLa IA és aquí. Cursor, Figma, models generatius xiuxiuejant en cada pausa.\n\nI per primera vegada en anys, és difícil aconseguir el periheli.\n\nPerquè el periheli requereix velocitat sostinguda en una direcció. Hores contínues. Immersió total. Aquesta desacceleració del món extern que permet l'acceleració interna.\n\nPerò la IA interromp.\n\nNo violentament. Amb suggeriments. Amb dreceres. Amb la promesa seductora que hi pots arribar més ràppid.\n\nI tècnicament, és cert. Pots generar més. Més components. Més codi. Més variacions.\n\nPerò més no és periheli.\n\nEl periheli és el punt de màxima proximitat, no de màxima producció.\n\nÉs estar tan a prop de l'essència que no hi ha distància entre tu i el que crees.\n\nI això no es pot accelerar.\n\n#\n\n#\n\n# IV. Òrbites Trencades: Perdent el Flow en l'Era de la IA\n*[4:30 - 5:45: El clímax comença a construir-se. Tot convergeix.]*\n\nHe notat alguna cosa.\n\nEl meu millor treball -el treball que realment ÉS alguna cosa- va néixer en llargues sessions. Ininterrompudes. Sense IA. Sense Slack. Sense navegador.\n\nNomés jo, el problema, i hores evaporant-se.\n\nAquest estat on l'escorça prefrontal s'apaga i les xarxes creatives treballen soles. On no supervises el teu propi pensament; simplement flueix.\n\nHipofrontalitat transitòria, l'anomenen els neurocientífics. El cervell deixant anar el control per permetre que emergeixi el que ja sap però no pot verbalitzar.\n\nLa IA no hi entra.\n\nNo perquè sigui incapaç. Perquè és un diàleg. I el diàleg et manté en l'escorça prefrontal—supervisant, avaluant, ajustant.\n\nMai deixant anar.\n\nMai arribant al periheli.\n\n#\n\n#\n\n# V. La Decisió: Protegint el Treball Profund i l'Estat de Flow\n*[5:45 - 7:00: El crescendo. Cordes en el seu pic.]*\n\nLa IA no és l'enemic.\n\nÉs una eina per a l'òrbita exterior. Per al que és superficial. Per al que escala.\n\nPerò el periheli -aquest punt de màxima proximitat al que és veritable- continua sent humà.\n\nContinua sent lent.\n\nContinua sent avorrit, de vegades.\n\nI requereix alguna cosa radical en un món de velocitat: protegir les llargues hores. Les sessions on desapareixes. On un detall consumeix el teu dia sencer i al final -només al final- veus que aquest detall ho era tot.\n\nApaga les notificacions.\n\nTanca Cursor.\n\nDeixa que el codi, el disseny, el problema et mirin de nou durant hores.\n\nFins que arribis al punt on no hi ha distància.\n\nOn tu ets el treball.\n\nOn toques el periheli.\n\n#\n\n#\n\n# VI. El Viatge: Abraçant l'Òrbita\n*[7:00 - 7:48: La resolució. Tot s’assenta. Silenci que respira.]*\n\nJiro, després de 70 anys, diu: \"Ningú sap on és el cim.\"\n\nNo hi ha arribat.\n\nPotser mai ho farà.\n\nPerò cada dia s'hi acosta més. Cada moviment. Cada repetició. Cada refinament mínim que ningú més nota.\n\nAquesta és l'òrbita.\n\nI el periheli no és un destí. És un instant. Fugaç. Intens. Veritable.\n\nI després te n'allunyes de nou.\n\nPerò saps que va existir. Que el vas tocar.\n\nI això ho canvia tot.\n\nL'essència és allà. A sota. Sempre.\n\nNomés has d'acostar-t'hi prou per sentir-la.\n\nPerò primer, has de deixar anar el control.\n\nDesconnectar.\n\nI deixar que l'òrbita et porti.\n\nQuan va ser l'última vegada que vas agafar el teu periheli? Comparteix la teva experiència als comentaris.\n\nSi això t'ha ressonat, subscriu-te per a més reflexions sobre sistemes de disseny, flux creatiu i mantenir-se humà en un món impulsat per IA.\n\n#FlowState #DeepWork #ProcésCreatiu #Mestratge #IAiCreativitat",
      "featured": true,
      "series": "IA i el Futur del Treball",
      "tags": [
        "Flow",
        "Treball Profund",
        "Filosofia"
      ],
      "image": "/assets/images/writing/perihelion.jpg"
    },
    {
      "id": "roi-design-system",
      "title": "Per què el teu Design System Manager no veu el ROI",
      "featured": true,
      "date": "2025-10-15",
      "readTime": "Management",
      "description": "Si el teu rol és de responsable de producte o tech lead, aquest post té mètriques, errors concrets i tècniques per elevar el valor real en la teva organització.",
      "content": "**Si 40 equips personalitzen el mateix botó, el teu Design System té un problema (i com detectar-ho)**\n\nEls equips de Design Systems en contextos complexos carreguen amb un problema silenciós:\n\nNingú sap amb certesa quant del que construeixen realment impacta en producció.\n\nTens documentació. Tens components. Tens governance.\n\nPerò no tens visibilitat.\n\nUn dia revises 3 productes diferents i trobes que el mateix component es va implementar de 4 formes distintes en cadascun.\n\nI passa en silenci. Sense que ningú ho vegi com un problema.\n\nAixò és la realitat d'escalar un sistema en contextos amb múltiples equips autònoms.\n\n**No és caos. És invisibilitat.**\n\n#\n\n#\n\n# **🧩 Com mesurar el ROI d'un Design System?**\nEn contextos financers complexos la situació és més complicada que en altres sectors.\n\nNo és només que tinguis múltiples productes: tens regulacions, auditories, compliment normatiu, i pressió constant per eficiència.\n\nUn canvi en tu sistema de disseny no és \"fast and furious\"; és coordinat, mesurat, rastrejat.\n\nAleshores, com mesures si el teu sistema funciona?\n\nAquí ve l'important:\n\n#\n\n#\n\n# **🎯 Per què comptar components no serveix?**\nHe vist líders dir: \"*Vam usar 450 instàncies del nostre botó el mes passat.*\"\n\nSona impressionant.\n\nNo significa res.\n\nPer què?\n\nUn botó dins d'un header que apareix en 30 pàgines: compta com a 1 o 30?\n\nUn component copiat i enganxat en 15 llocs compta cap al teu sistema o compta com a 15 fracassos?\n\nMés important: si construeixes 200 components però només 15 s'usen seriosament...\n\n**Realment tens un sistema o tens una biblioteca gegant que ningú manté?**\n\n> El que és brutal és que la majoria d'equips passa mesos mesurant números que no diuen res.\n\nNecessites canviar l'enfocament.\n\n**De \"freqüència absoluta\" a \"amplitud d'ús\".**\n\nNo \"quantes instàncies d'un component\".\n\nSinó **\"quants equips diferents usen aquest component.\"**\n\n#\n\n#\n\n# **📊 Quines són les mètriques mínimes viables?**\nPrimer sprint (Setmana 1-2):\n\nOblida 50 gràfics. Necessites 4 mètriques. Punt.\n\n1️⃣ **Cobertura visual**: Quin % de la teva interfície usa components DS?\n\n2️⃣ **Adopció per equip**: Quants equips usen el sistema?\n\n3️⃣ **Consistency score**: Quantes desviacions hi ha per producte?\n\n4️⃣ **Time to component**: Quant triguen els equips a implementar un component nou?\n\n**Això. És. Tot.**\n\n#\n\n#\n\n#\n\n# **Com crear el teu baseline en menys de dues hores?**\n\n* **Selecciona 3 productes reals de la teva companyia.**\n\n* **Compta manualment (sí, old school):**\n\n* Exemple: \"*En el flow d'onboarding, 7 de 10 pantalles usen components propis del DS.*\"\n\n* Aquest és el teu baseline: **70% de cobertura en onboarding.**\n\n* Defineun un objectiu realista a 90 dies, per exemple: **pujar-lo al 85%.**\n\n* **Calcula el teu \"consistency score\":**\n\n* Escull 20 pantalles representatives (tria 3-4 fluxos clau: onboarding, transferències, pagaments...).\n\n* Revisa visualment i pren nota d'incoherències:\n\n* \"Aquest botó té padding de 12px aquí, 16px allà.\"\n\n* \"Aquest input porta vora, en el següent no.\"\n\n* Si el teu DS cobreix només un 65% en alta d'usuari, el 35% restant és deute visual i funcional que creixerà amb cada release.\n\n* **Registra cada desviació (aquest és el teu score inicial).**\n\n**Truc per escalar sense tornar-te boig:**\n\n* Pots accelerar aquest procés automatitzant part de l'anàlisi:\n\n* Puja les captures d'aquestes 20 pantalles a una carpeta.\n\n* Llança un script senzill (per exemple, a Cursor) o usa una eina que detecti inconsistències visuals o a nivell de codi.\n\n* Al final obtindràs una cosa així:\n\n* \"En aquestes 20 pantalles he trobat X desviacions. Les més crítiques són: Button padding (8 vegades), Input border (6), Spacing en cards (4).\"\n\n#\n\n#\n\n# **🔥 Quina és la mètrica que ningú mesura però hauria?**\nAquí ve el que et fa brillar:\n\nCada vegada que un equip detacha o customitza un component existent (en lloc d'usar-lo directe), ho registren.\n\nSimple: un comment al Figma o un tiquet.\n\n\"Usem Button però amb border-radius customitzat perquè el nostre cas d'ús és diferent.\"\n\nAhora multiplica.\n\n**Si 40 equips detachen el Button de 5 maneres diferents = mateix problema resolt 40 vegades.**\n\nTraducció: **malbaratament massiu.**\n\nHores perdudes. Inconsistència en producció. Deute tècnic acumulat.\n\nPero aquí hi ha el que és fascinant.\n\nCada detach que registris és un insight pur.\n\n**No és error d'adoption.**\n\n**Es error de disseny.**\n\nPerquè ara saps exactament on iterar.\n\n#\n\n#\n\n# **💡 El script que ho canvia tot**\nAquí tens el copy final per explicar l'escaneig per codi (sin Figma) i amb el teu to clar i tècnic:\n\n**Com saber quants equips realment usen el teu component estàndard i quants fan la seva per lliure?**\n\nUn script senzill t'ho dóna en minuts.<br>No toca Figma ni docs—només codi real.\n\n**Escaneja automàticament tota la base de codi:**<br>Busca importacions del tipus:\n\n```\n<code>import { Button } from 'design-system';</code>\n```\nCompta cada import i el agrupa per carpeta, equip, o context (pots mapejar això al teu monorepo o naming de projectes).\n\n**Detecta \"còpies\" i personalitzacions:**<br>Localiza components que s'anomenen igual peró es redefineixen localment, o que estenen l'original amb estils, props o codi duplicat.<br>Exemple:\n\n```\nimport { Button } from 'design-system';\n\n// Creo una variant per a casos especials\nconst DangerButton = (props) => (\n  <Button {...props} color=\"red\" />\n);\n```\nCada cas suma com a \"instància customitzada\".\n\n**Et treu un informe real:**\n\n```\nEquip Onboarding: 11 imports estàndard, 2 custom \nEquip Comptes: 17 imports estàndard, 7 custom \nEquip Pagaments: 13 imports estàndard, 1 custom\n```\nAixí veus, sense interpretació, quins equips adopten el 100% del patró i quins el \"trenquen\".\n\n**Pots extreure extra info:**<br>L'script et llista també les props usades, variants més freqüents, o props sospitoses de ser hack:\n\n```\n<Button size=\"large\" color=\"error\" style={{borderRadius: 20}} />\n```\n**Què hi guanyes?**\n\n* Dades accionables per saber quins components funcionen i quins conviden a custom.\n\n* Arguments sòlids per prioritzar refactors (\"aquest equip el trenca sempre, parlem amb ells\").\n\n* Una visió de veritat sobre la salut i adopció del teu Design System—la mètrica que de debò importa.\n\n**Zero human esforç després del setup (2 hores màxim).**\n\n#\n\n#\n\n# **🧠 Predicció d'adoption abans que falli**\nAquí és on brilla el machine learning simple (i no ho dic com a AI hype).\n\nEl patró és clar:\n\nSi veus que components similars van ser detachats 3+ vegades en els últims 90 dies...\n\nEl component nou que llançaràs **probablement TAMBIÉN será detachat.**\n\nPer què?\n\nPerquè hi ha un patró no resuelto en aquest domini de components.\n\nAleshores, abans de llançar aquest component nou, pots:\n\n* Detectar automàticament el patró de detach històric\n\n* Correlacionar-ho amb el nou component\n\n* **Generar alertes**: \"Aquest Button té 8 desviacions en l'històric. El teu nou component té similituds. Revisa aquests 3 casos d'ús abans de llançar.\"\n\n> Bàsicament, **predius si alguna cosa fallarà abans que falli.**\n\nEl dissenyador no es frustra. El component surt millor.\n\nAdoption puja automàticament perquè has resolt el problema real.\n\n#\n\n#\n\n# **📈 Com creix això sense trencar-se**\n**Mes 1:** 50% de cobertura en 2 productes pilot. Baseline lleig però honest.\n\n**Mes 2:** Líders veuen el problema. Assignen recursos per millorar components rebutjats.\n\n**Mes 3:** Cobertura puja al 68%. Equips comencen a demanar nous components (bon senyal).\n\n**Mes 4-6:** Escala a altres productes. Cada producte nou que entra, ja comença al 65% de cobertura perquè entenen el patró.\n\n**Mes 12:** **80% de cobertura global. Sistema mantingut per 2 persones. Estalvi anual estimat: €200k-400k en hores de disseny/dev.**\n\n#\n\n#\n\n#\n\n# **❌ El que NO facis**\nNo comparis amb altres empreses.\n\n**Cada banca és diferent. Cada context és diferent. Cada design system és diferent.**\n\nAquí és on la majoria falla:\n\n* Figma diu que la millor pràctica és tenir 80% de components reutilitzables.\n\n* Una altra banca té 6 dissenyadors i 50 components.\n\n* Design Systems Collective diu que hauria de tenir X mètrica.\n\n* Oblidar preguntar als equips per què detachen components.\n\n* Mesurar només la freqüència en lloc d'entendre el patró.\n\n* Comparar el teu sistema amb bancs que tenen realitats regulatòries i de negoci distintes.\n\nOblida-ho tot.\n\n**El teu Design System és submís al projecte, no al revés.**\n\nLas normas de Figma no son las teves.\n\nLas millors pràctiques d'una altra banca no son les teves.\n\n**Per què?**\n\n* Perquè el teu context té regulacions específiques.\n\n* Té equips amb dinàmiques que no són les d'una altra banca.\n\n* Té històries de codi i decisions que una altra empresa mai va enfrontar.\n\n> **Inverteix a conèixer el teu context.<br>*****Un simple log de quan i per què es detacha un botó pot estalviar milers d'euros/mes en suport i QA.***\n\ndesprés, dissenya les teves mètriques des d'allà. No des del que altres fan.\n\n**<br>Mites freqüents en mètriques DS bancàries:**\n\n* \"Més components = més maduresa\". Fals. (He vist bancs amb +200 components que no aconsegueixen ni el 60% de coherència visual.)\n\n* \"Estàndard només importa en UX\". Fals: en banca, l'auditor legal usa les teves pantalles com a evidència.\n\n* \"Comparar amb benchmarks d'altres empreses\". Fals, el teu context mana.\n\n#\n\n#\n\n# **🚀 El teu primer moviment (propers 7 dies)**\n\n* Pren 1 producte. Mira 3 flows complets.\n\n* Compta: quants components són DS, quants són custom.\n\n* Aquest % és el teu baseline.\n\n* Fixa objectiu a 90 dies: +15%.\n\n* Reuneix-te amb 2 equips. Pregunta: \"Quin component necessitaries que no existeix? Quin component nostre és un problema?\"\n\n**Això és suficient per moure l'agulla.**\n\n**Key Takeaways / Accions per a responsables:**\n\n* *Mesura equips, no només instàncies.*\n\n* *Registra cada custom, és un senyal estratègic.*\n\n* *Pregunta a equips per què adapten.*\n\n* *Ajusta el score regularment: els productes bancaris evolucionen cada trimestre.*\n\n> ***Si vols que el teu equip o el teu mànager vegi l'impacte, imprimeix aquest checklist i usa'l el proper trimestre.***\n\n**Per a aprofundir:**\n\n* **Auditories automàtiques en Design Systems:**<br>**[Design System Metrics: From Adoption to Impact (by Zeroheight & DS expert Nathan Curtis)](https://blog.zeroheight.com/design-system-metrics-adoption-impact/)**\n\n* **Com analitzar l'amplitud real d'ús amb codi:**<br>**[Measure Adoption of a Design System with Automated Scripts (Medium, Ryan Clark)](https://uxdesign.cc/measuring-adoption-of-a-design-system-32293ffb351c)**\n\n* **Mètrics reals i tooling per a Product Managers:**<br>**[Product Metrics: Find the North Star (by Intercom)](https://www.intercom.com/blog/product-metrics-north-star/)**\n\n* **Com detectar \"custom forks\" en llibreries de components:**<br>**[Detecting UI Consistency and Component Forks in Large Codebases (by Engineering @Airbnb)](https://medium.com/airbnb-engineering/design-system-science-cc0dc49dec10)**\n\n* **Guia avançada de governance per a entorns complexos:**<br>**[Governance of Design Systems in Large Organizations (by Sparkbox)](https://seesparkbox.com/foundry/design_systems_governance_perspectives)**\n\n**Quin seria l'estalvi en hores (o reducció de deute tècnic) si poguessis visualitzar totes les personalitzacions que avui estan ocultes?**\n\n#DesignSystems #Banca #ProductLeadership #Mètriques #Eficiència",
      "tags": [
        "Gestió",
        "ROI",
        "Estratègia"
      ],
      "featured": true,
      "series": "Mestratge en Design Systems",
      "image": "/assets/images/writing/roi-design-system.png"
    },
    {
      "id": "interface-dependency",
      "title": "La teva interfície és el teu producte. Els agents la ignoren.",
      "featured": true,
      "date": "2025-10-01",
      "readTime": "Future Tech",
      "description": "El meu repte des d'Alexa fins a avui: construir sistemes que funcionen fins i tot on no hi ha pantalles. Què passa quan la UI desapareix?",
      "content": "Deixa'm explicar-te una història en dues parts.\n\nLa primera és complexa, però marca l'abans i el després (i explica per què **segueixo enganxat a aquest dilema**).\n\nLa segona és pràctica: **com pots aprofitar-ho avui**.\n\n<h2>**PARTE 1: Alexa Shopping i el dilema de les capes**</h2>Quan treballava a Amazon Alexa Shopping, mesos abans del hype de ChatGPT, em vaig obsessionar amb una pregunta:\n\n**Com dissenyes un sistema de compra que funcioni igual de bé en veu, pantalles, wearables i múltiples idiomes sense haver de reconstruir-ho tot cada vegada?**\n\n> Vaig passar 6 mesos donant-hi voltes. No hi havia referències, ni gurús ni literatura sobre \"**Design Systems multimodals aplicats a shopping**\".\n\nEn lloc de fluxos lineals (buscar -> veure producte -> afegir al carret -> pagar), vaig proposar quelcom diferent: agrupar moments en el temps.\n\nNo paths únics. Multi-camí.\n\nPerò aquí ve la part tècnica que em tenia obsessionat:\n\n**Cada \"moment\" no era un component fix del Design System. Era un grup d'informació que s'autogenerava en un component multimodal al vol.**\n\nDeixa'm explicar això perquè és el nucli de tot:\n\n#\n\n#\n\n# **El component multimodal autogenerat**\nEn un Design System tradicional tens:\n\n* Un botó\n\n* Una card de producte\n\n* Un formulari de pagament\n\nSón components **predissenyats i estàtics**.\n\nEn un sistema multimodal, tens **grups d'informació** que es converteixen en components segons el context:\n\n**Grup d'informació: \"Confirmació de compra de piles AA\"**\n\nConté:\n\n* Nom del producte\n\n* Preu\n\n* Mètode de pagament guardat\n\n* Adreça d'enviament\n\n* Data estimada de lliurament\n\n**I aquest grup s'autorenderitza com:**\n\n🔲 **En Echo Show (visual + veu):**\n\n-> Card amb imatge del producte\n\n-> Botó \"Comprar amb 1-Click\"\n\n-> Veu: \"Confirmo la teva comanda de piles Duracell per €8.99?\"\n\n🗣️ **En Echo Dot (només veu + llum):**\n\n-> No hi ha visual\n\n-> Veu: \"Piles Duracell AA, €8.99, arriben demà. Digues 'confirmar' o 'cancel·lar'\"\n\n-> Anell LED blau polsant (esperant resposta) -> verd (confirmat) -> vermell (cancel·lat)\n\n👆 **En app mòbil (visual + touch):**\n\n-> Card expandible amb detalls complets\n\n-> Botó gran \"Confirmar compra\"\n\n-> Swipe cap amunt per veure més opcions\n\n📱 **En smartwatch (notificació mínima):**\n\n-> \"La teva comanda habitual de piles - €8.99\"\n\n-> Dos botons: ✓ i ✗\n\n-> Vibració en confirmar\n\n🤖 **En agent d'IA (només API):**\n\n-> No hi ha visual ni veu\n\n-> Consumeix endpoint: <code>POST /orders/confirm</code>\n\n-> Rep: <code>{orderId, status, estimatedDelivery}</code>\n\n#\n\n#\n\n# **I aquí hi ha la màgia:**\n**El mateix grup d'informació genera 5 components diferents automàticament.**\n\nNo construeixes 5 components separats.\n\nConstrueixes **un sistema que sap què renderitzar segons el dispositiu**.\n\nEl millor és que:\n\n**Quan l'usuari canvia de dispositiu a meitat del flux, el component es regenera en el nou context sense perdre l'estat.**\n\n#\n\n#\n\n# Exemple real (més enllà del típic cross-device):\nSuposa que no només el flux es repèn entre dispositius, sinó que el component es reconfigura en tempo real segons el \"grup d'informació\" i el canal on apareix.\n\n* L'usuari està cuinant i pregunta a Alexa en veu: \"Queda oli?\"\n\n* Alexa respon amb veu: \"En queda poc. Pots demanar el teu preferit.\"\n\n* Alexa activa el component \"comanda recurrent\" en mode només veu, preguntant: \"Te l'encarrego per a avui?\"\n\n* L'usuari respon amb un gest (acostar la mà a l'Alexa):\n\n* El sistema tradueix aquest gest com a \"sí, demanar oli\" perquè el patró de llum i la distància estan configurats per a aquesta acció.\n\n* Sense intervenció humana, el sistema agrupa tota la info rellevant (producte, adreça, mètode de pagament, historial) en un objecte base que pot interpretar-se en qualsevol context.\n\n* L'usuari, ja fora de casa, obre l'app mòbil d'Amazon:\n\n* El sistema detecta el canal de canvi i **genera a l'instant un component touch**, amb botó \"Cancel·lar comanda\", opcions de canviar la marca, i notificació amb el resum.\n\n* Tot l'estat, opcions i context del flux es mantenen, però **el component no és el mateix que a l'Alexa: s'adapta automàticament a les capacitats tàctils i visuals del dispositiu**.\n\nEl sistema entén que no existeix \"un botó d'encarregar oli\", sinó **l'essència de la comanda**, que pot prendre cos com a frase de veu, opció en pantalla, vibració en un wearable, o petició a una API d'agent d'IA.\n\nAixí cada \"moment\" de l'experiència és **multimodal i adaptable**, no només cross-device.\n\n> **Mateix flux. Múltiples dispositius. Un sol sistema.**\n\nI això era possible perquè cada component multimodal tenia aquestes capes:\n\n🔲 **Capa visual:** components 2D del DS tradicional (cards, botons, formularis)\n\n🗣️ **Capa conversacional:** fragments de text per a veu\n\n👆 **Capa d'input:** regles d'interacció (touch, veu, gests, sensors de distància)\n\n🔌 **Capa de dades:** API amb el grup d'informació\n\n🧭 **Capa de navegació:** regles de transició (d'on vens, a on vas)\n\nDepenent del dispositiu, el sistema activava les capes necessàries **i generava el component al vol**.\n\nEl 2022, això sonava abstracte. \n\nPerquè això no escala quan tens 15 tipus de dispositius Alexa diferents, més app mòbil, més web, més wearables.\n\nEl 2025, amb agents d'IA comprant sols...\n\n<h2>**PARTE 2: Per què això importa i com aprofitar-ho ara**</h2>El que ha canviat aquesta setmana:\n\nEls agents d'IA ja compren sols.<br><br>**Preguntes a un assistent: *****\"Contracta 10 creadors per a la meva campanya\"*****.**\n\n**L'agent busca, compara, paga els $50 amb el teu permís previ, i t'entrega resultats.**\n\nSense app. Sense checkout. Sense formularis.\n\n**L'agent d'IA és només un altre \"dispositiu\" més, encara que actuï sense visual ni veu. Només lògica de negoci.**\n\n#\n\n#\n\n#\n\n# **Les dades que ho avalen**\nAixò no és ciència-ficció. Els números són clars:\n\n📊 **$1.7 bilions** en comerç impulsat per IA projectats per al 2030 (Edgar Dunn & Co.)\n\n📊 **25% de vendes online** seran realitzades per agents d'IA per a llavors (PayPal CEO)\n\n📊 **1M+ merchants** a Shopify ja habilitats per vendre a través d'agents conversacionals\n\n📊 **58% d'institucions financeres** atribueixen creixement d'ingressos a l'IA (McKinsey)\n\n**A Alexa Shopping el 2022, això era un experiment.**\n\n> **El 2025, com agents comprant sols, és la propera onada.**\n\n#\n\n#\n\n# **El cas que ho fa tangible: quan Stripe va entendre el joc**\nStripe ho exemplifica perfectament:\n\nUna sola API i context, infinits usos.<br>No integracions manuals sinó regles, tokens i components que s'adapten a cada canal.<br>Si necessites un nou component per a cada context, et quedes enrere.<br>Si dífines bé els grups d'informació, el sistema s'autogenera i escala sol.\n\n**Com començar a construir per a aquest futur (sin reescriure-ho tot)**\n\nLa bona notícia: no necessites llençar el teu sistema actual.\n\n<h2>**Com començar?**</h2>Pots començar aplicant aquests principis pas a pas:\n\n#\n\n#\n\n# **1. Deixa de pensar en components fixos. Comença a pensar en grups d'informació.**\nEn lloc de dissenyar \"una card de producte\", pregunta't:\n\nQuina informació crítica necesito mostrar en aquest moment?\n\n(Nom, preu, disponibilitat, mètode de pagament...)\n\nDesprés defineix com aquesta informació es renderitza segons el context:\n\n* **Visual:** card + botó\n\n* **Veu:** frase + confirmació\n\n* **API:** JSON amb les mateixes dades\n\n* **Wearable:** notificació mínima\n\n#\n\n#\n\n# **2. Separa dades de presentació.**\nEl teu \"grup d'informació\" ha de viure en una capa de dades independent.\n\nLa capa de presentació decideix com mostrar-lo segons el dispositiu.\n\n#\n\n#\n\n# **3. Fes que els teus components siguin capaços de continuar en múltiples dispositius.**\nL'estat del flux no hauria de viure en el component visual.\n\nHauria de viure en una capa de navegació que persisteix entre dispositius.\n\nExemple: l'usuari comença en veu, continua en app, finalitza en web.\n\n**Mateix flux. Múltiples contextos.**\n\n#\n\n#\n\n# **4. Converteix processos manuals en regles de renderitzat automàtiques.**\nEn lloc de crear manualment variants per a cada context, defineix regles:\n\n\"Si dispositiu = Alexa Dot -> només veu\"\n\n\"Si dispositiu = Echo Show -> veu + visual\"\n\n\"Si dispositiu = agent IA -> només API\"\n\n#\n\n#\n\n# **5. Fes la traçabilitat automàtica, no opcional.**\nCada component autogenerat ha de registrar:\n\n* Quina informació contenia?\n\n* En quin dispositiu es va renderitzar?\n\n* Quines capes es van activar?\n\n* Com va respondre l'usuari?\n\nTot auditable. Sempre.\n\n**Per què això em té tan entusiasmat**\n\nFa 3 anys, a Alexa Shopping, vaig començar a explorar components multimodals per a compres. Ni tan sols sabia si algú entendria el perquè, però estava decidit a portar el Sistema de Disseny al següent nivell.\n\nAvui veig agents d'IA comprant en mil·lisegons, saltant entre contextos, gestionando permisos...\n\nI penso: **això és exactament el que intentàvem resoldre.**\n\nLa diferència és que llavors no hi havia demanda massiva.\n\nAra, amb $1.7 bilions projectats en comerç agèntic per al 2030...\n\nJa no és un experiment.\n\nPerò per ara, la pregunta és senzilla:\n\n**Fins a quin punt els teus components s'adapten o només es copien a cada canal?**\n\nPerquè aquesta és la diferència entre escalar i haver de crear una variant nova cada vegada que canvia alguna cosa.\n\n💬 **M'encantaria llegir els teus casos, reptes o dubtes. Alguna vegada has aconseguit que un mateix flux visqués en mil contextos sense refer components?**\"\n\nDeixa-ho en els comentaris. Vull saber què estan explorando altres equips.\n\n</a>#DesignSystems #ProductLeadership #APIs #IA #AgenticCommerce #Multimodal #AlexaShopping",
      "tags": [
        "Agents IA",
        "Headless",
        "UI de Veu"
      ],
      "series": "IA i el Futuro del Treball",
      "featured": true,
      "series": "IA i el Futur del Treball",
      "image": "/assets/images/writing/interface-dependency.png"
    },
    {
      "id": "invisible-system",
      "title": "El millor Design System és el que no es veu",
      "date": "2025-09-20",
      "readTime": "Philosophy",
      "description": "La fontaneria només es converteix en la protagonista quan falla. Un bon sistema de disseny ha de ser transparent per al desenvolupador.",
      "content": "He treballat amb sistemes que tenien més de 100 components.\n\nEl més curiós és que, arribat un punt, ningú de l'equip sabia realment quin era el correcte per a cada context.\n\nLes discussions eternes, els tiquets que es traspaperaven, els bloquejos en legal per falta de traçabilitat, i els desenvolupadors perdent la concentració cada dos x tres...\n\nEl resultat era clar: el sistema no era invisible.\n\n**Era sorollós. I car.**\n\nLa infraestructura ben dissenyada desapareix.\n\n**Com la fontaneria d'una ciutat: només la notes quan falla.**\n\n<h2>**❌ El problema que ningú admet:**</h2>La majoria de Design Systems en banca són catàlegs d'UI amb manual de marca.\n\n**Bonics ✨<br>Documentats 📚<br>Inútils 🗑️**\n\nPerquè no resolen el problema real:\n\n* Equips perdent dies debatent quin botó fer servir\n\n* Developers perdent context cada dos tiquets\n\n* Legal bloquejant canvis per falta de traçabilitat\n\n* Ningú mesurant el deute invisible\n\nAquest temps perdut recuperant el focus després de cada interrupció.\n\nNo ho veus en dashboards.<br>Però és el que destrueix sprints.\n\n<h2>**✅ Com es construeix un sistema invisible:**</h2>\n\n#\n\n#\n\n#\n\n# **1️⃣ Nucli petit i innegociable**\n10-15 components core.<br>No 146.\n\nLa resta són variants o composicions.\n\n**Per què importa?**\n\n* Si tens 146 components, segur que tens 12 botons, 8 inputs, 6 date pickers...\n\n* Cada equip en farà servir un de diferent, ningú sabrà quin actualitzar, i el deute tècnic creix d'amagat.\n\n* Quan vols canviar un comportament global, acabes tocant 10 fitxers i creuant els dits perquè res no es trenqui a producció.\n\n#\n\n#\n\n#\n\n# **2️⃣ Variacions regionals controlades**\n**El problema típic en banca:**\n\nTens un formulari de pagament.\n\nEspanya necessita mostrar un disclaimer legal específic.<br>Alemanya necessita un ordre diferent de camps per regulació.<br>França necessita traducció + format de número diferent.\n\n> **La trampa:**<br>Cada equip crea la seva pròpia versió del component.\n\n**Resultat:** 15 variants del mateix formulari.<br>Totes lleugerament diferents.<br>Totes requereixen manteniment separat.<br>**Fork hell.**\n\n#\n\n#\n\n#\n\n# **Com ho resol Stripe (i com ho hauries de resoldre tu):**\nStripe té **un sol component de pagament** que funciona a 40+ països.\n\nCom?\n\n**Les diferències viuen en configuració, no en codi:**\n\n```\n<code>{\n  \"ES\": {\n    \"legalDisclaimer\": \"Texto específico español\",\n    \"fieldOrder\": [\"email\", \"card\", \"name\"],\n    \"dateFormat\": \"DD/MM/YYYY\"\n  },\n  \"DE\": {\n    \"legalDisclaimer\": \"Gesetzlicher Hinweis\",\n    \"fieldOrder\": [\"name\", \"card\", \"email\"],\n    \"dateFormat\": \"DD.MM.YYYY\"\n  }\n}\n</code>\n```\n**El component és el mateix.**<br>La lògica és la mateixa.<br>Només canvia la configuració.\n\nActualitzes el JSON -> es propaga a tots els mercats.<br>**Zero forks.**\n\n🔗 **[Stripe Localization](https://stripe.com/docs/payments/payment-methods#localization)**\n\n**Altres exemples del que Stripe fa bé:**\n\n✓ **Validació IBAN en temps real:** No esperes dies a saber que un format és incorrecte. Ho saps mentre escrius.\n\n✓ **Gestió d'errors regulats:** Missatges clars amb codis específics. Legal aprova templates una vegada, no cada pantalla.\n\n✓ **Autenticació forta (SCA):** El sistema detecta automàticament quan és necessari per regulació i ho mostra només llavors.\n\n**La lliçó:**<br>Converteixen complexitat regulatòria en avantatge competitiu.\n\nNo és màgia. **És disseny d'infraestructura.**\n\n📝 **[Com vaig explicar en aquest post: quan el teu prototip comença a mentir-te, és que no vas dissenyar infraestructura, vas dissenyar teatre](https://buildsystems.substack.com/p/the-day-our-perfect-prototype-started-lying-to-us-61971324637e)**\n\nSistemes que són invisibles però imprescindibles.<br>Que prioritzen operativitat per davant d'estètica.\n\n#\n\n#\n\n#\n\n# **3️⃣ Validació automàtica integrada**\nAccessibilitat, traçabilitat, consistència.\n\n**Ho verifica el sistema. No la bona voluntat.**\n\n**Per què importa?**\n\nPerquè si la validació depèn que algú recordi revisar, tard o d'hora falla.\n\n**Accessibilitat:**<br>Tests automàtics de contrast, jerarquia de capçaleres, navegació per teclat.<br>Si un component no compleix WCAG AA, no passa a producció. Automàticament.\n\n**I això no és opcional:**<br>La Directiva Europea d'Accessibilitat (European Accessibility Act) entra en vigor el juny de 2025.<br>Les apps de banca estan obligades a complir WCAG 2.1 nivell AA.<br>No és recomanació. És llei. Amb multes.\n\nSi la teva validació d'accessibilitat és manual, ja arribes tard.\n\n#\n\n#\n\n#\n\n# **4️⃣ Source of truth interna**\nNo a Figma.<br>No en eines de tercers que controlen els teus costos.\n\n**Parlem de números reals:**\n\n**Equip típic en banca: 100 developers + 20 UX**\n\n**Cost Figma el 2019:**\n\n* Professional: €12/editor/mes\n\n* 20 editors UX = €240/mes = **€2,880/any**\n\n* Viewers gratis per a developers\n\n**Cost Figma el 2024:**\n\n* Professional: €15/editor/mes (pujada 25%)\n\n* Organization: moltes empreses necessiten aquest pla ara\n\n* Organization: €45/editor/mes\n\n* 20 editors = €900/mes = **€10,800/any**\n\n**Però aquí ve el problema:**\n\nAra Figma cobra per \"viewer seats\" en plans Enterprise per a accés complet a biblioteques compartides.\n\n**Enterprise plan (el que realment necessites per a governança):**\n\n* Preu estimat: €75-100/seat/mes\n\n* 120 usuaris (20 UX + 100 devs que necessiten accés) = €9,000-12,000/mes\n\n* **= €108,000-144,000/any**\n\n**4,000% d'augment.**\n\nI no controles:\n\n* Quan pugen preus\n\n* Quines features noves t'obliguen a pagar més\n\n* Si demà decideixen canviar el model de llicències\n\nEl veritable risc no és només els diners, sinó que la teva governança depengui de decisions externes. **Per això la font de veritat ha de ser interna i controlada per la teva organització.** \n\n**Per què importa tant?**\n\nPerquè necessites quelcom que:\n\n* **Per a Product Managers:**<br>Quan un Director Financer pregunta \"per què aquest copy funciona millor?\", no pots respondre \"està en un fitxer de Figma que algú va moure de carpeta\".\n\nNecessites dades reals, versioning clar, històric traçable.<br>Mostrar què es va aprovar, quan, per qui, i quins resultats va donar.\n\n* **Per a Desenvolupament:**<br>Si la source of truth canvia cada setmana perquè algú va actualitzar Figma sense avisar, els developers deixen de confiar.\n\nDocumentació interna, versionada i sincronitzada amb el codi elimina ambigüitat.<br>Sense debats. Sense bloquejos.\n\n* **Per a Legal:**<br>Quan reguladors pregunten \"què mostraven exactament fa 6 mesos?\", no pots dependre de l'històric de Figma.\n\nNecessites un sistema immutable.<br>Que sobrevisqui a canvis d'eines, preus o polítiques externes.<br>Que respongui auditories sense col·lapsar l'equip.\n\n<h2>**📊 La mètrica que importa:**</h2>No són les històries tancades.<br>No és l'\"adopció del DS\".\n\nCada minut perdut recuperant context és deute silenciós.\n\nEl que acaba amb projectes sense que ningú el vegi venir.\n\n<h2>**🔄 Els rituals que mantenen el sistema viu:**</h2>**-> Demos d'aprenentatges, no només de features**<br>Què va funcionar, què va fallar, què va canviar. No és show & tell, és retrospectiva honesta.\n\n**-> Decisions documentades que es fan servir de debò<br>**Un ADR (registre de decisió) no és un PDF que ningú torna a obrir.\n\nÉs respondre \"per què ho vam fer així?\" sense necessitat de reunions.\n\nQuan algú nou pregunta, hi ha un document clar que explica:\n\n* Què vam decidir\n\n* Per què ho vam decidir\n\n* Quines alternatives vam considerar\n\nI està vinculat al codi, no enterrat a Confluence.\n\n**-> Mapes de deute tècnic prioritzats per cost real**<br>No per urgència política. Per quant fa mal mantenir-lo.\n\n**Liderar un DS no és \"entregar més ràpid\".**\n\nÉs:\n\n* Alinear incentius entre equips\n\n* Negociar excepcions amb data de caducitat\n\n* Reduir deute en silenci, sense soroll\n\n**El millor líder de sistema és el que menys es nota.**\n\nPerquè el sistema funciona sol.\n\n<h2>**🎯 Si el sistema es veu, interromp.**</h2>**Si ajuda, desapareix.**\n\n💬 **Preguntes per a líders de sistemes:**\n\nQuina mètrica fas servir per detectar fragmentació?\n\nOn viu la teva font de veritat?\n\nQuant perds cada vegada que el teu equip es desvia del flux per ambigüitats?\n\n👇 Comparteix en els comentaris 👇\n\n#DesignSystems #EnterpriseDesign #ProductLeadership #Banking #Governance",
      "tags": [
        "DX",
        "Invisible Design"
      ],
      "featured": false,
      "series": "Mestratge en Design Systems",
      "image": "/assets/images/writing/invisible-system.png"
    },
    {
      "id": "breaking-rules",
      "title": "El teu Design System no falla per components dolents",
      "date": "2025-09-10",
      "readTime": "System Ops",
      "description": "Falla perquè ningú va dissenyar qui decideix quan trencar les regles. La governança és més important que la llibreria de Figma.",
      "content": "He passat els últims anys construint, trencant i reconstruint sistemes de disseny a Amazon, Western Union i startups. I si hi ha una lliçó que es repeteix com un *loop* d'error a la consola, és aquesta:\n\n> **Ens obsessionem amb la superfície i ignorem l'estructura que la sosté.**\n\nNo parlo de components, ni de tokens, ni de documentació. Parlo de l'arquitectura *real*: la que defineix com es prenen decisions, qui té veu, i què passa quan el sistema xoca amb la realitat del producte.\n\n<h2>**El mite del \"sistema perfecte\"**</h2>En el meu article *\"[The Day Our Perfect Prototype Started Lying to Us](https://medium.com/@joanarbo/the-day-our-perfect-prototype-started-lying-to-us-61971324637e)\"*, vaig explicar com un prototip impecable — amb interaccions fluides, estats definits i lògica aparentment sòlida — es va ensorrar a producció perquè ningú havia qüestionat **l'API subjacent** .\n\nEl problema no era a Figma. Era en la bretxa entre la *il·lusió de control* del disseny i la *complexitat real* del sistema.\n\nAixò mateix passa amb els Design Systems.\n\nCreem biblioteques precioses, amb variants per a cada cas d'ús... però no dissenyem el **protocol d'evolució**. No definim com es resol un conflicte quan un equip necessita quelcom que el sistema no contempla. No establim qui pot trencar les regles... i quan.\n\n<h2>**La verdadera escalabilitat no és tècnica. És política.**</h2>Un Design System no escala per tenir més components. Escala per tenir **mecanismes clars per a la presa de decisions**.\n\n* Qui decideix que un token canvia de valor?\n\n* Què passa quan un equip necessita un patró que contradiu el sistema?\n\n* Com es resol un *trade-off* entre consistència i innovació?\n\nAquestes no són preguntes de disseny. Són preguntes de **governança**. I la majoria dels sistemes les ignoren fins que és massa tard.\n\nA *\"[Haikus i Tokens](https://medium.com/@joanarbo/haikus-y-tokens-18c753ad2b13)\"*, vaig escriure que \"els Design Tokens són decisions de disseny que es propaguen a través d'un sistema\" . Però mai vaig dir la part més incòmoda: **les decisions mal governades es propaguen com bugs**.\n\nJo també vaig creure que amb bons components n'hi havia prou... fins que el meu sistema va ser ignorat per 3 equips.\n\n<h2>**El test de foc: el primer fork**</h2>Tot sistema sa sobreviu el seu primer *fork*.\n\nEl moment en què un equip, frustrat per la burocràcia o la rigidesa, decideix crear la seva pròpia versió del sistema.\n\nMolts ho veuen com una traïció. Jo ho veig com un senyal.\n\nPerquè si el teu sistema no permet *evolució descentralitzada*, no és un sistema. És una presó.\n\nLa verdadera prova no és si tots fan servir la teva biblioteca. És si, quan algú la trenca, **el sistema aprèn en lloc de castigar**.\n\n<h2>**Llavors, què fer?**</h2>Deixa de pensar en el teu Design System com un *producte*.\n\nPensa-hi com una **infraestructura de coordinació**.\n\n* Defineix regles clares, però no rígides.\n\n* Documenta no només *què* fer, sinó *com decidir*.\n\n* Fes visible el procés de canvi, no només el resultat.\n\n* Celebra els *forks* que aporten valor, no només l'obediència cega.\n\n<h2>**La ironia final**</h2>Els millors Design Systems no són els més utilitzats.\n\nSón els que **desapareixen**.\n\nNo perquè siguin invisibles, sinó perquè la seva arquitectura és tan sòlida que ningú ha de pensar-hi. L'equip se centra a resoldre problemes reals, no a lluitar contra el sistema.\n\nAixò no s'aconsegueix amb més documentació.\n\n> S'aconsegueix amb **menys ego i més estructura**.\n\n*Joan Arbó*\n\nUX Engineer @ Western Union | Ex-Amazon Alexa\n\n***El teu equip ja ha fet un fork del teu Design System? No el castiguis. Pregunta't: quin feedback m'està donant?***\n\nP.D.: Si el teu Design System té un \"owner\" però no un \"protocol de desacord\", ja està trencat. Només falta que algú ho digui en veu alta.",
      "tags": [
        "Governança",
        "Ops"
      ],
      "featured": false,
      "series": "Mestratge en Design Systems",
      "image": "/assets/images/writing/breaking-rules.png"
    },
    {
      "id": "two-scales",
      "title": "Les dues escales del disseny: Àtoms i Ecosistemes",
      "date": "2025-08-28",
      "readTime": "Deep Dive",
      "description": "Era l'últim dia del curs de Design Systems quan una pregunta ho va canviar tot. Des de l'àtom emocional d'una invitació fins a l'escala massiva d'Amazon.",
      "content": "Era l'últim dia del curs de Design Systems a MrMarcel School quan la Laura em va fer la pregunta que no em vaig poder treure del cap.\n\n> \"Joan, hem passat mesos estudiant design systems. Però segueixo sense entendre com connectar la teoria amb la pràctica real. Per què tot se sent tan… pla?\"\n\nEm vaig quedar en silenci.\n\nFeia dos anys que treballava en un projecte per a Alexa, un Sistema de Disseny Conversacional. Interfícies multimodals que es desplegaven en diferents pantalles, veu, gestos. Sistemes que orquestraven converses, música, smart home, tot sincronitzat. Era pensar en gran. Escala univers.\n\nPerò aquella nit em vaig adonar d'una cosa:\n\n> I si la següent evolució no era cap amunt, sinó cap avall?\n\n**En els propers 10 minuts et mostraré com aplicar la metodologia 'Powers of Ten' al disseny de sistemes. Descobriràs per què treballar només en una escala (macro o micro) limita el teu impacte, i com pensar en ambdues simultàniament pot canviar radicalment els teus resultats.**\n\n#\n\n#\n\n# Powers of Ten: la lliçó que vam oblidar\nAquel matinada vaig recordar un film del 1977 que va canviar com veiem el món: \"**Powers of Ten**\" de Charles i Ray Eames.\n\nLa càmera està a 1 metre de distància.\n\nCada 10 segons, s'allunya 10 vegades més (10 metres, 100 metres, 1 quilòmetre…).\n\nLe parc. La ciutat. Illinois. Estats Units. La Terra. El sistema solar. La galàxia. L'univers observable.\n\n*Arribem a 10²⁴ metres. El límit de tot el conegut.*\n\nDesprés torna. Al pícnic. I segueix cap endins.\n\nA la mà de l'home. A la pell. A les cèl·lules. A les molècules. Als àtoms. Als quarks.\n\n*Fins a 10^-16 metres. La mínima expressió de la matèria.*\n\n> 💡 El mateix punt. 40 ordres de magnitud diferents de veure'l. Cada escala revela una realitat completament nova.\n\n#\n\n#\n\n# Alexa: quan dissenyava en l'escala de l'univers\nDurant dos anys vaig dissenyar en l'extrem macro.\n\nUn usuari a Boston diu: *\"Alexa, bon dia\"*\n\nEl sistema orquestra:\n\n* Llegeix notícies personalitzades\n\n* Ajusta llums de la casa\n\n* Mostra calendari a la pantalla\n\n* Sincronitza recordatoris al mòbil\n\n* Arrenca playlist de Spotify\n\n***Una frase. Cinc experiències. Tres dispositius. Tout coherent.***\n\nEra disseny a escala ecosistema. Pensar en com sistemes complexos treballen junts. La vista des de 10^24 metres.\n\nPerò aquella nit, després de la pregunta de la Laura, em vaig adonar d'una cosa inquietant:\n\nQuè passa quan baixes 40 ordres de magnitud? Quina és la unitat mínima d'un design system? Quina és la mínima expressió que pot codificar significat?\n\n#\n\n#\n\n# L'experiment: invitacions de boda des de l'àtom emocional\nVaig decidir aplicar \"**Powers of Ten**\" al cas més empàtic que em va venir al cap: invitacions de boda digitals.\n\nL'escala tradicional (vista des de 10 metres):\n\nTenia 73 templates a Figma:\n\n* Template \"Romàntic\" #1\n\n* Template \"Modern\" #2\n\n* Template \"Clàssic\" #3\n\nEl procés era el de sempre: la parella tria template, canvio colors, ajusto noms i data, envio. *Rinse and repeat.*\n\nÉs l'escala \"humana\" del disseny. On tots operem normalment.\n\n#\n\n#\n\n#\n\n# Però què passa si baixo a escala atòmica?\nEn lloc de mostrar templates, vaig preguntar a la Laura (sí, la meva alumna) i la seva parella:\n\n*\"Com voleu que se sentin els vostres convidats quan rebin la invitació?\"*\n\nLa Laura i la seva parella: *\"Íntims, càlids, familiars\"*\n\nNo vaig buscar *\"Template Romàntic #3\"*.\n\n**Vaig baixar a la mínima expressió. Als àtoms emocionals de la invitació:**\n\n```\n<code>$invitation-intimacy: (\n. spacing: generous, // respira, no agobia\n. palette: warm-earth, // terracotta, cream, sage\n. typography: gentle, // serif suau, no imponente\n. decoration: minimal. // flors discretes, no pomposes\n);\n</code>\n```\n**És com en el film dels Eames:** quan baixes a escala molecular, descobreixes que el que semblava sòlid (un template de boda) en realitat està fet d'àtoms (decisions emocionals mínimes).\n\n#\n\n#\n\n# Les dues escales en acció: Alexa vs invitacions de boda\n#\n\n#\n\n#\n\n# **Escala Macro (el meu projecte a Alexa — 2 anys):**\n**Usuari: Alexa, vull ambient romàntic\"**\n\nSistema orquestra múltiples dispositius:\n\n* Llums → warm amber, 30% intensitat\n\n* Música → jazz suau, volum baix\n\n* Pantalla → fireplace animation\n\n* Temperatura → puja 2 graus\n\nUna instrucció. Quatre sistemes. Tot sincronitzat.\n\nVista des de l'univers: com experiències complexes treballen juntes.\n\n#\n\n#\n\n#\n\n# **Escala Micro (invitacions de boda — el nou approach):**\nPerò què fa que \"warm amber\" se senti romàntic i no \"bright white\"?\n\nAquí hi ha l'àtom. El mateix principi aplicat a una invitació de boda:\n\n```\n// L'àtom romàntic de Alexa\n$romantic-light: (\n. hue: 30, // taronja càlid\n. saturation: 85, // ric però no saturat\n. brightness: 30. // íntim, no brillant\n);\n\n// El mateix àtom romàntic en una invitació\n$invitation-warmth: (\n. color-primary: hsl(30, 85%, 30%), // mateix hue\n. color-accent: hsl(30, 75%, 85%), // versió suau\n. color-background: hsl(30, 25%, 95%) // gairebé blanc càlid\n);\n```\n**⚠️ L'insight:** Perquè Alexa funcioni a escala univers, algú va haver de dissenyar primer a escala àtom. El mateix amb les invitacions de boda.\n\n#\n\n#\n\n# Quan l'àtom defineix l'univers: cas real\nL'Ana i el Marcos responen diferent: \"Vibrant, internacional, celebració\"\n\n**Escala Micro (els tokens de la seva invitació):**\n\n```\n$invitation-celebration: (\n. spacing: dynamic, // elements que es solapen\n. palette: festive-bold, // electric blue + gold\n. typography: geometric, // sans-serif arquitectònica\n. decoration: maximal. // ornamentación festiva\n);\n```\n**Escala Macro (tota la seva experiència de boda digital):**\n\nDes d'aquests àtoms, el sistema genera automàticament:\n\n* Save the date (primer contacte)<br>Usa els tokens: espaiat dinàmic, paleta festiva<br>Mood: \"quelcom gran s'acosta\"\n\n* Invitació principal (core experience)<br>Mateixos tokens, jerarquia més complexa<br>Mood: \"celebració internacional\"\n\n* RSVP card (interacció)<br>Tokens aplicats a formulari<br>Mood: \"respon amb energia\"\n\n* Thank you notes (comiat)<br>Tokens més suaus però reconeixibles<br>Mood: \"gràcies per celebrar amb nosaltres\"\n\n> Tot coherent. Perquè els àtoms emocionals són consistents.\n\nEs saxactament com \"**Powers of Ten**\":\n\nDesde 10^-16 (el token `$festive-bold: hsl(210, 100%, 50%)`) fins a 10^24 (tota l'experiència digital de boda) hi ha 40 escales entremig.\n\n> 💡 Si l'àtom no codifica emoció correctament, tota l'experiència de boda se sent genèrica.\n\n#\n\n#\n\n# Els números que van validar les dues escales\nSis mesos provant aquest approach amb invitacions de boda digitals:\n\n📊 Client satisfaction: 78% → 94%\n\n⏱️ Iterations to approval: 5–7 → 2–3.\n\n💰 Conversion rate: 23% → 41%\n\n📈 Referrals: 12% → 38%\n\n#\n\n#\n\n# El que és revelador:\n**Les parelles van deixar de demanar \"canvia aquest color per aquest\" (pensament macro, nivel template) i van començar a dir \"se sent exactament com nosaltres\" (coherència des del micro, nivell àtom).**\n\nPerquè quan dissenyes invitacions des de la mínima expressió emocional cap amunt, **cada peça hereta la personalitat de la parella.**\n\n#\n\n#\n\n# El que la Laura realment em va preguntar\nLa Laura no qüestionava la teoria de design systems.\n\nAssenyalava alguna cosa més profunda: **tots pensem design systems en una sola escala.**\n\nJo havia passat dos anys en l'extrem macro amb Alexa:\n\n* Experiències multimodals que orquestren dispositius\n\n* Sistemes cross-platform sincronitzats\n\n* Ecosistemes complexos d'experiències\n\nPerò havia ignorat l'extrem oposat en les invitacions de boda:\n\n* Quin és l'àtom emocional d'una invitació?\n\n* Quina és la mínima expressió que defineix \"romàntic\"?\n\n* Com es codifica \"intimitat familiar\" en un sol token?\n\n**Com en el film dels Eames:** si només veus les invitacions des de \"template complet\", mai descobreixes els àtoms emocionals que les construeixen.\n\n> 🎯 El futur del disseny no és triar macro o micro. És pensar en ambdues escales simultàniament.\n\n#\n\n#\n\n# La connexió entre Alexa i una invitació de boda\nAixí és com funciona en ambdós casos:\n\n**Escala Micro (10^-16): Un token de color**\n\n```\n// A Alexa\n$ambient-romantic: hsl(30, 85%, 30%);\n\n// En invitació de boda\n$invitation-warmth: hsl(30, 85%, 30%);\n```\n**Escala Molecular (10^-8): Un component**\n\n```\n// A Alexa\n<LightControl mood=\"romantic\" />\n\n// En invitació\n<Card emotional-tone=\"intimate\" />\n```\n**Escala Cel·lular (10^0): Una escena completa**\n\n```\n// A Alexa\n<RomanticAmbience room=\"living\" />\n\n// En invitació\n<WeddingInvitation couple=\"Laura-Pablo\" />\n```\n**Escala Ecosistema (10^8): Una experiència completa**\n\n```\n// A Alexa (multi-dispositiu)\n<SmartHomeExperience mood=\"romantic\" />\n\n// En boda (multi-format)\n<WeddingExperience theme=\"intimate-celebration\" />\n```\n**Cada escala construeix sobre l'anterior. Però sense els àtoms correctes a 10^-16, tot l'univers a 10^24 se sent genèric.**\n\nJa sigui Alexa orquestrant la teva casa o una invitació de boda arribant al teu WhatsApp.\n\n#\n\n#\n\n# El que ve: el dissenyador bidireccional\nEstic desenvolupant una metodologia que opera en ambdues direccions:\n\n**Quan puges (macro):**\n\n* Des de tokens de boda → save the date → invitació → experiència completa\n\n* Com construir una celebració des dels seus àtoms emocionals\n\n**Quan baixes (micro):**\n\n* Des de \"vull boda íntima\" → quina paleta? → quins tokens defineixen intimitat?\n\n* Com entendre per què una invitació se sent d'una certa manera\n\n> El poder: Coherència emocional des del quark fins a l'univers.\n\nJa sigui a Alexa multimodal o en invitacions de boda digitals.\n\n#\n\n#\n\n# **El teu torn:**\nEn quina escala dissenyes normalment?\n\nHas pensat en experiències macro (com Alexa, ecosistemes)?\n\nHas baixat a escala micro (tokens que senten) en els teus projectes?\n\nQuè descobriries si canviessis la teva escala 10x amunt o 10x avall?\n\n**Exercici per a avui:**\n\n**Pren el teu últim projecte. Identifica en quina escala vas treballar (templates complets o tokens bàsics?). Ara imagina: què descobriries si baixessis/pugessis 10 escales? Comparteix la teva resposta en els comentaris.**\n\n#DesignSystems #PowersOfTen #SystemsThinking #EmotionalDesign #WeddingDesign #DesignScale",
      "tags": [
        "Escales",
        "Educació",
        "Filosofia"
      ],
      "featured": false,
      "series": "Mestratge en Design Systems",
      "image": "/assets/images/writing/two-scales.png"
    },
    {
      "id": "lying-prototype",
      "title": "El dia que el nostre prototip perfecte ens va començar a mentir",
      "date": "2025-08-15",
      "readTime": "Case Study",
      "description": "Els dissenyadors perden setmanes perseguint el 'pixel-perfect' — quan les preguntes audaces de producte necessiten respostes reals i ràpides.",
      "content": "La Sophie, la nostra Product Manager, tenia aquella mirada. Ja saps quina — quan algú intenta resoldre un trencaclosques que no hauria d'existir.\n\nEstàvem en una demo rutinària del nostre flux de checkout, aquell tipus de reunió que sol acabar amb tothom assentint i passant a la següent cosa. El nostre prototip era preciós. Cada píxel al seu lloc, cada interacció fluida. La demo funcionava com un rellotge.\n\nPerò la Sophie mirava fixament el seu portàtil, fent scroll per tiquets de suport al client.\n\n\"No ho entenc\", va dir, trencant el silenci satisfet. \"L'Henrik segueix fallant al checkout, però aquí funciona perfecte. Si la nostra API dóna errors de pagament, per què no puc veure'ls a la nostra documentació?\"\n\nAquí va ser quan me'n vaig adonar. **Havíem construït una mentida preciosa.**\n\n#\n\n#\n\n# La Ficció Còmoda del Testing \"Happy-Path\"\n**La nostra documentació d'API era com un menú de restaurant que només mostra fotos de plats perfectes — mai les patates blanes o les vores cremades que a vegades reben els clients reals.**\n\nConeix els nostres personatges:\n\n**Emma** viu al centre d'Amsterdam. Té banca iDEAL, múltiples targetes guardades, i el seu codi postal té lliurament l'endemà per a tot. Quan l'Emma compra, internet l'estima.\n\n**Henrik** és un estudiant universitari a la Finlàndia rural. La seva targeta Nordea és rebutjada per raons transfrontereres misterioses, l'enviament a la seva adreça triga dues setmanes, i la meitat dels productes que vol \"no estan disponibles per a lliurament a Finlàndia\". L'experiència de compra de l'Henrik és una cursa d'obstacles.\n\n**Marcel** porta les compres d'una mitjana empresa a Lió. Necessita descomptes per volum, transferències SEPA, i que algú de comptabilitat aprovi qualsevol cosa per sobre de 500€. El món de l'e-commerce no es va construir per a les regulacions de compres franceses del Marcel.\n\nLa nostra documentació només sabia ser l'Emma. Mai havia conegut l'Henrik o el Marcel.\n\n#\n\n#\n\n# El Problema de Documentació de 75.000€\nAquest és el que vam descobrir: l'Henrik no només fallava al checkout. Ens estava costant diners seriosos.\n\nCada vegada que la targeta de l'Henrik era rebutjada per una restricció relacionada amb el GDPR que no havíem documentat, algú trucava a atenció al client. Cada vegada que la seva adreça finlandesa activava un error que mai havíem provat, perdíem una venda i guanyàvem un tiquet de suport.\n\nLes matemàtiques eren brutals. Passàvem 48 hores en reunions intentant entendre problemes que haurien d'haver pres 30 segons en reproduir-se.\n\nLa nostra preciosa documentació s'havia convertit en una ficció cara.\n\n#\n\n#\n\n# L'Arranjament: Quan la Documentació Coneix la Realitat\n**Així que vam fer una cosa simple que es va sentir radical. Vam posar l'Henrik, l'Emma i el Marcel directament a la nostra documentació d'API.**\n\nAra, quan la Sophie obre els nostres docs, veu una barra lateral amb tres botons. Clic a \"Henrik\", i de sobte la mateixa API de checkout que funcionava perfecte per a l'Emma comença a llançar errors reals: \"*Mètode de pagament no disponible a Finlàndia.*\" \"*Enviament retardat per requisits de duanes.*\" \"*Producte restringit sota regulacions de la UE.*\"\n\nNo és només dades diferents — és una realitat diferent. El botó de l'Henrik fa l'API més lenta (internet rural finlandès), més exigent (restriccions bancàries nòrdiques), i més honesta sobre el que no funciona al Mercat Únic.\n\nL'entorn de proves va deixar de ser una bobina de demo i es va convertir en una màquina de la veritat.\n\n#\n\n#\n\n# El que vam aprendre sobre construir per a persones reals\nEl canvi va ser immediat. La Sophie finalment podia veure el que veia l'Henrik. Els nostres enginyers podien depurar casos límit de GDPR sense jugar a les 20 preguntes amb atenció al client. **Els nostres tiquets de suport per problemes de checkout van caure un 41%.**\n\nPerò la lliçó més gran va ser sobre per a qui havíem estat construint. L'Emma és real, però també és fàcil. Té fibra òptica, compatibilitat SEPA, i viu on tot arriba ràpid. Construir per a l'Emma se sent com un progrés perquè tot funciona.\n\nL'Henrik és real també, però és inconvenient. Les seves limitacions exposen cada suposició que hem fet sobre com haurien de funcionar les compres a Europa. Construir per a l'Henrik se sent com resoldre problemes perquè res està garantit en 27 estats membres.\n\nEl checkout preciós, optimitzat per a l'Emma, que es veia tan bé a les demos era en realitat un mur que deixava fora l'Henrik. La nostra documentació ens havia ajudat a construir aquell mur fent-lo invisible.\n\n#\n\n#\n\n# La Imatge Completa: Quan el Perfecte es Converteix en Enemic del Bo\n**Això no es tracta només d'e-commerce o APIs. Es tracta d'una trampa de gestió comuna: optimitzar per al client ideal mentre ignores els reals.**\n\nCada negoci té una Emma — el client que fa que les teves mètriques es vegin genial i les teves demos cantin. Cada negoci també té un Henrik — el client que revela on es trenca realment el teu producte a través de la complexitat del mercat europeu.\n\nLa majoria d'equips construeixen documentació com si escrivissin el manual de propietari per a un cotxe que només condueix en autobahns alemanyes perfectes. Documenten el camí feliç perquè és net, predictible i fa que tothom se senti competent.\n\nPerò els teus clients no viuen en carreteres perfectes. Viuen a la Lapònia de l'Henrik, on internet és lent i els bancs tenen regles diferents. Treballen al Lió del Marcel, on res és simple i tot necessita aprovació sota la llei comercial francesa.\n\n#\n\n#\n\n# Tres Preguntes Que van Canviar Com Construïm\nAbans de llançar res ara, preguntem:\n\n**Funciona això per a l'Henrik?** No en teoria — en la pràctica, amb la seva connexió lenta i requisits bancaris nòrdics estrictes.\n\n**Pot la Sophie provar l'escenari de l'Henrik ella mateixa?** Sense agendar una immersió profunda d'enginyeria o esperar que el compliment de GDPR funcioni.\n\n**Com es veu realment la falla?** No el missatge d'error sanitat, sinó l'experiència d'usuari frustrada a través de diferents regulacions de la UE.\n\nAquestes preguntes van canviar com pensem sobre tot, des d'especificacions de features fins a copy de màrqueting. L'Emma ens mostra el que és possible. L'Henrik ens mostra el que és necessari a través del Mercat Únic Europeu.\n\nEl dia que la nostra documentació va començar a dir la veritat sobre l'Henrik va ser el dia que vam deixar de construir per al client que desitjàvem tenir i vam començar a construir per als clients que realment servim en 27 entorns regulatoris diferents.\n\nAquí va ser quan el nostre prototip perfecte va deixar de mentir i va començar a funcionar.\n\n> La teva documentació no és només un manual d'instruccions — és un mirall. Assegura't que està reflectint la realitat correcta a través de tots els teus mercats.\n\n*Més per venir...*\n\n*Indagaré en l'evolució de la nostra API i els seus efectes dominó en com pensem sobre els sistemes de disseny.*\n\n*Vols la resta de la història? Uneix-te a mi per a la pròxima.*\n\n**#EstratègiaDeProducte #ExperiènciaClient #DocumentacióTècnica #MercatsEuropeus #LideratgeDeProducte #DissenyAPI #DissenyCentratEnUsuari #GDPR #MercatÚnic**",
      "tags": [
        "Prototipat",
        "Validació",
        "Agilitat"
      ],
      "featured": true,
      "series": "Mestratge en Design Systems",
      "translate": "The Day Our Perfect Prototype Started Lying to Us",
      "image": "/assets/images/writing/lying-prototype.png"
    },
    {
      "id": "ai-thinking",
      "title": "La IA no em treu la feina, em reta a pensar diferent",
      "date": "2025-08-01",
      "readTime": "Essay",
      "description": "De demanar-li que executi a demanar-li que em reti: el prompt i el procés que sí que canvien com construeixo.",
      "content": "Com passo de \"IA que executa\" a \"IA que em reta\". El prompt i el procés que sí que canvien com construeixo.\n\nHe vist la IA generar fitxers que imprimiria i emmarcaria. També l'he vist romandre context per complaent. La diferència no és màgia: és com converses amb ella. Explico el canvi que vaig fer: de demanar-li que executi a demanar-li que em reti.\n\n#\n\n#\n\n# Un canvi real: quan la IA em va deixar sense paraules\nA Western Union, després de definir una col·lecció inicial de tokens, la IA va refinar el set i va generar un SCSS tan net que vaig anar directe al director de tecnologia: \"Això s'ha d'imprimir i emmarcar\". Concretament: va eliminar 27 duplicats, va agrupar semàntics per intenció i va proposar una escala de spacing que després vaig adoptar en tots els projectes. Aprenentatge: el valor no va ser el codi, va ser la conversa que ens va obligar a decidir l'immutable.\n\nPorto anys revisant i ensenyant fitxers de tokens — en empreses com Amazon o Western Union, amb equips grans, analitzant-los en cursos i xerrades — i mai n'havia vist un de tan afinat, així, de cop.\n\n#\n\n#\n\n# Vulnerabilitat: el que m'inquieta de veritat\nSí, fa por que ara algú amb menys experiència munti un sistema en una fracció del temps. La meva resposta no és competir contra la IA en execució, sinó liderar el context, el criteri i els acords. Això no s'autogenera: es dissenya conversant.\n\n#\n\n#\n\n# Quan la IA falla\nEl taló d'Aquil·les de la IA? Si li falta context, pot fallar estrepitosament. Les primeres versions de GPT eran terriblement complaents: responien sempre alguna cosa, encara que no tingués sentit. Aquí segueix estant el nostre valor: saber dir-li \"per aquí no\", exigir-li que ens pregunti més i afegeixi profunditat — no acceptar el primer esborrany ni la resposta fàcil.\n\n#\n\n#\n\n#\n\n# **Senyals que la IA està complaent (y com tallar-ho):**\n\n* Et dóna respostes llargues sense demanar-te més context -> Resposta: demana 3 preguntes abans de proposar solucions.\n\n* Et retorna codi perfecte però desconnectat del problema -> Demana \"raó, trade-offs i riscos\".\n\n* Et diu \"sí\" a tot -> Demana contraexemples i un test de estrès ràpid.\n\n#\n\n#\n\n# El prompt més ximple però potent que faig servir\nEt regalo el prompt que millors resultats m'ha donat:\n\n```\nEts un expert en el teu camp. A partir d'ara seràs el meu assessor en {tema\nconcret}. No siguis complaent amb mi: qüestiona els meus supòsits, fes-me \npreguntes abans de proposar solucions i planteja riscos i trade-offs. \n\nTreballem en iteracions de màxim 10 minuts i acaba cada volta amb: \n\n1) decisió suggerida\n\n2) riscos\n\n3) següent pregunta\n```\n#\n\n#\n\n#\n\n# El meu flux en 5 passos\n\n* Defineixo el context en 5 línies (qui, per a què, restriccions).\n\n* Demano 3 preguntes i paro (si no pregunta, reintento).\n\n* Exigeixo 2 alternatives amb trade-offs (no \"la millor pràctica\" genèrica).\n\n* Valido amb un exemple petit (no specs completes).\n\n* Resumeixo jo el que he après i ho faig servir com a prompt per a la següent iteració.\n\nLa clau: no és màgia ni adulació — és obrir una dinàmica de conversa exigent, anada i tornada, exigint valor i afinant junts.\n\n#\n\n#\n\n# El meu consell pràctic\nAtreveix-te: comença un projecte propi bàsic des de zero amb ajuda de la IA, trasteja, trenca'l, itera i, quan el terminis, demana a la IA que et resumeixi el que has après i torna a començar amb aquest resum com a prompt inicial.<br>La segona, tercera i quarta versió seran millors i més teves.\n\n#\n\n#\n\n# I tu?\nT'atreveixes a deixar que la IA et reti — no només a executar-te tasques? Què va ser l'últim que la IA et va ensenyar o que mai haguessis fet sense ella?\n\n#AIUX #DesignSystems #Solopreneur #ProductThinking\n\n> La creativitat no la reemplaça la IA. Però la IA, si l'entens, t'obliga a ser més creatiu que mai.",
      "tags": [
        "IA",
        "Mentalitat",
        "Carrera"
      ],
      "featured": false,
      "series": "IA i el Futur del Treball",
      "image": "/assets/images/writing/ai-thinking.png"
    },
    {
      "id": "writing-workflow",
      "title": "Com llanço un post valuós cada setmana en 30 min",
      "date": "2025-07-20",
      "readTime": "Workflow",
      "description": "Sense cremar-se, sense dependre de la inspiració. El meu sistema de creació de contingut assistit per IA i Notion.",
      "content": "*Llegeix aquest article en anglès [aquí](https://medium.com/@joanarbo/how-i-write-and-publish-a-valuable-post-every-week-in-just-30-minutes-thanks-to-ai-notion-1e15de49805c)*\n\nT'imagines escriure (i publicar), sense cremar-te, ni dependre de la inspiració… i sense postureig?<br>El primer dia no sabia si només escriuria per inèrcia. Ara gaudeixo (gairebé) més del procés que del post en si.\n\n> \"Als famosos els escriuen llibres després d'entrevistar-los. Jo tinc una IA que m'entrevista diàriament, em reta i aconsegueix que les meves idees tinguin sentit — i amb això, em basta.\"\n\n#\n\n#\n\n#\n\n# Per què vaig sistematitzar el meu procés de publicar setmanalment\nAbans creia que un post valuós requeria dos o tres dies de donar voltes, esbossar, reescriure i ajustar. <br>Com a dissenyador i enginyer, sempre he buscat claredat… però gairebé sempre el meu primer esborrany només l'entenc jo (o els meus alumnes més propers), mentre que a un públic professional i exigent poques vegades li ressona.\n\nFins que ho vaig acceptar:\n\n* Publicar ha de ser sostenible i ràpid, no perfecte.\n\n* Les millors idees solen sorgir després de publicar, no abans.\n\nAixí que vaig muntar una rutina setmanal barrejant una plantilla a Notion, un protocol molt simple i la meva nova \"*parella creativa*\": una IA que m'entrevista i perfecciona el resultat.\n\n* Abans: Dubtes, bloquejos, textos que no connectaven.\n\n* Després: Llibertat, focus i control creatiu gràcies a la rutina+IA.\n\n> Per exemple, abans cada esborrany es quedava sense publicar per por a la crítica. Ara, publico sense por que no sigui perfecte, perquè l'aprenentatge real ve just després.\n\n#\n\n#\n\n#\n\n# El meu workflow de 30 minuts: crear contingut sense cremar-me\nEl procés real, sense postureig?\n\n**1. Obro la meva plantilla de Notion.<br>** Cada setmana duplico una simple \"Targeta diària\". Em demana:\n\n```\n#\n\n#\n\n# La meva plantilla diària a Notion (extracte)\n\n- **Quin és el repte/tema concret d'avui?**\n- **Per què just aquest tema és important per a mi / per a altres?**\n- **Què he fet, experimentat o après sobre això (amb una anècdota real)?**\n- **Quina barrera em va frenar i com la vaig sortejar (si n'hi va haver)?**\n- **Quin \"microfracàs\" puc compartir que ajudi a altres?**\n- **Quina és la idea principal que hauria de recordar si només pogués escriure 1 línia avui?**\n- **Com puc reptar la meva audiència perquè em sorprengui?**\n- **Call to action clar: Què busco avui? Feedback, conversa, co-creació...**\n\n*(Afegeixo una secció de reflexió ràpida tipus \"mini-diari\" per entendre si el que escric avui connecta amb el rumb que vull.)*\n```\n**2. Dejo que la IA m'entrevisti en funció del que he omplert a la targeta.<br>** En comptes de barallar-me amb el full en blanc, li demano a la IA que em desafii — *\"On està el veritable problema? En què he fallat? A qui serveix de veritat això?\" *<br> A vegades refina les meves idees genèriques, altres vegades dóna la volta i pregunta just el que el meu públic necessitaria escoltar.\n\n> *Exemple real:* \"Avui la IA em va preguntar si aquell exemple podia ser útil a algú sense background tècnic. Això em va fer simplificar tot el post.\"\n\n**3. Mantinc el post compacte.<br>** Gens d'assaigs llargs: l'aprenentatge o micro-història, a tot estirar abans/després (**Abans: 3 dies per post. Ara: 30 minuts i una rutina establerta**).\n\n**4. Publico sempre un asset visual. <br>** Diagrama, snippet de codi o simplement una \"comparativa abans/després\" (a vegades només exporto de Figma!). <br>Publicar una cosa tangible separa el teu messege del fum i dóna credibilitat real.\n\n**5. Tanco amb una CTA honesta.<br>** Gens de \"DM ja\", sinó proposta real d'interacció: que la gent comenti la seva rutina, el seu pitjor fail, o si vol la plantilla. Les millors respostes es converteixen en material per al post de la setmana següent.\n\n**6. Bloc de reflexió/confessió.<br>** Sempre una línia d'autocrítica real (\"*No sé si avui l'he clavat per al públic pro*\" / \"*M'he passat de tou o me n'he anat al tecnicisme fàcil*Check-out*\"). És el meu diari de bord: escric per ordenar-me jo i, de pas, per fer comunitat.\n\n#\n\n#\n\n#\n\n# Exemples de prompts i preguntes reals que faig servir\n- \"*Què vas aprendre a les males prototipant amb codi?*\"<br>- \"*Quan una rutina o plantilla realment et va ajudar a anar més ràpid, de debò?*\"<br>- \"*On perds més temps o energia: redactant, editant, buscant feedback?*\"\n\n*(Si vols, roba aquestes preguntes per al teu Notion, Google Doc o enganxa-les a la teva IA habitual.)*\n\n#\n\n#\n\n# Per què aquesta rutina FUNCIONA\n\n* **Estalvia temps**: Vaig passar de dies a 30 minuts (a vegades menys!) per cada post.\n\n* **Et lliura de la trampa de la perfecció:** Publicar periòdicament em fa preocupar-me menys per cada frase — i centrar-me més en aprendre al costat de qui em llegeix.\n\n* **Construeix autoritat real:** Repetició, miniconte i ensenyaments realistes funcionen molt millor que qualsevol \"*gran teoria*\".\n\n#\n\n#\n\n#\n\n# Vulnerabilitat real\nSincerament: segueixo dubtant si la meva veu connecta amb el públic pro. Moltes vegades em lio, peco d'empàtic ('nyoño') o me'n quedo a mitges entre el meu jo profe de sempre i la meva versió més estratègica. <br>Però aquesta \"micro-rutina-diario\" em dóna focus i, el millor, crea un feedback loop on els lectors (i fins i tot els que critiquen…) ajuden a millorar tant el meu contingut com la meva metodologia.\n\nI tu? Sents que la teva veu a vegades es dilueix per 'anar de profe' o per por a no sonar prou professional? Jo sí — i per això et proposo provar la meva rutina i dir-me si també t'allibera.\"\n\n#\n\n#\n\n# Vols la plantilla? O veure com la IA m'entrevista (de debò)?\nNomés has de deixar un comentari \"ENTREVISTA\" o enviar-me un missatge. Comparteixo plantilla, guió si t'ajuda a començar la teva.<br>Encara no he trobat cap IA capaç de donar-me un feedback tan 'real' como un comentari sincer, un debat productiu o fins i tot una crítica inesperada.\n\n> La rutina no mata la creativitat. Al revés: li dóna l'espai per ser honesta, breu i compartida cada dia.\n\n#productivitat #escriureendigital #designsystems #notion #ai #promptengineering #buildinpublic\n\n*Joan Arbó — UX Engineer amb 18 anys d'experiència, professor de Design Systems i apassionat d'accelerar equips sense perdre qualitat. Ex-Amazon, ara a Western Union. Parlem? [me@joanarbo.com](mailto:me@joanarbo.com)*",
      "tags": [
        "Productivitat",
        "Escriptura",
        "Notion"
      ],
      "featured": false,
      "featured": false,
      "series": "IA i el Futur del Treball",
      "image": "/assets/images/writing/writing-workflow.png"
    }
  ],
  "ideas": [
    {
      "id": "design-agents",
      "title": "Agents de Disseny Autònoms",
      "date": "2026-01-08",
      "status": "active",
      "readTime": "14 min de lectura",
      "description": "Automatitzant la burocràcia creativa. Com delegar tasques de Design Ops (naming, linting, documentació) a agents autònoms per alliberar els humans.",
      "content": "La feina d'un Product Designer modern és un 20% creativitat i un 80% gestió de fitxers. Reanomenar capes a Figma, verificar contrastos WCAG, actualitzar estats de Jira, documentar props de components... És la \"feina de conserge\" digital.\n\nSi apliquem la teoria d'Agents Autònoms, podem externalitzar gairebé tota aquesta càrrega cognitiva.\n\n#\n\n#\n\n# Anatomia d'un Agent de Disseny\n\nUn agent requereix tres coses:\n1.  **Percepció**: Capacitat de llegir el fitxer (Figma API).\n2.  **Cervell**: Capacitat de raonar sobre el que s'ha llegit (GPT-4 / Claude 3).\n3.  **Acció**: Capacitat de modificar el fitxer (Write Access).\n\n#\n\n#\n\n# Design Ops 2.0: De Policia a Jardiner\n\nTradicionalment, Design Ops actuava com a policia: \"No has fet servir el component correcte!\". Amb agents, Design Ops es converteix en jardineria automàtica. El sistema es poda i es rega a si mateix.\n\nAixò canvia l'economia de l'equip de disseny. Ja no necessites un \"Junior\" per ordenar fitxers. Necessites Seniors que sàpiguen configurar les regles dels agents.\n\n---\n\n#\n\n#\n\n#\n\n# Automatització de Design Ops\nEl teu equip perd hores en tasques repetitives a Figma/Jira? Ajudo a implementar **pipelines d'automatització i agents personalitzats** per al teu flux de treball de disseny.\n\n[<i class=\"ph-thin ph-arrow-right\"></i> Automatizar el meu Design Ops](mailto:me@joanarbo.com?subject=DesignOps%20Automation)",
      "tags": [
        "Agents",
        "Ops",
        "Automatització"
      ]
    },
    {
      "id": "multimodal-evolution",
      "title": "Evolució de sistemes de disseny multimodals",
      "date": "2026-01-15",
      "status": "active",
      "readTime": "10 min de lectura",
      "description": "Explorant com els sistemes de disseny han d'evolucionar per suportar interaccions que van més enllà de la pantalla, integrant veu, gestos i agents IA.",
      "content": "L'evolució dels sistemes de disseny multimodal no es tracta només d'afegir nous components, sinó de redefinir com la informació s'adapta a diferents canals d'interacció. \n\nEn un món on Rufus i altres agents IA estan redefinint el comerç i la interacció, els nostres sistemes han de ser capaços d'orquestrar experiències coherents en dispositius Echo, mòbils i wearables sense duplicar esforços.",
      "tags": [
        "Multimodal",
        "IA Agents",
        "Futur UI"
      ]
    }
  ],
  "thoughtLeadershipItems": [
    {
      "id": "redbility-talk",
      "type": "talk",
      "title": "El futur dels Sistemes de Disseny més enllà de la interfície",
      "event": "Redbility Innovation Center",
      "date": "2024",
      "image": "https://img.youtube.com/vi/wUPlE682OqY/maxresdefault.jpg",
      "videoUrl": "https://youtu.be/wUPlE682OqY",
      "description": "En aquesta xerrada explorem per què els sistemes de disseny tradicionals centrats en píxels estan arribant al seu límit. Analitzarem com l'arribada de la IA generativa i les interfícies multimodals (veu, gest, espacial) requereixen una nova arquitectura: 'Systems as Infrastructure'. Discutirem com desacoblar la lògica de disseny de la implementació visual per permetre que el mateix sistema alimenti un lloc web, un assistent de veu i un agent de IA simultàniament. També veurem com equips com Amazon i Spotify estan redefinint els seus sistemes per prioritzar la semàntica sobre l'estètica, permetent una personalització radical i una velocitat d'iteració impossible amb les eines actuals.",
      "tags": [
        "Design Systems",
        "Future UI"
      ]
    },
    {
      "id": "masterclass-historias",
      "type": "talk",
      "title": "El món del disseny està fet d'històries",
      "event": "Mr Marcel School",
      "date": "2023",
      "image": "https://img.youtube.com/vi/eGj9ZZ3Lj2k/maxresdefault.jpg",
      "videoUrl": "https://youtu.be/eGj9ZZ3Lj2k",
      "description": "Com convertim un conjunt de components freds en una experiència càlida i memorable? En aquesta xerrada, deconstrueixo la relació entre l'Atomic Design i la narrativa clàssica. Descobrirem com cada token, àtom i molècula contribueix a un 'arc narratiu' de l'usuari. A través d'exemples reals, mostro com definir 'tons de veu' visuals que s'adapten al context emocional de l'usuari (ansietat vs. celebració) i com documentar aquestes decisions no com a regles rígides, sinó com a principis de storytelling. És una guia essencial per a equips que volen que el seu producte tingui ànima, no només funcionalitat.",
      "tags": [
        "Atomic Design",
        "Storytelling"
      ]
    },
    {
      "id": "haikus-tokens",
      "type": "talk",
      "title": "Haikus i tokens",
      "event": "Mr Marcel School",
      "date": "2023",
      "image": "https://img.youtube.com/vi/6NuKWcpw4Ws/maxresdefault.jpg",
      "videoUrl": "https://youtu.be/6NuKWcpw4Ws",
      "description": "El Haiku japonès aconsegueix la màxima expressió amb la mínima estructura (5-7-5 síl·labes). Els Design Tokens busquen el mateix: màxima consistència amb unitats mínimes d'informació. En aquesta sessió teòrica i pràctica, ensenyo com aplicar la filosofia de la restricció creativa del Haiku a l'arquitectura de tokens. Aprendràs a anomenar variables de forma semàntica perquè 'comptin una història' als desenvolupadors, evitant noms críptics com 'blue-500'. Veurem com crear una taxonomia de tokens que sigui resilient al canvi, fàcil d'aprendre per a nous membres de l'equip i capaç d'escalar des d'una app mòbil fins a un ecosistema multiplataforma sense trencar-se.",
      "tags": [
        "Design Tokens",
        "Semántica"
      ]
    },
    {
      "id": "garaje-ideas-js",
      "type": "talk",
      "title": "Com fer prototips amb Javascript orientat a objectes",
      "event": "Garaje de Ideas",
      "date": "2022",
      "image": "https://img.youtube.com/vi/d9jj5USBhno/maxresdefault.jpg",
      "videoUrl": "https://youtu.be/d9jj5USBhno",
      "description": "La majoria dels prototips fallen perquè són només 'dibuixos interactius' que no gestionen dades reals. En aquest live coding, trenco la barrera entre dissenyador i enginyer. T'ensenyaré a fer servir JavaScript Modern (ES6+) i Programació Orientada a Objectes per crear 'Models de Domini' en els teus prototips. Imagina un prototip d'e-commerce que realment 'sap' quin estoc queda, o un dashboard financer que calcula interessos en temps real. Aprendràs patrons sencells per gestionar estat i lògica, permetent-te testejar no només la usabilitat visual, sinó la utilitat real de les features abans d'escriure una sola línia de codi de producció. Ideal per a dissenyadors que volen superpoders tècnics.",
      "tags": [
        "JS",
        "Prototyping"
      ]
    }
  ],
  "caseStudies": [
    {
      "id": "bodados",
      "title": "BODADOS: Tesi de Lideratge de Producte",
      "status": "Venture Lab",
      "company": "BODADOS",
      "year": "2024",
      "role": "Operational Strategy Lead (Founder)",
      "timeline": "Ongoing",
      "myRole": "Estratègia de Producte End-to-End",
      "team": "Agents IA + Founder",
      "challenge": "Validar una tesi de negoci complexa (SaaS vertical per a bodes) minimitzant el capital risc i maximitzant la velocitat d'execució.",
      "solution": "Un 'Living Lab' on aplico estratègia de producte, gestió de roadmap i validació d'hipòtesis de negoci amb recursos limitats (IA Agents).",
      "businessImpact": "Demostració de capacitat d'execució 'Hands-on' i visió de negoci completa. Validació de canals d'adquisició i models de revenue.",
      "architecture": "Arquitectura optimitzada per a iteració ràpida (Supabase, Next.js).",
      "content": "# Bodados: El meu Laboratori de Lideratge de Producte\n\nCom a líder, crec que és vital mantenir-se 'prop del metall'. Bodados no és només una app, és la meva tesi de mestratge en lideratge de producte.\n\nÉs un laboratori viu on demostro que puc:\n\n1.  **Definir Visió i Estratègia**: Identificar un mercat fragmentat (bodes) i proposar una solució sistèmica (Wedding OS).\n2.  **Gestionar Roadmaps Complexos**: Prioritzar features crítiques (Cashflow, Al·lèrgies) sobre 'nice-to-haves'.\n3.  **Executar amb Recursos Limitats**: Orquestrar un equip d'Agents d'IA per suplir la falta de headcount, demostrant eficiència operativa.\n\n***\n\n## 🧩 Visió de Negoci\n\nEl mercat de bodes pateix de falta de transparència i eines obsoletes. La meva estratègia es centra en resoldre el 'drama social' i la 'fricció financera' mitjançant grafs socials i previsió de cashflow.\n\n***\n\n## ⚡ Lideratge Tècnic i Execució\n\nMés enllà de l'estratègia, Bodados demostra que puc baixar al fang i prendre decisions tècniques que maximitzen el ROI. Triar Next.js i Supabase no va ser una preferència personal, va ser una decisió de negoci per reduir el Time-to-Market.",
      "impact": {
        "adoption": "Product",
        "adoptionLabel": "Visió",
        "efficiency": "Biz",
        "efficiencyLabel": "Estratègia",
        "consistency": "Exec",
        "consistencyLabel": "Execució"
      },
      "technologies": [
        "Product Strategy",
        "Roadmap Mgmt",
        "Business Logic",
        "AI Ops"
      ],
      "image": "/assets/images/case-studies/bodados.png",
      "link": "https://bodados.com"
    },
    {
      "id": "western-union",
      "title": "Racionalització Radical",
      "status": "En curs - 2023-Present",
      "company": "Western Union",
      "year": "2023-Present",
      "role": "UX Manager & Design System Lead (Europe)",
      "timeline": "En curs",
      "myRole": "Líder d'Arquitectura Estratègica i Governança",
      "team": "Madrid, Seattle, Londres, Chicago",
      "description": "No un redisseny cosmètic, sinó una auditoria sistèmica i estratègia de governança federada. Implementació d'una 'Font de Veritat' (Single Source of Truth) basada en tokens de disseny. Infraestructura escalable que permet localització ràpida en més de 4 països.",
      "challenge": "Fragmentació visual global i redundància operativa costant milions.",
      "solution": "Consolidació estratègica: de 146 components a 10 primitius. Implantació de model de governança per a 4 mercats.",
      "businessImpact": "Reducció d'OpEx en manteniment i acceleració de delivery en equips distribuïts.",
      "architecture": "Arquitectura multimarca basada en tokens integrada amb APIs per a sincronització visual.",
      "impact": {
        "adoption": "100%",
        "adoptionLabel": "Consistència de Marca",
        "efficiency": "93%",
        "efficiencyLabel": "Reducció de Components",
        "consistency": "4+",
        "consistencyLabel": "Països Sincronitzats"
      },
      "technologies": [
        "Design Tokens",
        "Models de Governança",
        "Escalat Multimarca",
        "Compliment Regulatori",
        "Integració API-Token"
      ],
      "leadership": true,
      "image": "/assets/images/case-studies/wu-ds.png",
      "link": "#western-union"
    },
    {
      "id": "alexa-multimodal",
      "title": "Innovació Multimodal",
      "status": "ON HOLD - 2020-2022",
      "company": "Amazon",
      "year": "2020-2022",
      "leadership": true,
      "role": "UX Engineer Manager",
      "timeline": "6 meses",
      "myRole": "Enginyer de Producte (Assistent Rufus AI)",
      "team": "Madrid, Seattle, Londres, Chicago",
      "description": "Creació del primer sistema de d'veu del món. Prototips d'alta fidelidad per a 'Rufus' (Next-Gen AI Assistant) presentats al CEO Andy Jassy. Estandardització de patrons VUI utilitzats per milions d'usuaris.",
      "challenge": "Definir estàndards d'experiència per a una tecnologia emergent (Veu/Multimodal) sense referències de mercat.",
      "solution": "Lideratge de la definició d'estàndards VUI. Influència en equips d'enginyeria ML per alinear tecnologia amb UX.",
      "businessImpact": "Presentació de visió estratègica al C-Level (Andy Jassy). Demostració de capacitat d'innovar en ambigüitat.",
      "architecture": "El repte real era implantar un sistema de disseny a les entranyes dels dispositius Alexa que funciona principalment amb fitxers JSON.",
      "impact": {
        "adoption": "Global",
        "adoptionLabel": "Escala",
        "efficiency": "6 meses",
        "efficiencyLabel": "Temps Estalviat",
        "consistency": "Redefinint i escalant la definició de sistemes de disseny.",
        "consistencyLabel": "Sistemes de Disseny"
      },
      "technologies": [
        "Voice UI",
        "Disseny Multimodal",
        "Prototipat IA",
        "Rufus AI",
        "ML Handoff"
      ],
      "image": "/assets/images/case-studies/rufus.gif",
      "videoUrl": "https://youtu.be/uXkDMBNCoFo",
      "content": "# Rufus: Assistent de IA per a Amazon Shopping\n\nRufus és un assistent de compres format en el catàleg de productes d'Amazon i en informació de tota la web per respondre a les preguntes dels clients sobre necessitats de compra, productes i comparacions.\n\n***\n\n## 🎥 Demostració de Rufus\n\n<div class=\"video-container\" style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; margin: 2rem 0; border-radius: var(--radius-md);\">\n  <iframe src=\"https://www.youtube.com/embed/uXkDMBNCoFo\" frameborder=\"0\" allowfullscreen style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%;\"></iframe>\n</div>\n\n***\n\n## 🧩 El Repte Multimodal\n\nEl veritable desafiament no va ser només crear un assistent de xat, sinó integrar aquesta intel·ligència en un ecosistema multimodal (Echo, FireTV, Mobile) on la veu i la interfície visual han de treballar en perfecta sincronia.\n\n### Arquitectura Multimodal\n\n- **Sincronització d'Estat**: Mantenir el context de la conversa a través de diferents dispositius.\n- **Adaptabilitat de UI**: Renderitzar components visuals que complementen la resposta de veu sense saturar l'usuari.\n- **Handoff de ML**: Traduir les intencions del model probabilístic a una interfície determinista i coherent.",
      "link": "#alexa-multimodal"
    },
    {
      "id": "amazon-business",
      "title": "Innovació en Tooling Intern",
      "status": "EINES INTERNES",
      "company": "Amazon Business",
      "year": "2021-2022",
      "leadership": true,
      "role": "Senior UX Engineer",
      "timeline": "4 meses",
      "myRole": "Arquitecte Principal i Product Owner",
      "team": "Madrid, Hyderabad, Seattle, Austin, Tokio",
      "description": "Creació de 'Telescope': una eina interna per assistir el prototipat, reduint el temps d'iteració en un 45%. Quan les eines no existeixen, les construeixo. Democratització del prototipat d'alta fidelitat en més de 12 equips.",
      "challenge": "Cicles de validació lents basats en eines de disseny estàtiques que no reflectien dades o restriccions de producció reals.",
      "solution": "Vaig construir 'Telescope', una eina de prototipat basada en codi adoptada globalment per a validació d'alta fidelitat.",
      "businessImpact": "Vaig reduir el temps de prototipat en un 45% (velocitat desenvolupament frontend) globalment i vaig guanyar dos premis 'Most Peculiar Amazonian' per innovació.",
      "architecture": "Entorn basat en React capaç de renderitzar prototips de grau de producció amb pipelines de dades en viu. Molts dels components, en ser de tanta qualitat, acabaven fent-se servir en producció.",
      "impact": {
        "adoption": "Global",
        "adoptionLabel": "Hubs Desplegats",
        "efficiency": "45%",
        "efficiencyLabel": "Velocitat Prototipat",
        "consistency": "Premiado",
        "consistencyLabel": "Innovació Amazon"
      },
      "technologies": [
        "React",
        "Validació Producte",
        "Disseny Code-First",
        "Eines Internes",
        "ROI Analytics"
      ],
      "image": "/assets/images/case-studies/telescope.png",
      "link": "#amazon-business"
    }
  ],
  "projects": [
    {
      "id": "western-union",
      "title": "Racionalització Radical",
      "company": "Western Union",
      "year": "2023-Present",
      "impact": "2023–Present",
      "description": "No un redisseny cosmètic, sinó una auditoria sistèmica i estratègia de governança federada. Implementació d'una 'Font de Veritat' (Single Source of Truth) basada en tokens de disseny. Infraestructura escalable que permet localització ràpida en més de 4 països.",
      "tags": [
        "Governança Federada",
        "Arquitectura Tokens",
        "Gestió Canvi"
      ],
      "image": "/assets/images/projects/wu-ds.png",
      "metrics": {
        "primary": "146 → 10",
        "primaryLabel": "Components Core Atòmics",
        "secondary": "-40%",
        "secondaryLabel": "Reducció OpEx"
      }
    },
    {
      "id": "alexa-multimodal",
      "title": "Innovació Multimodal",
      "company": "Amazon Alexa",
      "year": "2021-2022",
      "impact": "2021–2022",
      "description": "Creació del primer sistema de d'veu del món. Prototips d'alta fidelidad per a 'Rufus' (Next-Gen AI Assistant) presentats al CEO Andy Jassy. Estandardització de patrons VUI utilitzats per milions d'usuaris.",
      "tags": [
        "Voice UI",
        "Multimodalitat",
        "Col·laboració ML"
      ],
      "image": "/assets/images/projects/alexa.png",
      "metrics": {
        "primary": "C-Level",
        "primaryLabel": "Presentat al CEO",
        "secondary": "-6 mesos",
        "secondaryLabel": "Temps d'Integració"
      }
    },
    {
      "id": "amazon-business",
      "title": "Innovació en Tooling Intern",
      "company": "Amazon Business",
      "year": "2019-2021",
      "impact": "2019–2021",
      "description": "Creació de 'Telescope': una eina interna per assistir el prototipat, reduint el temps d'iteració en un 45%. Quan les eines no existeixen, les construeixo. Democratització del prototipat d'alta fidelitat en més de 12 equips.",
      "tags": [
        "Tooling Intern",
        "Prototipat",
        "Innovació Procés"
      ],
      "image": "/assets/images/projects/amazon-business.png",
      "metrics": {
        "primary": "-45%",
        "primaryLabel": "Temps Prototipat",
        "secondary": "12+",
        "secondaryLabel": "Equips Fent Servir l'Eina"
      }
    },
    {
      "id": "telefonica",
      "title": "Orígens Tècnics",
      "company": "Telefònica",
      "year": "2014-2019",
      "impact": "2014–2019",
      "description": "Desenvolupament de llibreries frontend reutilitzables per a desplegament ràpid de campanyes. Rol de Creative Technologist com a pont entre disseny i enginyeria. Fundació tècnica establerta: més de 10 anys a les trinxeres del frontend.",
      "tags": [
        "Creative Tech",
        "Frontend",
        "Llibreries Components"
      ],
      "image": "/assets/images/projects/telefonica.png",
      "metrics": {
        "primary": "10+",
        "primaryLabel": "Anys Frontend",
        "secondary": "Ràpid",
        "secondaryLabel": "Desplegament Campanyes"
      }
    }
  ],
  "ventureLab": {
    "title": "Com la IA em va permetre operar com un equip d'enginyeria de 5 persones",
    "subtitle": "Technical Venture",
    "role": "Fundador & Solo Builder",
    "period": "2024 — Present",
    "company": "BODADOS",
    "narrative": "Això no va de l'app. Va del procés. Bodados demostra que no només lidero equips humans a Western Union—sé com orquestrar forces laborals sintètiques (agents de IA) per construir software complex. Aquesta és una habilitat futurista que em posiciona per davant de la corba.",
    "pillars": [
      {
        "title": "Orquestració IA",
        "description": "Construcció i coordinació de múltiples agents de IA (Antigravity) que gestionen generació de codi, testing i desplegament."
      },
      {
        "title": "Direcció Tècnica",
        "description": "Selecció de stack (Next.js, Supabase) per maximitzar ROI. Cicles de desenvolupament reduïts un 70%."
      },
      {
        "title": "Validació de Negoci",
        "description": "Testing de mercat real: invitacions com a vectors virals, dinàmiques de cashflow, i optimització del k-factor."
      }
    ],
    "productModel": [
      {
        "stage": "Input",
        "items": [
          "Hipòtesis de Mercat",
          "Recerca Usuari",
          "Restriccions Tècniques"
        ]
      },
      {
        "stage": "Agents IA",
        "items": [
          "Framework Antigravity",
          "Generació Codi",
          "Auto-Testing"
        ]
      },
      {
        "stage": "Output",
        "items": [
          "Software Producció",
          "Aprenentatge Validat",
          "Infraestructura Escalable"
        ]
      }
    ],
    "link": "https://bodados.com"
  },
  "experience": [
    {
      "period": "2024 — Present",
      "company": "BODADOS",
      "role": "Operational Strategy Lead (Founder)",
      "description": "Orquestrant 'Wedding OS'. Lideratge de producte end-to-end: des de la visió de negoci i roadmap fins a l'arquitectura tècnica i gestió d'agents IA."
    },
    {
      "period": "2023 — Present",
      "company": "Western Union",
      "role": "UX Manager (Estratègia i Governança)",
      "description": "Arquitectant el Sistema de Disseny multimarca europeu. Consolidació radical de 146 components en 10 primitius atòmics. Impulsant el canvi cultural mitjançant Systems Thinking en Digital, App i Retail físic."
    },
    {
      "period": "2020 — 2023",
      "company": "Amazon Alexa",
      "role": "UX Engineer Manager",
      "description": "Vaig liderar el primer sistema de disseny de veu del món per a Alexa. Vaig enginyar prototips d'alta fidelitat per a 'Rufus' presentats al CEO Andy Jassy. Vaig reduir els temps d'integració en 6 mesos globalment."
    },
    {
      "period": "2021 — Present",
      "company": "Mr Marcel School / UOC",
      "role": "Professor de UX i Sistemes de Disseny",
      "description": "Formant la pròxima generació d'Arquitectes de Producte. Foc en la intersecció de Systems Thinking, fluxos de treball impulsats per IA i ROI quantificable. Sóc el poli dolent i convenço els dissenyadors per sortir de la zona de confort i saber llegir (que no escriure) codi."
    }
  ],
  "principles": [
    {
      "title": "El Codi és la Veritat",
      "content": "Si no està en producció, és només una opinió. El disseny és una hipòtesi; el codi és l'única validació real."
    },
    {
      "title": "Sistemes > Components",
      "content": "No construeixo biblioteques de UI estàtiques. Dissento fluxos de decisió i arquitectures que escalen amb el negoci."
    },
    {
      "title": "03 — IA com a Multiplicador",
      "content": "Apalancar IA per col·lapsar cicles d'exploració i boilerplate, reservant la intel·ligència humana per a validació estratègica i casos límit."
    }
  ],
  "advisory": [
    {
      "title": "Soci Estratègic per a VPs",
      "description": "Tradueixo objectius de negoci en execució tècnica. Ajudo VPs d'Enginyeria i Producte a alinear les seves organitzacions."
    },
    {
      "title": "Disseny Organitzacional",
      "description": "Ajudo a definir rols, ladders i processos de contractació per crear equips de Design Engineering d'alt rendiment."
    },
    {
      "title": "Tech Due Diligence",
      "description": "Auditoria d'arquitectura i escalabilitat per a inversors i fundadors. Identificació de deute tècnic crític abans d'escalar."
    }
  ],
  "now": {
    "lastUpdated": "15 Gen, 2026",
    "location": "Madrid, Espanya",
    "status": "Construint i Ensenyant",
    "items": [
      {
        "title": "Cultivant aquest Jardí Digital",
        "description": "Allunyant-me dels portfolios estàtics. Tractant aquest lloc com un sistema viu on l'enginyeria de disseny i la IA es troben. Construït amb vanilla JS i dades pures, sense frameworks, només ofici."
      },
      {
        "title": "Modo Incògnit: Redefinint els Esdeveniments",
        "description": "Construint una plataforma independent per transformar com vivim les trobades en viu. Creant un pont entre ofici, comunitat i l'escenari."
      },
      {
        "title": "Explorant Design Ops Agèntics",
        "description": "Construint eines privades per automatitzar les parts avorrides de la gestió de disseny (renombrar, linting, handoff) utilitzant LLMs."
      }
    ],
    "reading": {
      "title": "The Timeless Way of Building",
      "author": "Christopher Alexander"
    }
  },
  "links": {
    "substack": "https://joanarbo.notion.site/?pvs=74",
    "linkedin": "https://www.linkedin.com/in/joanarbo/",
    "email": "me@joanarbo.com"
  },
  "testimonials": [],
  "playground": [],
  "services": [
    {
      "id": "ds-mentorship",
      "icon": "ph-student",
      "title": "Mentoria de Design Systems",
      "description": "Sessions 1:1 per a líders de Disseny i Enginyeria. Desbloqueja problemes de governança, arquitectura o carrera.",
      "price": "€250 / sessió",
      "features": [
        "Revisió d'arquitectura",
        "Estratègia d'adopció",
        "Resolució de bloquejos polítics",
        "Career path per a Design Technologists"
      ],
      "cta": "Reservar sessió"
    },
    {
      "id": "build-with-me",
      "icon": "ph-code",
      "title": "Build With Me (Dia)",
      "description": "Un dia sencer construint junts. Tu i jo, en viu. Prototipem, codegem i resolem un problema real del teu sistema.",
      "price": "€1,200 / dia",
      "features": [
        "8 hores de foc intens",
        "Pair programming real",
        "Auditoria en temps real",
        "Lliurament de codi funcional"
      ],
      "cta": "Agendar dia"
    },
    {
      "id": "ds-audit",
      "icon": "ph-check-circle",
      "title": "Auditoria de Design System",
      "description": "Auditoria tècnica i de processos. En 2 setmanes et dic exactament per què el teu sistema no escala i com esmenar-lo.",
      "price": "Des de €3,500",
      "features": [
        "Anàlisi de deute tècnic",
        "Revisió de consistència visual",
        "Entrevistes amb equips",
        "Roadmap de refactorització"
      ],
      "cta": "Sol·licitar auditoria"
    }
  ],
  "stack": {
    "software": [
      {
        "name": "Cursor + Antigravity",
        "desc": "Editor de codi AI-first. La meva eina diària."
      },
      {
        "name": "Warp",
        "desc": "Gemini i Perplexity per a exploració i NotebookLM"
      },
      {
        "name": "Figma",
        "desc": "On comencen els sistemes de disseny."
      },
      {
        "name": "Notion",
        "desc": "Segon cervell i OS."
      }
    ],
    "analog": [
      {
        "name": "Leuchtturm1917",
        "desc": "Dotted A5. Bullet journaling diari."
      },
      {
        "name": "Rotring 600",
        "desc": "Llapis de dibuix. Enginyeria alemanya."
      },
      {
        "name": "Field Notes",
        "desc": "Per a captures ràpides."
      }
    ]
  }
}